{"courses_hp":{"DAS100":{"course_id":"DAS100","title":"DAS 100 Introduction to Disability Studies","desc":"This course provides a multidisciplinary introduction to the many dimensions of Disability Studies, including the history, social, cultural, political, legal, and economic perspectives on disability in American society. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"DAS397":{"course_id":"DAS397","title":"DAS 397 Topics in Disability Studies","req":"<em>Prerequisite: <span data-link='DAS100'>DAS 100</span> and permission.</em>","desc":"Topics of general interest in the area of Disability Studies. Examples: disability cultures, disability rights movement, deaf culture, disability and the law. Variable content course. May be repeated as topics change to a maximum of 6 hours. ","hours":{"credit":1},"offered":{"Upon demand":true}},"DAS497":{"course_id":"DAS497","title":"DAS 497 Directed Readings","req":"<em>Prerequisite: permission.</em>","desc":"Analysis of various topics in Disability Studies not covered in regular courses. May be repeated for a maximum of 6 hours, provided that the topic is different. ","hours":{"credit":1},"offered":{"Upon demand":true}},"GST170":{"course_id":"GST170","title":"GST 170 Sex, Gender, and Self","desc":"An introduction to Gender Studies that explores the influence that ideas about sex, gender, and gender roles have on women and men, both as individuals and as social beings. Using new research on gender in many disciplines, it examines representations of male and female experiences, and historical and social constructions of women&apos;s and men&apos;s roles. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"GST315":{"course_id":"GST315","title":"GST 315 The Economics of Gender","req":"<em>Prerequisite: <span data-link='ECO165'>ECO 165</span>.</em>","desc":"This course teaches students to analyze the economic decisions made by both males and females in two main areas: the labor market and the household. Specific areas of inquiry include the following: the family as an economic unit, gender differences in labor force participation, occupational gender segregation, explanations for gender earnings differentials and efforts to reduce such differentials, gender earnings discrimination, and international gender issues. Identical with <span data-link='ECO315'>ECO 315</span>. Cannot receive credit for both <span data-link='GST315'>GST 315</span> and <span data-link='ECO315'>ECO 315</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"GST326":{"course_id":"GST326","title":"GST 326 Feminist Theories of Social Order","req":"<em>Prerequisite: <span data-link='SOC150'>SOC 150</span> or <span data-link='GST170'>GST 170</span>.</em>","desc":"This course offers an introductory survey of feminist theories within a sociological framework. Students will read and discuss significant classical and contemporary feminist writings on how social life is organized, maintained or changed. The feminist literature has led to the emergence of diverse theoretical frameworks analyzing historical and contemporary, macro and micro, public and private, local and global issues and concerns. The feminist paradigm, like many other paradigms, is inclusive of many disciplines. The sociological writings within this paradigm provide a wealth of materials on alternative views of social organization, order and conflict. Identical with <span data-link='SOC326'>SOC 326</span>. Cannot receive credit for both <span data-link='GST326'>GST 326</span> and <span data-link='SOC326'>SOC 326</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"GST400":{"course_id":"GST400","title":"GST 400 Gender in Global Community","req":"<em>Prerequisite: <span data-link='SOC150'>SOC 150</span> or <span data-link='GST170'>GST 170</span>.</em>","desc":"This course will explore the effects of an integrated global community on gender; how global trends are gender-based in terms of labor market participation, resource allocation, family regulations, health care, crime, war and regional politics. Students will discuss how events and policies in one part of the globe affect gender relations in another region. May be taught concurrently with <span data-link='SOC600'>SOC 600</span>. Cannot receive credit for both <span data-link='GST400'>GST 400</span> and <span data-link='SOC600'>SOC 600</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}}},"courses_ac":{"ACC206":{"course_id":"ACC206","title":"ACC 206 Accounting Choices and Methods","req":"<em>Prerequisite: <span data-link='UHC110'>UHC 110</span>.</em>","desc":"Comprehensive and accelerated examination of alternative accounting models, including electronic spreadsheet models, and their uses. Replaces <span data-link='ACC201'>ACC 201</span> and 211 for Honors College students. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='ACC311'>ACC 311</span>. A grade of &quot;B&quot; or better is required in this course in order to take <span data-link='ACC301'>ACC 301</span> or <span data-link='ACC321'>ACC 321</span> or <span data-link='ACC532'>ACC 532</span>. Cannot be taken Pass/Not Pass. ","hours":{"credit":4,"lecture":4},"offered":{"Fall":true,"Spring":true}},"ACC209":{"course_id":"ACC209","title":"ACC 209 Accounting Applications for Microcomputers","desc":"Use of the microcomputer and electronic spreadsheets to master the basic accounting cycle. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"ACC211":{"course_id":"ACC211","title":"ACC 211 Introduction to Managerial Accounting","req":"<em>Prerequisite: <span data-link='ACC201'>ACC 201</span>; and <span data-link='CIS201'>CIS 201</span> or concurrent enrollment.</em>","desc":"Methods and procedures employed in managerial accounting with emphasis on the use of accounting data for decision making. At least one spreadsheet project will be assigned. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='ACC311'>ACC 311</span>. A grade of &quot;B&quot; or better is required in this course in order to take <span data-link='ACC301'>ACC 301</span>. Cannot be taken Pass/Not Pass. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"ACC297":{"course_id":"ACC297","title":"ACC 297 Topics in Accounting","desc":"A variable content course with topics that can change from semester to semester. Topics are identified by title in the schedule of classes. ","hours":{"credit":1},"offered":{"Upon demand":true}},"ACC300":{"course_id":"ACC300","title":"ACC 300 Professionalism in Accountancy","req":"<em>Prerequisite: grade of &quot;B&quot; or better in <span data-link='ACC201'>ACC 201</span> and <span data-link='ACC211'>ACC 211</span>, or grade of &quot;B&quot; or better in <span data-link='ACC206'>ACC 206</span>, or grade of &quot;B&quot; or better in <span data-link='ACC600'>ACC 600</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"Cases (including written and oral presentations) will focus on ethical and regulatory issues in accounting. Students will focus on professional behavior appropriate for accounting professionals. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='ACC302'>ACC 302</span> and <span data-link='ACC341'>ACC 341</span>. Research assignments are required. ","hours":{"credit":2,"lecture":2},"offered":{"Fall":true,"Spring":true}},"ACC301":{"course_id":"ACC301","title":"ACC 301 Intermediate Accounting I","req":"<em>Prerequisite: grade of &quot;B&quot; or better in <span data-link='ACC201'>ACC 201</span> and <span data-link='ACC211'>ACC 211</span> or grade of &quot;B&quot; or better in <span data-link='ACC206'>ACC 206</span> or <span data-link='ACC600'>ACC 600</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"Financial Accounting Theory applications to the accounting process of corporations. Review of financial statements; accounting for current and long-term assets. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='ACC302'>ACC 302</span>, 341, 553, or 653. Cannot be taken Pass/Not Pass. Research assignments are required. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"ACC302":{"course_id":"ACC302","title":"ACC 302 Intermediate Accounting II","req":"<em>Prerequisite: grade of &quot;C&quot; or better in <span data-link='ACC300'>ACC 300</span> and <span data-link='ACC301'>ACC 301</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"Continuation of intermediate accounting. Accounting for liabilities and equity. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='ACC504'>ACC 504</span>, 604, 506, 606, 553, or 653. Cannot be taken Pass/Not Pass. Research assignments are required. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}}},"courses_ag":{"AGB344":{"course_id":"AGB344","title":"AGB 344 Financing Agriculture","desc":"Recommended Prerequisite: <span data-link='AGB144'>AGB 144</span>. Capital requirements and sources and uses of each type of credit. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true,"Spring":true}},"AGB354":{"course_id":"AGB354","title":"AGB 354 Land Economics","desc":"Recommended Prerequisite: <span data-link='AGB144'>AGB 144</span>. Principles and institutions affecting the allocation of land resources among uses and users. ","hours":{"credit":2,"lecture":2},"offered":{"Fall":true,"Spring":true}},"AGB364":{"course_id":"AGB364","title":"AGB 364 Agricultural Commodity Futures and Options","desc":"Recommended Prerequisite: <span data-link='AGB334'>AGB 334</span>. Introduction to the economic theory, organization, and operating principles of agricultural commodity futures markets. Emphasis is placed on speculating, hedging, and investing in agricultural commodity futures contracts. ","hours":{"credit":2,"lecture":2},"offered":{"Summer":true}},"AGB374":{"course_id":"AGB374","title":"AGB 374 Agricultural Business Management","desc":"Recommended Prerequisite: <span data-link='AGB144'>AGB 144</span>. A study of agricultural firm management including planning, organizing, directing, controlling and coordinating functions used to attain business goals. The role of finance and type of business organization including agricultural cooperatives. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true}},"AGB384":{"course_id":"AGB384","title":"AGB 384 Agricultural Selling","desc":"Recommended Prerequisite: <span data-link='AGB334'>AGB 334</span>. Principles of selling with application to agricultural inputs and products. Attitudes, value systems, and behavioral patterns that relate to agricultural sales. Relationship of sales to marketing, selling strategies, preparing for sales calls, making sales presentations, handling objections, and closing sales. Analysis of the buying or purchasing process. Evaluation of agri-selling as a possible career choice. ","hours":{"credit":2,"lecture":2},"offered":{"Fall":true}},"AGB394":{"course_id":"AGB394","title":"AGB 394 Agricultural Industry Study","req":"<em>Prerequisite: concurrent enrollment in <span data-link='AGB494'>AGB 494</span> for 1 credit hour; completion of 60 hours including 6 hours in agricultural business; and permission of instructor.</em>","desc":"A five-day study alternating between St. Louis and Kansas City to examine the management process of a variety of agricultural businesses. May be repeated for a total of 2 credit hours. Supplemental course fee. ","hours":{"credit":1,"lab":2},"offered":{"Spring":true}},"AGB444":{"course_id":"AGB444","title":"AGB 444 American Agricultural Policy","desc":"Recommended Prerequisite: <span data-link='AGB144'>AGB 144</span>. Description and analysis of economic problems of U.S. Agriculture. History and significance of government programs to support farm prices and incomes, conserve land resources, encourage adequate food supplies and expand U.S. agricultural trade. ","hours":{"credit":2,"lecture":2},"offered":{"Spring":true}}},"courses_bs":{"ANE711":{"course_id":"ANE711","title":"ANE 711 Clinical Conference IV","req":"<em>Prerequisite: <span data-link='ANE708'>ANE 708</span>.</em>","desc":"Continuing review of significant cases involving complex anesthesia considerations. ","hours":{"credit":1,"lecture":1},"offered":{"Fall":true,"Spring":true}},"ANE714":{"course_id":"ANE714","title":"ANE 714 Orientation to Clinical Anesthesia","req":"<em>Prerequisite: permission from program director.</em>","desc":"Introduction to anesthesia equipment, monitoring equipment, positioning, intravenous considerations, records, departmental management, ethics, departmental organization and function, legal and professional aspects. ","hours":{"credit":1,"lecture":1},"offered":{"Fall":true,"Spring":true}},"ANE717":{"course_id":"ANE717","title":"ANE 717 Physics and Chemistry of Anesthesia","desc":"A presentation of the principles and laws of physics and chemistry applicable to the field of anesthesia. ","hours":{"credit":1,"lecture":1},"offered":{"Fall":true,"Spring":true}},"ANE720":{"course_id":"ANE720","title":"ANE 720 Basic Principles of Anesthesia","desc":"A presentation of the principles of laws of physics and chemistry applicable to the field of anesthesia long with an in-depth analysis of structure and function of the cardiac, respiratory, circulatory, endocrine, hepatic, renal, neurologic, autonomic, and central nervous systems. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"ANE723":{"course_id":"ANE723","title":"ANE 723 Application of Anatomy and Physiology to Anesthesia II","desc":"An in-depth analysis of the special relationships between anesthesiology and the endocrine, hepatatic, renal, neurologic, autonomic, and central nervous systems. ","hours":{"credit":1,"lecture":1},"offered":{"Fall":true,"Spring":true}},"ANE726":{"course_id":"ANE726","title":"ANE 726 Introduction to Clinical Anesthesia","desc":"Preoperative evaluation of patients, airway management, inhalation techniques, common complications of induction and emergence. Supplemental course fee. ","hours":{"credit":2,"lecture":2},"offered":{"Fall":true,"Spring":true}},"ANE732":{"course_id":"ANE732","title":"ANE 732 Advanced Anesthesia Principles I","req":"<em>Prerequisite: <span data-link='ANE720'>ANE 720</span>.</em>","desc":"An in-depth review of drugs commonly used to provide the state of anesthesia, review of subjects essential to the practice of anesthesia; emphasis on pediatrics, neonatal, critical care anesthesia, trauma and burns, organ transplants and organ retrieval, obesity and GI disorders, and a study of the requirements for specialized anesthesia care; regional anesthesia, chronic pain, cardiac, and vascular anesthesia. ","hours":{"credit":6,"lecture":6},"offered":{"Fall":true}}},"courses_so":{"ANT227":{"course_id":"ANT227","title":"ANT 227 Biological Anthropology","desc":"An examination of biological aspects of humanity from comparative and evolutionary perspectives. Topics include evolutionary theory, the origin and evolution of nonhuman primates and humans, primate behavior, biological variation among human populations, and anatomical and physiological influences on behavior. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"ANT240":{"course_id":"ANT240","title":"ANT 240 Introduction to Archaeology","desc":"An introduction to the goals, methods, theories, issues, and ethics of archaeology-the study of cultures in the past from the remains they left behind. Topics will include archaeological survey, excavation, dating techniques, artifact analysis, conservation, and cultural adaptation and change. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"ANT280":{"course_id":"ANT280","title":"ANT 280 Linguistic Anthropology","desc":"This course is an introduction to the field of linguistic anthropology, with special emphasis on language as a basic component of human culture. Subjects include the humanness of language, the study of linguistic structure, description and analysis of languages, origins of human speech, the history of languages and writing, the use of language in social relations, and the relationship among language, thought, and culture. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"ANT301":{"course_id":"ANT301","title":"ANT 301 Anthropology of Religion","req":"<em>Prerequisite: <span data-link='ANT100'>ANT 100</span> or <span data-link='ANT226'>ANT 226</span> or <span data-link='REL210'>REL 210</span>.</em>","desc":"Anthropological theory and cross-cultural comparison of religious belief and behavior, such as magic, sorcery, witchcraft, mythology, ritual, totemism, shamanism, cults and movements. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"ANT302":{"course_id":"ANT302","title":"ANT 302 Psychological Anthropology","req":"<em>Prerequisite: <span data-link='ANT100'>ANT 100</span> or 226.</em>","desc":"Cross-cultural and evolutionary perspectives on socialization, the self, personality, gender, normality, deviance, mental disorders, cognition, and emotion. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"ANT309":{"course_id":"ANT309","title":"ANT 309 Service Learning in Anthropology","req":"<em>Prerequisite: 30 hours and concurrent registration in an anthropology course designated as a service learning offering.</em>","desc":"An integrative learning experience which addresses the practice of citizenship and promotes an awareness of and participation in public affairs by incorporating community service with classroom instruction. Includes 40 hours on-task service to a community organization, agency or public sector provider. The community service placement agency and service assignment will vary, dependent on the disciplinary course topic and learning objectives. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"ANT320":{"course_id":"ANT320","title":"ANT 320 Ethnography","req":"<em>Prerequisite: <span data-link='ANT100'>ANT 100</span> or <span data-link='ANT226'>ANT 226</span>.</em>","desc":"In this course students will read, critique, and compare selected ethnographic accounts of societies around the world and explore ways in which anthropologists have written about and interpreted cultures. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_fl":{"ARB202":{"course_id":"ARB202","title":"ARB 202 Intermediate Arabic II","req":"<em>Prerequisite: C or better in <span data-link='ARB201'>ARB 201</span>.</em>","desc":"Continued development of the four skill areas through conversation, composition, and reading as a means to access culture. Credit by examination is available. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"ARB297":{"course_id":"ARB297","title":"ARB 297 Special Topics in Arabic","req":"<em>Prerequisite: permission of instructor and department head.</em>","desc":"Topics of selected interest in Arabic studies, including travel courses to Arabic-speaking countries. The specific subject matter and/or international component may vary according to resources and demand. Variable content course. May be repeated, as topics change, to a maximum of 6 hours. ","hours":{"credit":1},"offered":{"Upon demand":true}},"ARB305":{"course_id":"ARB305","title":"ARB 305 Advanced Arabic Proficiency Skills","req":"<em>Prerequisite: C or better in <span data-link='ARB202'>ARB 202</span>.</em>","desc":"Readings and discussions in modern standard Arabic, continuing the method used in teaching <span data-link='ARB201'>ARB 201</span> and 202. Enhances communicative skills by providing intensive practice in reading, writing, listening, speaking and active control of grammar and vocabulary. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"CHI101":{"course_id":"CHI101","title":"CHI 101 Elementary Chinese I","desc":"Essentials of grammar through aural-oral practice, dictation, reading and writing. Course conducted in Mandarin Chinese as far as practicable. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"CHI102":{"course_id":"CHI102","title":"CHI 102 Elementary Chinese II","req":"<em>Prerequisite: C or better in <span data-link='CHI101'>CHI 101</span>.</em>","desc":"Continuation of <span data-link='CHI101'>CHI 101</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"CHI201":{"course_id":"CHI201","title":"CHI 201 Intermediate Chinese I","req":"<em>Prerequisite: C or better in <span data-link='CHI102'>CHI 102</span>.</em>","desc":"Continuation of <span data-link='CHI102'>CHI 102</span> with emphasis on reading, conversation, and an introduction to Chinese history and culture. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"CHI202":{"course_id":"CHI202","title":"CHI 202 Intermediate Chinese II","req":"<em>Prerequisite: C or better in <span data-link='CHI201'>CHI 201</span>.</em>","desc":"Continuation of <span data-link='CHI201'>CHI 201</span> with emphasis on reading, conversation, history, and culture. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_ar":{"ART110":{"course_id":"ART110","title":"ART 110 Two-Dimensional Design for Digital Media","desc":"Elements and principles of two-dimensional design. Computers will be used extensively in this class. Will not count toward the BA in Art or Design, BFA in Art or Design, or the BSEd in Art and Design. ","hours":{"credit":3,"lab":6},"offered":{"Spring":true}},"ART115":{"course_id":"ART115","title":"ART 115 Drawing I","desc":"Basic elements and principles of drawing. A problematic approach to the process of seeing and drawing through an applied investigation of natural and man-made forms. ","hours":{"credit":3,"lab":6},"offered":{"Fall":true,"Spring":true}},"ART200":{"course_id":"ART200","title":"ART 200 Art in Context","req":"<em>General Education Course (Focus on the Arts).</em>","desc":"In this art appreciation course students will learn how to look at objects of art and to appreciate the value such objects hold in society. This course introduces the elements of art and the principles of design and is intended to enhance an interest, appreciation, and understanding of the visual arts in the context of their cultures. Does not count toward fulfilling any requirement for majors or minors in the Department of Art and Design. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"ART202":{"course_id":"ART202","title":"ART 202 Intermediate Design","req":"<em>Prerequisite: <span data-link='ART100'>ART 100</span> and <span data-link='ART101'>ART 101</span> and <span data-link='ART115'>ART 115</span>.</em>","desc":"A presentation in greater depth of major theories of art and design with emphasis on color theory and systems. Structured studio design problems applying and investigating such theories. ","hours":{"credit":3,"lab":6},"offered":{"Fall":true,"Spring":true}},"ART210":{"course_id":"ART210","title":"ART 210 Introduction to Digital Arts","req":"<em>Prerequisite: <span data-link='ART100'>ART 100</span> or <span data-link='ART110'>ART 110</span>; and <span data-link='CIS101'>CIS 101</span> or <span data-link='CSC101'>CSC 101</span> or <span data-link='CSC111'>CSC 111</span>.</em>","desc":"Exploration of digital art forms, focusing on the interrelationship of the digital technology on art and culture. The goal of the course is to weave technical skills into creative vision. ","hours":{"credit":3,"lab":6},"offered":{"Fall":true,"Spring":true}},"ART212":{"course_id":"ART212","title":"ART 212 Ceramics I","desc":"An introduction to handbuilding, wheel and firing processes, including raku. Fundamentals of ceramic materials, equipment, and preparation of clay and glazes. ","hours":{"credit":3,"lab":6},"offered":{"Fall":true,"Spring":true}},"ART215":{"course_id":"ART215","title":"ART 215 Drawing II","req":"<em>Prerequisite: <span data-link='ART115'>ART 115</span>.</em>","desc":"Continuation of drawing fundamentals in greater depth and exploration of additional media. ","hours":{"credit":3,"lab":6},"offered":{"Fall":true,"Spring":true}}},"courses_pa":{"AST114":{"course_id":"AST114","title":"AST 114 Survey of Astronomy","req":"<em>General Education Course (Focus on Physical Sciences).</em>","desc":"Historical and descriptive aspects of astronomy; topics of current interest related to space science. Cannot receive credit for both <span data-link='AST114'>AST 114</span> and 115. ","hours":{"credit":4,"lecture":4},"offered":{"Fall":true,"Spring":true}},"AST115":{"course_id":"AST115","title":"AST 115 Basic Astronomy","req":"<em>General Education Course (Focus on Physical Sciences).</em>","desc":"Historical and descriptive aspects of astronomy; topics of current interest related to space science. Laboratory consists of observations with telescopes and of experiments pertinent to the field. Cannot receive credit for both <span data-link='AST114'>AST 114</span> and 115. Supplemental course fee. ","hours":{"credit":4,"lecture":3,"lab":2},"offered":{"Fall":true,"Spring":true}},"AST311":{"course_id":"AST311","title":"AST 311 Astronomical Techniques","req":"<em>Prerequisite: <span data-link='MTH135'>MTH 135</span>; and either <span data-link='AST114'>AST 114</span> or <span data-link='AST115'>AST 115</span>.</em>","desc":"Intermediate level course; actual techniques of astronomical observation, methods of analysis of these observations, possible interpretations of acquired data. In laboratory, each student obtains observations for study in spectroscopy, photometry, photography, and CCD imaging. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true}},"AST313":{"course_id":"AST313","title":"AST 313 The New Solar Systems","req":"<em>Prerequisite: <span data-link='AST114'>AST 114</span> or <span data-link='AST115'>AST 115</span>; <span data-link='MTH138'>MTH 138</span> or above.</em>","desc":"A modern inquiry of the planets, comets, asteroids, and other members of our solar system and the planets of other stellar systems, based on recent interplanetary explorations and Earth-based observations. Cannot receive credit for both <span data-link='AST313'>AST 313</span> and <span data-link='AST513'>AST 513</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"AST315":{"course_id":"AST315","title":"AST 315 The Lives and Deaths of Stars","req":"<em>Prerequisite: <span data-link='AST114'>AST 114</span> or 115; and <span data-link='MTH138'>MTH 138</span> or above.</em>","desc":"The structure of stars, processes at work in stellar atmospheres, the formation process, and the evolution of stars into white dwarfs, neutron stars, or black holes. Cannot receive credit for both <span data-link='AST315'>AST 315</span> and <span data-link='AST515'>AST 515</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"AST317":{"course_id":"AST317","title":"AST 317 Our Universe, the Final Frontier","req":"<em>Prerequisite: <span data-link='AST114'>AST 114</span> or <span data-link='AST115'>AST 115</span>; and <span data-link='MTH138'>MTH 138</span> or above.</em>","desc":"Modern views on the structure of the Universe: its past, present, and future. Topics include the structure and content of our Galaxy and other galaxies, clusters of galaxies, the Big Bang theory (including Inflation), and the eventual fate of our Universe. Cannot receive credit for both <span data-link='AST317'>AST 317</span> and <span data-link='AST517'>AST 517</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"AST513":{"course_id":"AST513","title":"AST 513 Solar and Extra-Solar Systems","req":"<em>Prerequisite: <span data-link='AST114'>AST 114</span> or 115; and <span data-link='MTH303'>MTH 303</span>.</em>","desc":"Formation of planetary systems, planetary dynamics, and comparative planetology. Project required. Cannot receive credit for both <span data-link='AST313'>AST 313</span> and <span data-link='AST513'>AST 513</span>. May be taught concurrently with <span data-link='AST613'>AST 613</span>. Cannot receive credit for both <span data-link='AST613'>AST 613</span> and <span data-link='AST513'>AST 513</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}}},"courses_sm":{"ATC224":{"course_id":"ATC224","title":"ATC 224 Basic Athletic Training/Sports Medicine Techniques","req":"<em>Prerequisite: <span data-link='ATC221'>ATC 221</span> and <span data-link='BMS307'>BMS 307</span> (or concurrent enrollment with permission of program director).</em>","desc":"Procedures, techniques, principles and theory relative to development of essential cognitive and psychomotor competencies commonly used in athletic training. Supplemental course fee. ","hours":{"credit":4,"lecture":3,"lab":3},"offered":{"Fall":true}},"ATC225":{"course_id":"ATC225","title":"ATC 225 Athletic Training Observation","req":"<em>Prerequisite: <span data-link='ATC220'>ATC 220</span>.</em>","desc":"Clinical observation (50 hours) and experience for students considering a career in Athletic Training or related sports medicine field. Students will explore various athletic training employment settings and learn basic skills ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true}},"ATC240":{"course_id":"ATC240","title":"ATC 240 Clinical Practicum I","req":"<em>Prerequisite: <span data-link='ATC221'>ATC 221</span> and permission of program director.</em>","desc":"Supervised clinical experiences in athletic training. Emphasis on developing clinical skills required by athletic trainers. Students may be required to be in attendance during periods when regular university classes are not in session. Supplemental course fee. ","hours":{"credit":2,"lecture":1,"lab":2},"offered":{"Fall":true}},"ATC241":{"course_id":"ATC241","title":"ATC 241 Clinical Practicum II","req":"<em>Prerequisite: <span data-link='ATC221'>ATC 221</span> and <span data-link='ATC240'>ATC 240</span> and permission of program director.</em>","desc":"Continuation of supervised clinical experiences in athletic training. Emphasis on developing and refining clinical skills required by athletic trainers. Students may be required to be in attendance during periods when regular university classes are not in session. Supplemental course fee. ","hours":{"credit":2,"lecture":1,"lab":2},"offered":{"Spring":true}},"ATC297":{"course_id":"ATC297","title":"ATC 297 Special Topics","req":"<em>Prerequisite: permission of program director.</em>","desc":"Variable content and variable credit course. Special study of Sports Medicine and Athletic Training. May be repeated for credit to a maximum of 4 hours. Same topic may be repeated once for credit. ","hours":{"credit":1},"offered":{"Upon demand":true}},"ATC320":{"course_id":"ATC320","title":"ATC 320 Athletic Training Administration","req":"<em>Prerequisite: at least 75 hours towards Athletic Training major completed or at least 15 hours towards Sports Medicine minor completed; and permission of program director.</em>","desc":"Development and administration of current theories, methods and techniques related to the organization and administration of athletic training programs. Integration of leadership behaviors into the practice and management of athletic training practice areas such as program management, budget, insurance, facility design, legal issues, global issues, and ethics in the profession of athletic training will be discussed. Public Affairs Capstone Experience course. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"ATC324":{"course_id":"ATC324","title":"ATC 324 Therapeutic Modalities","req":"<em>Prerequisite: <span data-link='BMS308'>BMS 308</span> and permission of program director.</em>","desc":"A study of the theory and application of various therapeutic modalities used in the treatment of many injuries, including ultrasound, diathermy, electrical stimulation, hydrotherapy, cryotherapy, and thermotherapy. Supplemental course fee. May be taught concurrently with <span data-link='OTE624'>OTE 624</span>. Cannot receive credit for both <span data-link='ATC324'>ATC 324</span> and <span data-link='OTE624'>OTE 624</span>. ","hours":{"credit":4,"lecture":3,"lab":2},"offered":{"Spring":true}}},"courses_bi":{"BIO111":{"course_id":"BIO111","title":"BIO 111 Understanding Biological Systems Through Inquiry","req":"<em>Prerequisite: <span data-link='BIO101'>BIO 101</span> or concurrent enrollment. General Education Course (Focus on Life Sciences).</em>","desc":"A laboratory course that partially fulfills the general education requirement in the Life Sciences. Organisms are studied from their physiological, behavioral, ecological, hereditary, and evolutionary perspectives. Students will develop skills of gathering information about science, reasoning scientifically from that information and synthesizing responses to questions based upon that information in order to explain biological phenomena. Cannot count towards a biology major or minor. Students receiving credit towards graduation for <span data-link='BIO101'>BIO 101</span> and/or <span data-link='BIO111'>BIO 111</span> cannot also receive credit for <span data-link='BIO100'>BIO 100</span>. Supplemental course Fee. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true,"Summer":true}},"BIO121":{"course_id":"BIO121","title":"BIO 121 General Biology I","req":"<em>Prerequisite: eligibility for both <span data-link='ENG110'>ENG 110</span> and <span data-link='MTH135'>MTH 135</span>. General Education Course (Focus on Life Sciences).</em>","desc":"First half of 2-semester introductory biology sequence for biology majors and minors. Introduction to the concepts of biological structure and function at the molecular and cellular level, genetics, and evolution. Cannot be taken Pass/Not Pass. A grade of C or better is required in this course in order to take <span data-link='BIO122'>BIO 122</span>. Supplemental course fee. ","hours":{"credit":4,"lecture":3,"lab":3},"offered":{"Fall":true,"Spring":true}},"BIO122":{"course_id":"BIO122","title":"BIO 122 General Biology II","req":"<em>Prerequisite: eligibility for both <span data-link='ENG110'>ENG 110</span> and <span data-link='MTH135'>MTH 135</span>.</em>","desc":"Recommended Prerequisite: <span data-link='BIO121'>BIO 121</span>. Second half of two-semester introductory biology sequence for biology majors and minors. Introduction to the biology of organisms including evolutionary history, diversity, structure, and function of major taxa; and ecology. Cannot be taken Pass/Not Pass. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='BIO235'>BIO 235</span>, <span data-link='BIO320'>BIO 320</span>, or <span data-link='BIO369'>BIO 369</span>. ","hours":{"credit":4,"lecture":3,"lab":3},"offered":{"Fall":true,"Spring":true}},"BIO197":{"course_id":"BIO197","title":"BIO 197 Selected Topics in Biology","req":"<em>Prerequisite: permission of instructor.</em>","desc":"Course devoted to a biologic topic of current interest. Provided the topics are different, the course may be repeated to a total of 4 hours. Credit for this course cannot be applied to the minimum requirements of a major or minor in biology, or the general education (Focus on Life Sciences) requirement. Supplemental course fee (variable by section). ","hours":{"credit":1},"offered":{"Upon demand":true}},"BIO205":{"course_id":"BIO205","title":"BIO 205 Life Science for Middle School","req":"<em>Prerequisite: <span data-link='BIO100'>BIO 100</span> or <span data-link='BIO101'>BIO 101</span> and 111.</em>","desc":"Processes of science using the inquiry approach with reference to society, technology, and decision-making. Content covers cellular biology, plant and animal structure and function, ecology and environmental biology. Does not count for credit towards major or minor in biology. ","hours":{"credit":2,"lecture":1,"lab":3},"offered":{"Spring":true}},"BIO210":{"course_id":"BIO210","title":"BIO 210 Elements of Microbiology","req":"<em>Prerequisite: <span data-link='CHM116'>CHM 116</span> and 117 or <span data-link='CHM160'>CHM 160</span>; and 4 hours of BIO or BMS courses.</em>","desc":"Public health aspects of microbiology, particularly causes and control of infectious diseases, immunology, sterilization and disinfection, and food and water bacteriology. A student who takes <span data-link='BIO210'>BIO 210</span> and <span data-link='BIO310'>BIO 310</span> receives credit toward graduation only for <span data-link='BIO310'>BIO 310</span>. Supplemental course fee. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true,"Spring":true}},"BIO215":{"course_id":"BIO215","title":"BIO 215 Introduction to the Diversity of Life","req":"<em>Prerequisite: 4 hours of biology.</em>","desc":"Introduction to the diversity in structure and function of protists, fungi, plants and animals. This course is designed for BSEd students and does not count toward a BA or BS in Biology. ","hours":{"credit":2,"lecture":1,"lab":3},"offered":{"Upon demand":true}}},"courses_ci":{"BSE503":{"course_id":"BSE503","title":"BSE 503 Teaching of Business","req":"<em>Prerequisite: <span data-link='EDC350'>EDC 350</span>; and <span data-link='ACC211'>ACC 211</span> or <span data-link='ACC206'>ACC 206</span>; and admitted to Teacher Education Program; and 70 hours; and approved major or minor in business.</em>","desc":"Development of a philosophy for and about business education; study of relevant legislation; study of methods of teaching selected business subjects including use of research-based readings, observation, and microteaching. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='BSE493'>BSE 493</span> or <span data-link='BSE494'>BSE 494</span>. Cannot be taken Pass/Not Pass. May be taught concurrently with <span data-link='BSE603'>BSE 603</span>. Cannot receive credit for both <span data-link='BSE603'>BSE 603</span> and <span data-link='BSE503'>BSE 503</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"BSE509":{"course_id":"BSE509","title":"BSE 509 Business Education Workshop","desc":"Development and promotion of desirable programs in business education. Each workshop emphasizes a single topic. May be repeated for a maximum of 5 hours when topic varies. May be taught concurrently with <span data-link='BSE609'>BSE 609</span>. Cannot receive credit for both <span data-link='BSE609'>BSE 609</span> and <span data-link='BSE509'>BSE 509</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}},"BSE520":{"course_id":"BSE520","title":"BSE 520 Occupational Analysis","req":"<em>Prerequisite: teacher certification student.</em>","desc":"Analysis and breakdown of broad occupations or specific jobs into basic elements for instructional purposes. Identical with <span data-link='AGV520'>AGV 520</span>. May be repeated to a total of 2 hours when topic varies. May be taught concurrently with <span data-link='BSE620'>BSE 620</span>. Cannot receive credit for both <span data-link='BSE620'>BSE 620</span> and <span data-link='BSE520'>BSE 520</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}},"BSE522":{"course_id":"BSE522","title":"BSE 522 Philosophy of Vocational Education","desc":"Philosophical foundations of vocational education; philosophies of vocational education in the contemporary school. Meets Missouri Vocational Education certification requirements. Identical with <span data-link='AGV522'>AGV 522</span> and <span data-link='SEC522'>SEC 522</span>. May be repeated to a total of 3 hours when topic varies. May be taught concurrently with <span data-link='BSE622'>BSE 622</span>. Cannot receive credit for both <span data-link='BSE622'>BSE 622</span> and <span data-link='BSE522'>BSE 522</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}},"BSE523":{"course_id":"BSE523","title":"BSE 523 Guidance for Vocational Development","req":"<em>Prerequisite: teacher certification student.</em>","desc":"Materials, procedures, and problems in guidance of individuals in the selection of, preparation for, and advancement in a vocation. Identical with <span data-link='AGV523'>AGV 523</span>. May be repeated to a total of 3 hours when topic varies. May be taught concurrently with <span data-link='BSE623'>BSE 623</span>. Cannot receive credit for both <span data-link='BSE623'>BSE 623</span> and <span data-link='BSE523'>BSE 523</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}},"BSE524":{"course_id":"BSE524","title":"BSE 524 Implementing Vocational Business Education Programs","req":"<em>Prerequisite: teacher certification student.</em>","desc":"Problems; procedures; and local, state and federal relationships in the implementation and administration of vocational business education in the contemporary school. May be taught concurrently with <span data-link='BSE624'>BSE 624</span>. Cannot receive credit for both <span data-link='BSE624'>BSE 624</span> and <span data-link='BSE524'>BSE 524</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}},"BSE526":{"course_id":"BSE526","title":"BSE 526 Coordination of Cooperative Education","req":"<em>Prerequisite: teacher certification student.</em>","desc":"Problems and procedures in organizing and operating part-time cooperative and evening occupation programs. Restricted to those who can qualify as coordinators. Identical with <span data-link='AGV526'>AGV 526</span> and <span data-link='SEC526'>SEC 526</span>. May be repeated to a total of 2 hours when topic varies. May be taught concurrently with <span data-link='BSE626'>BSE 626</span>. Cannot receive credit for both <span data-link='BSE626'>BSE 626</span> and <span data-link='BSE526'>BSE 526</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}}},"courses_fg":{"BUS305":{"course_id":"BUS305","title":"BUS 305 Service Learning in Business","req":"<em>Prerequisite: 30 hours and concurrent registration in a Finance and General Business department course designated as a service learning offering; and undergraduate business majors must be admitted to degree program.</em>","desc":"This service component for an existing course incorporates community service with classroom instruction in business to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"BUS307":{"course_id":"BUS307","title":"BUS 307 Business in the Community","req":"<em>Prerequisite: undergraduate business majors must be admitted to degree program.</em>","desc":"Study and application of business within the community. Topics include: planning and management of organizations from the viewpoint of education, community, and business; development of new business; organizational structure; interpersonal skills; funding and allocation resources of private, public and non-profit organizations. Allows for direct contact with local community leaders in education and business as well as opportunity to develop individual skills. Group dynamics and individual initiative are emphasized. May be available with <span data-link='BUS305'>BUS 305</span> Service Learning option and be repeated to a total of 6 hours. ","hours":{"credit":2},"offered":{"Upon demand":true}},"BUS394":{"course_id":"BUS394","title":"BUS 394 Cooperative Education in Business","req":"<em>Prerequisite: acceptance into Cooperative Education Program and permission of department head; undergraduate business majors must be admitted to degree program.</em>","desc":"The opportunity to earn academic credit in a planned learning process that integrates academic training with a supervised work experience. This is a variable content course that may be repeated to a total of 6 hours in Cooperative Education. ","hours":{"credit":1},"offered":{"Upon demand":true}},"BUS397":{"course_id":"BUS397","title":"BUS 397 Topics in Business","req":"<em>Prerequisite: undergraduate business majors must be admitted to degree program.</em>","desc":"A variable content course with topics that can change from semester to semester. Topics are identified by title in the schedule of classes. Examples include: Employment Discrimination Law, Tax Planning for Real Estate Investments, and special courses in Insurance. May be repeated to a total of 6 hours. ","hours":{"credit":1},"offered":{"Upon demand":true}},"BUS494":{"course_id":"BUS494","title":"BUS 494 Internship","req":"<em>Prerequisite: 80 hours; academic preparation in the field of internship; permission of department head; and undergraduate business majors must be admitted to degree program.</em>","desc":"A variable content course. Internships to be identified by title in the schedule of classes include Finance, Financial Planning, General Business, Insurance, and Real Estate. Opportunity to obtain practical understanding through work experience with a cooperating business or financial institution, financial planning firm, insurance company or real estate firm. Employment and outline of study must be company approved prior to enrollment. May be repeated to a total of 3 hours. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"BUS510":{"course_id":"BUS510","title":"BUS 510 E-Business and Online Entrepreneurship","req":"<em>Prerequisite: 54 hours; and undergraduate business majors must be admitted to degree program.</em>","desc":"A study of e-business and online entrepreneurship from an applied, best practices point of view. Classroom visits by online entrepreneurs provide unique, real-world insights into the advantages, disadvantages, and challenges of doing business over the Internet. May be taught concurrently with <span data-link='BUS610'>BUS 610</span>. Cannot receive credit for both <span data-link='BUS510'>BUS 510</span> and <span data-link='BUS610'>BUS 610</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"BUS550":{"course_id":"BUS550","title":"BUS 550 Negotiation, Mediation, and Arbitration in Business","req":"<em>Prerequisite: 60 hours; and undergraduate business majors must be admitted to degree program.</em>","desc":"A practical, skills-based study of negotiation, mediation, and arbitration from the business manager&apos;s perspective. This hands-on course is designed to develop the skills necessary to enable the business manager to effectively participate in negotiation, mediation, and arbitration as alternatives to litigation for resolving business disputes. Identical with <span data-link='LAW550'>LAW 550</span>. May be taught concurrently with <span data-link='BUS650'>BUS 650</span>. Cannot receive credit for more than one of <span data-link='BUS550'>BUS 550</span>, <span data-link='BUS650'>BUS 650</span>, <span data-link='LAW550'>LAW 550</span>, or <span data-link='LAW650'>LAW 650</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}}},"courses_ef":{"CFD160":{"course_id":"CFD160","title":"CFD 160 Principles of Development in Early Childhood","desc":"Development of the child from conception through 8 years of age including weekly laboratory experience with preschool children. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true,"Spring":true}},"CFD163":{"course_id":"CFD163","title":"CFD 163 Relationships in Today's Families","req":"<em>General Education Course (Focus on Social and Behavioral Sciences).</em>","desc":"Personal and family living in the early stages of family life cycle. Concepts and methods used in initiating, building, maintaining and enriching relationships. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"CFD197":{"course_id":"CFD197","title":"CFD 197 Introductory Topics in Child and Family Development","desc":"Variable content course for introductory concepts in Child and Family Development. May be repeated to a total of 6 hours when topics change. ","hours":{"credit":1},"offered":{"Upon demand":true}},"CFD250":{"course_id":"CFD250","title":"CFD 250 Parenting in Contemporary Society","desc":"Explores parenting and child rearing in today&apos;s society. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"CFD255":{"course_id":"CFD255","title":"CFD 255 Principles of Development in Infancy","req":"<em>Prerequisite: <span data-link='CFD160'>CFD 160</span>.</em>","desc":"Child from conception through two years, including prenatal environment. Two hours laboratory experience weekly in infant-toddler child development laboratory. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Upon demand":true}},"CFD256":{"course_id":"CFD256","title":"CFD 256 Supervised Experience in the Infant Toddler Center","desc":"Experience in applying effective techniques that optimize infant toddler development with 2-hours per week of participation in the infant toddler laboratory. ","hours":{"credit":1,"lab":2},"offered":{"Upon demand":true}},"CFD257":{"course_id":"CFD257","title":"CFD 257 Principles of Development in Middle Childhood","desc":"Development of the child from six through twelve years in cognitive, physical, social, emotional aspects. Contact with groups of children in this age range is arranged. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}}},"courses_ch":{"CHM117":{"course_id":"CHM117","title":"CHM 117 Fundamentals of Chemistry Laboratory","req":"<em>Prerequisite: &quot;C-&quot; or better in <span data-link='CHM116'>CHM 116</span> or concurrent enrollment; concurrent enrollment in <span data-link='MTH102'>MTH 102</span> or <span data-link='MTH103'>MTH 103</span> or eligibility for a higher mathematics course. General Education Course (Focus on Physical Sciences).</em>","desc":"Emphasis on experiments and lab skills associated with the lecture material in <span data-link='CHM116'>CHM 116</span>, such as chemical fundamentals and applications. Recommended for students needing only one semester of general chemistry lab. Cannot be counted towards a chemistry major or minor. Cannot be taken Pass/Not Pass. Supplemental course fee. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true}},"CHM160":{"course_id":"CHM160","title":"CHM 160 General Chemistry I","req":"<em>Prerequisite: eligibility for <span data-link='MTH135'>MTH 135</span> or higher.</em>","desc":"Concurrent enrollment in <span data-link='CHM161'>CHM 161</span> is highly recommended. Emphasis on fundamental and theoretical concepts of chemistry. Recommended for all science majors, chemistry majors and minors, and most preprofessional students. A grade of &quot;C-&quot; or better is required in this course in order to take <span data-link='CHM170'>CHM 170</span> or <span data-link='CHM171'>CHM 171</span>. Cannot be taken Pass/Not Pass. ","hours":{"credit":4,"lecture":4},"offered":{"Fall":true,"Spring":true}},"CHM161":{"course_id":"CHM161","title":"CHM 161 General Chemistry I Laboratory","req":"<em>Prerequisite: <span data-link='CHM160'>CHM 160</span> or concurrent enrollment.</em>","desc":"An introduction to laboratory chemistry employing principles and techniques that reflect material presented in <span data-link='CHM160'>CHM 160</span>, e.g., synthesis, stoichiometry, physical studies, and data manipulation and interpretation. A grade of &quot;C-&quot; or better is required in this course in order to take <span data-link='CHM171'>CHM 171</span>. Cannot be taken Pass/Not Pass. Supplemental course fee. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true}},"CHM170":{"course_id":"CHM170","title":"CHM 170 General Chemistry II","req":"<em>Prerequisite: &quot;C-&quot; grade or better in <span data-link='CHM160'>CHM 160</span>.</em>","desc":"Concurrent enrollment in <span data-link='CHM171'>CHM 171</span> is highly recommended. Emphasis on reaction kinetics, chemical equilibrium, precipitation reactions, acid-base theory and oxidation-reduction reactions. A grade of &quot;C-&quot; or better is required in this course in order to take <span data-link='CHM342'>CHM 342</span>, 352, or 506. Cannot be taken Pass/Not Pass. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"CHM171":{"course_id":"CHM171","title":"CHM 171 General Chemistry II Laboratory","req":"<em>Prerequisite: <span data-link='CHM170'>CHM 170</span> or concurrent enrollment; and a &quot;C-&quot; or better in <span data-link='CHM160'>CHM 160</span> and <span data-link='CHM161'>CHM 161</span>.</em>","desc":"An introduction to laboratory chemistry, employing principles and techniques that reflect material presented in <span data-link='CHM170'>CHM 170</span>, e.g., physical studies on kinetics and equilibria of aqueous systems, qualitative and quantitative analysis, and data manipulation and interpretation. A grade of &quot;C-&quot; or better is required in this course in order to take <span data-link='CHM302'>CHM 302</span> or 342. Cannot be taken Pass/Not Pass. Supplemental course fee. ","hours":{"credit":1,"lab":3},"offered":{"Fall":true,"Spring":true}},"CHM197":{"course_id":"CHM197","title":"CHM 197 Chemical Topics","desc":"For non-science majors: a single topic of contemporary, historical or theoretical significance. Topics may vary each semester; course may be repeated any number of times provided the same topic is not retaken. Variable content course. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"CHM201":{"course_id":"CHM201","title":"CHM 201 Essentials of Organic Chemistry","req":"<em>Prerequisite: a &quot;C-&quot; grade or better in <span data-link='CHM116'>CHM 116</span> or <span data-link='CHM170'>CHM 170</span>.</em>","desc":"Principles of organic chemistry and biochemistry. The laboratory associated with this course is <span data-link='CHM202'>CHM 202</span>. Cannot be counted toward a chemistry major or minor if student passes <span data-link='CHM342'>CHM 342</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}}},"courses_cm":{"COM205":{"course_id":"COM205","title":"COM 205 Interpersonal Communication Theory and Skills","desc":"Theory and practice in the principles and skills of interpersonal communication within a variety of contexts. Representative topics include: perception; self-concept development; verbal and nonverbal communication; effective listening techniques; conflict resolution; and sensitivity to cultural and gender differences. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"COM206":{"course_id":"COM206","title":"COM 206 Introduction to Health Communication","desc":"An introductory survey of contemporary health communication issues, including patient-provider communication, health ethics, health organizations, health campaigns, and health and the media. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"COM209":{"course_id":"COM209","title":"COM 209 Survey of Communication Theory","desc":"A survey of selected theoretical approaches to understanding mediated and non-mediated human communication. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"COM210":{"course_id":"COM210","title":"COM 210 Communication Research Methods","desc":"Recommended Prerequisite: <span data-link='COM209'>COM 209</span>. A survey of the quantitative and qualitative methods most commonly used for research in communication. Topics include the nature of the research process; research ethics; academic vs. applied research; evaluating research; and a discussion of specific research methods such as experimental design, statistical interpretation, survey research, individual and group interviewing, sampling and polling, content analysis, ethnography, and qualitative analysis techniques. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"COM300":{"course_id":"COM300","title":"COM 300 Careers in Communication","req":"<em>Prerequisite: <span data-link='COM115'>COM 115</span> and <span data-link='COM209'>COM 209</span>.</em>","desc":"This course assists Communication students to assess their abilities and qualifications, to research professional opportunities, and to prepare for job searching and career planning. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"COM305":{"course_id":"COM305","title":"COM 305 Service Learning in Communication","req":"<em>Prerequisite: 30 hours and concurrent registration in a communication course designated as a service learning offering.</em>","desc":"This service component for an existing course incorporates community service with classroom instruction in communication to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"COM307":{"course_id":"COM307","title":"COM 307 Gender and Communication","desc":"This course examines theory and research on gender and communication. Its purpose is to help students explore how gender and communication are interrelated, how these concepts intertwine with other aspects of our identities, and how these factors play out in their own lives. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_cl":{"COU703":{"course_id":"COU703","title":"COU 703 Mental Health Counseling Foundations and Ethics","desc":"An introduction and overview of the history, philosophy, and function of the counselor in mental health and other community agency settings. Includes an examination of service population characteristics and treatment needs, intervention modalities and approaches, professional identity, and related topics. Includes a significant focus on ethical standards and issues. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"COU705":{"course_id":"COU705","title":"COU 705 Orientation to Personal and Professional Development","desc":"This course is an experience in personal and group encountering and sensitivity. Its purpose is to assist students in discovering a more complete awareness, understanding, and acceptance of themselves and others as human beings. Primary emphasis will be upon students exploring self, values, needs, and personal characteristics. Graded Pass/Not Pass only. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"COU707":{"course_id":"COU707","title":"COU 707 Human Development and Personality","desc":"Study of child, adolescent and adult psychological development theories, normal adjustment processes, personality structure, and abnormal behavior. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"COU708":{"course_id":"COU708","title":"COU 708 Child Counseling Theories and Techniques","req":"<em>Prerequisite: admission to the Counseling program; and <span data-link='COU702'>COU 702</span> or <span data-link='COU703'>COU 703</span>; and <span data-link='COU705'>COU 705</span> and <span data-link='COU710'>COU 710</span> and <span data-link='COU711'>COU 711</span> or departmental permission.</em>","desc":"A consideration of major theories of counseling as they are related to counseling with elementary school-aged children. Emphasis is placed upon the counseling process as it affects the educational, personal, and social adjustment of children. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"COU710":{"course_id":"COU710","title":"COU 710 The Helping Relationship","req":"<em>Prerequisite: admission to Counseling program or Student Affairs in Higher Education program; and concurrent enrollment in <span data-link='COU711'>COU 711</span>.</em>","desc":"Two training components are integrated to provide an intensive pre-practicum experience. The didactic component introduces basic skills of effective interpersonal communication and counseling. Participation in co-requisite laboratory (<span data-link='COU711'>COU 711</span>) provides supervised practice in the practical application of those skills in simulated counseling interviews. ","hours":{"credit":2,"lecture":2},"offered":{"Upon demand":true}},"COU711":{"course_id":"COU711","title":"COU 711 The Helping Relationship Lab","req":"<em>Prerequisite: admission to Counseling program or Student Affairs in Higher Education program.</em>","desc":"First enrollment must be concurrent with <span data-link='COU710'>COU 710</span>. Designed to accompany <span data-link='COU710'>COU 710</span>, this lab provides an opportunity for graduate students in counseling to practice basic counseling skills in role-played sessions with live observation, video-taped review and supervisory feedback. May be repeated to 3 hours. Graded Pass/Not Pass only. ","hours":{"credit":1,"lab":3},"offered":{"Upon demand":true}},"COU714":{"course_id":"COU714","title":"COU 714 Diversity and Multicultural Issues in Counseling","req":"<em>Prerequisite: admission to Counseling program.</em>","desc":"An introduction to counseling theories, interventions and issues in working with clients from diverse, minority and ethnic cultures. Values, beliefs and norms of various cultures, including the student&apos;s, will be examined as they pertain to the counseling process. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_cr":{"CRM260":{"course_id":"CRM260","title":"CRM 260 Criminal Law and the Courts","desc":"This course examines the basic principles, processes, and structures found in adult criminal courts in the United States and Missouri. The course also examines the nature and development of criminal law from the Common Law to its current state nationwide, with an emphasis on current Missouri criminal law. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"CRM270":{"course_id":"CRM270","title":"CRM 270 Institutional and Community-Based Corrections","desc":"A course designed to critically examine the various social control responses to delinquent and criminal behavior. Includes the history, philosophies, and practices of American corrections and an evaluation of the advantages and disadvantages of each societal/correctional response. Problems in the field of corrections and related solutions are also examined. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"CRM300":{"course_id":"CRM300","title":"CRM 300 Service Learning in Criminology","req":"<em>Prerequisite: 30 hours and concurrent registration in a Criminology course designated as service learning offering.</em>","desc":"An integrative learning experience which addresses the practice of citizenship and promotes an awareness of and participation in public affairs by incorporating community service with classroom instruction. Includes 40 hours on-task service to a community organization, agency or public service provider. The community service placement agency and service assignment will vary, dependent on the disciplinary course topic and learning objectives. May be repeated. ","hours":{"credit":1},"offered":{"Upon demand":true}},"CRM301":{"course_id":"CRM301","title":"CRM 301 Crime and the Media","desc":"A sociologically-based exploration of the relationship between various forms of mass media as they impact public attitudes and social policies regarding crime and the justice system. Solutions to problems created by the media are also discussed. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"CRM302":{"course_id":"CRM302","title":"CRM 302 Reforming America's Prisons","desc":"This course explores the nature of confinement used by the American criminal justice system and includes a study of prisons and jails. Both the humanitarian and rehabilitative conditions of these facilities are reviewed in a critical context with attention paid to ways in which existing problems may be corrected. Prison reform is studied from a system-wide perspective recognizing the role of legislatures, courts, and the public in bringing about effective reform. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"CRM303":{"course_id":"CRM303","title":"CRM 303 Capital Punishment","desc":"Students explore the history of the death penalty as well as its current use in the United States. Methods of execution and their impact upon executioners, death penalty jurors, and the families of both the executed and their victim&apos;s family members are analyzed. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"CRM304":{"course_id":"CRM304","title":"CRM 304 Sex Crimes","desc":"This course highlights sex offenses, sex offenders, victims of sex offenses and a variety of responses to sexual offending patterns. Definition of different sex crimes will be discussed, along with an examination of the violence involved and policies geared towards these types of offenses. Methods of working with sex offenders in rehabilitative efforts are also discussed. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}}},"courses_cs":{"CSC125":{"course_id":"CSC125","title":"CSC 125 Introduction to C++ Programming","desc":"Programming and problem-solving using C++. Language constructs for assignment, flow control, input/output and functions are studied and applied. Techniques of object-oriented programming are introduced. ","hours":{"credit":4,"lecture":3,"lab":2},"offered":{"Fall":true}},"CSC130":{"course_id":"CSC130","title":"CSC 130 The World of Computer Science","desc":"A broad overview of computer science, with topics ranging from the basic structure of a computer to artificial intelligence. Students will use a high-level language to investigate and implement solutions to problems in a range of fields. Suitable for non-majors who want to learn more about computer science. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"CSC131":{"course_id":"CSC131","title":"CSC 131 Computational Thinking","req":"<em>Prerequisite: &quot;C&quot; or better in <span data-link='CSC130'>CSC 130</span> and eligible for <span data-link='MTH261'>MTH 261</span>.</em>","desc":"Solving problems using computation and implementing solutions in a high-level programming language. Introduction to problem analysis, solution design, data structures, and algorithms. ","hours":{"credit":4,"lecture":3,"lab":2},"offered":{"Fall":true,"Spring":true}},"CSC197":{"course_id":"CSC197","title":"CSC 197 Introductory Topics in Computer Science","desc":"Variable content course with topics that can change from semester to semester. Topics will be identified by title in the schedule of classes. The course may be repeated if a different topic is offered, however, no more than six credits may count toward any degree. ","hours":{"credit":1},"offered":{"Upon demand":true}},"CSC210":{"course_id":"CSC210","title":"CSC 210 Public Affairs Issues in Computing","req":"<em>Prerequisite: 12 hours. General Education Course (Focus on Public Issues).</em>","desc":"An introduction to public affairs issues in computing. Topics include civic applications, public sources of data, data and computer system security, opportunities and dangers of artificial intelligence and data mining, social media and computer mediated collaboration, and cultural factors in the internationalization of software. Student will design a civic application or system intended to serve the public good. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"CSC226":{"course_id":"CSC226","title":"CSC 226 Special Languages","desc":"Study of computer languages and their use in particular application domains. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"CSC232":{"course_id":"CSC232","title":"CSC 232 Data Structures","req":"<em>Prerequisite: &quot;C&quot; or better in <span data-link='CSC130'>CSC 130</span> and <span data-link='CSC131'>CSC 131</span>; and <span data-link='MTH215'>MTH 215</span> or <span data-link='MTH315'>MTH 315</span> or concurrent enrollment.</em>","desc":"A continuation of <span data-link='CSC131'>CSC 131</span>. Topics will include: algorithm design; complexity analysis; abstract data types and encapsulation; basic data structures and their application, including stacks, queues, linked lists and binary trees; dynamic memory allocation; recursion; sorting and searching; debugging techniques. ","hours":{"credit":4,"lecture":3,"lab":2},"offered":{"Fall":true,"Spring":true}}},"courses_cd":{"CSD216":{"course_id":"CSD216","title":"CSD 216 Anatomy and Physiology of Speech","desc":"Particular structure and functions of human anatomy related to the processes of speech. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"CSD260":{"course_id":"CSD260","title":"CSD 260 Survey of Interests in Deaf and Hard of Hearing","desc":"A survey course on the effects of hearing impairments as they relate to development, learning, education, and social interaction across the lifespan. Resources and agencies that assist persons who are deaf and hard of hearing at the local, state, and national levels will be discussed. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"CSD312":{"course_id":"CSD312","title":"CSD 312 Normal Language Acquisition","desc":"Theories and sequence of normal language development, emphasizing phonological, morphological, syntactic, semantic, and pragmatic abilities. Emphasis on first six years. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true,"Summer":true}},"CSD315":{"course_id":"CSD315","title":"CSD 315 Language Disorders in Children","req":"<em>Prerequisite: grade of C or better in <span data-link='CSD312'>CSD 312</span>.</em>","desc":"Nature, evaluation and treatment of language disorders in children. The goal of the course is to introduce students to the populations of children who experience language disorders including children with developmental language disorders, autism spectrum disorders, and intellectual disabilities. The course will examine tools and strategies used to assess language disorders as well as evidenced-based intervention strategies. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"CSD316":{"course_id":"CSD316","title":"CSD 316 Introduction to Language and Cognitive-Linguistic Disorders in Adults","req":"<em>Prerequisite: grade of C or better in <span data-link='CSD312'>CSD 312</span>.</em>","desc":"Nature, evaluation and treatment of acquired language and cognitive-linguistic disorders in adults caused by stroke, brain injury and neurological disease. Study of current clinical approaches and evidenced-based practice. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"CSD318":{"course_id":"CSD318","title":"CSD 318 Introduction to Phonological (Sound System) Disorders in Children","req":"<em>Prerequisite: grade of C or better in <span data-link='CSD210'>CSD 210</span>.</em>","desc":"Introduction to the nature, evaluation, and treatment of sound system disorders in children ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"CSD321":{"course_id":"CSD321","title":"CSD 321 Conceptually Accurate Signed English I","req":"<em>Prerequisite: permission.</em>","desc":"Gain beginner level skill in sign language and fingerspelling through Manually Coded English. Development of a general knowledge base including the history of sign language and the spectrum of sign options available. May be taught concurrently with <span data-link='CSD721'>CSD 721</span>. Cannot receive credit for both <span data-link='CSD321'>CSD 321</span> and <span data-link='CSD721'>CSD 721</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}}},"courses_td":{"DAN146":{"course_id":"DAN146","title":"DAN 146 Jazz Dance I-B","req":"<em>Prerequisite: permission of instructor.</em>","desc":"Continues development of the basic fundamentals of jazz dance technique and vocabulary. Designed for students with at least one year of formal dance training. May be repeated to a total of 4 hours. ","hours":{"credit":2,"lab":4},"offered":{"Fall":true,"Spring":true}},"DAN180":{"course_id":"DAN180","title":"DAN 180 Introduction to the Dance","req":"<em>General Education Course (Focus on the Arts).</em>","desc":"Survey of dance from a historical retrospective through the creative process. Emphasis will be placed on historical multi-cultural and societal influences on dance. The approach will be from the viewpoint of the audience to help heighten awareness of and increase critical thinking in relationship to the artistic experience. Buying tickets to and attendance at local productions required. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"DAN216":{"course_id":"DAN216","title":"DAN 216 Elementary Modern Dance","req":"<em>Prerequisite: permission of instructor.</em>","desc":"Explores elements of modern dance technique. Designed for students with at least one year of formal dance training. Variable content course. May be repeated to a total of 12 hours. ","hours":{"credit":3,"lecture":1,"lab":4},"offered":{"Fall":true,"Spring":true}},"DAN225":{"course_id":"DAN225","title":"DAN 225 Tap Dance II","req":"<em>Prerequisite: permission of instructor.</em>","desc":"Elementary tap dance technique and vocabulary. Variable content course. May be repeated to a total of 6 hours. ","hours":{"credit":2,"lecture":1,"lab":2},"offered":{"Fall":true}},"DAN230":{"course_id":"DAN230","title":"DAN 230 Elementary Ballet","req":"<em>Prerequisite: permission of instructor.</em>","desc":"Elementary classical ballet technique and vocabulary. This course is designed for students with at least one to two years of formal and consistent ballet training. Variable content course. May be repeated to a total of 12 hours. ","hours":{"credit":3,"lecture":1,"lab":4},"offered":{"Fall":true,"Spring":true}},"DAN235":{"course_id":"DAN235","title":"DAN 235 Mens Dance Technique I","req":"<em>Prerequisite: <span data-link='DAN216'>DAN 216</span> and <span data-link='DAN230'>DAN 230</span>.</em>","desc":"Basic techniques for the male dancer. Emphasis will be on strength building and developing the male dancer&apos;s technique and style. Variable content course. May be repeated to a total of 4 hours. ","hours":{"credit":2,"lab":4},"offered":{"Upon demand":true}},"DAN245":{"course_id":"DAN245","title":"DAN 245 Elementary Jazz Dance","req":"<em>Prerequisite: permission of instructor.</em>","desc":"Continues development of jazz dance technique and vocabulary. Elementary level technique designed for students with at least one year of formal dance training. Variable content course. May be repeated to a total of 12 hours. ","hours":{"credit":3,"lecture":1,"lab":4},"offered":{"Fall":true,"Spring":true}}},"courses_ds":{"DSS504":{"course_id":"DSS504","title":"DSS 504 The Geopolitics of Conflict and Accommodation","req":"<em>Prerequisite: permission of instructor.</em>","desc":"The application of the techniques and understanding lent by the geography to the illumination of the physical and social environment in which politics, strategy, and war take place. The relationship among geography, strategy, and politics is studied through the examination of both historical and contemporary circumstances where geography has intruded on politics or politics on geography. Students will be introduced to the geopolitical concepts of sea power, land power and air power, and these concepts will be critiqued in light of recent technological changes in warfare. Supplemental Course Fee. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"DSS601":{"course_id":"DSS601","title":"DSS 601 Seminar on Nuclear Strategy and Arms Control","desc":"This seminar examines the development of U.S. nuclear deterrence theory and policy. The seminar will study the strategic nuclear balance, including specific problems and programs, and the strategic doctrine, concepts, and objectives of the nuclear powers. Nuclear arms control, including the processes of decision making and negotiating, will be examined, with an emphasis on comparing theory and practice. Supplemental course fee. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"DSS630":{"course_id":"DSS630","title":"DSS 630 International Law and Global Security","desc":"This is a survey course designed to introduce students to the core principles and defining features of the international legal system, and to the changing role of international law in contemporary national and global security. Emphasis will be placed on the applicability of international law to armed conflict, counterterrorism, and containing the spread of weapons of mass destruction. Supplemental course fee. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"DSS631":{"course_id":"DSS631","title":"DSS 631 International Negotiations","desc":"This course combines the basics of negotiation theory and the examination of select international negotiation case studies with three practical &quot;hands-on&quot; negotiation exercises. It will explore various techniques for diagnosing the structure of a negotiation and identifying potential barriers to agreement. Case studies considered include: Negotiation of 1994 Framework Agreement with North Korea, George Mitchell&apos;s mediation in Northern Ireland resulting in the Good Friday Accords, the secret Oslo discussions leading to Israeli recognition of the PLO, The Louisiana Purchase, the Congress of Vienna, the Panama Canal negotiations, and the Egyptian-Israeli Armistice. The course is conducted as a series of interactive seminars including three simulated negotiations. Supplemental course fee. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"DSS632":{"course_id":"DSS632","title":"DSS 632 Seminar on International Security Affairs","desc":"Examines international and regional security problems and policies from both a regional and global perspective. It treats strategies and security problems from a broader viewpoint than the Seminar on Strategy and Arms Control, covering national interests, alliance relationships, intervention, regional threats, and the security problems of other states, including China and Russia. Supplemental Course Fee. (3-0) F,S","hours":{},"offered":{}},"DSS633":{"course_id":"DSS633","title":"DSS 633 Analysis of International Security Politics","desc":"This course deals with the methods and techniques of collecting and assessing information for use in the study of international security politics, problems, and policies. It explores the measures of relative power among nations and the manner in which such power or lack of it shapes the capability of a nation effectively to act in the international sphere. Supplemental course fee. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"DSS634":{"course_id":"DSS634","title":"DSS 634 The Geopolitics of Conflict and Accommodation","desc":"The application of the techniques and understanding lent by the geography to the illumination of the physical and social environment in which politics, strategy, and war take place. The relationship among geography, strategy, and politics is studied through the examination of both historical and contemporary circumstances where geography has intruded on politics or politics on geography. Students will be introduced to the geopolitical concepts of sea power, land power and air power, and these concepts will be critiqued in light of recent technological changes in warfare. Supplemental Course Fee. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_ec":{"ECO197":{"course_id":"ECO197","title":"ECO 197 Topics in Economics","desc":"Course designed to explore one or more current issues in the field of economics. Students should consult the class schedule to determine the topic(s) to be covered in any given semester. Variable content course. May be repeated to a maximum of 6 hours, as course topics change. ","hours":{"credit":1},"offered":{"Upon demand":true}},"ECO200":{"course_id":"ECO200","title":"ECO 200 Personal Economics","desc":"An examination of topics designed to provide the student with skills aimed at promoting personal financial responsibility. Topics include budgeting, purchasing decisions, consumer credit, compound interest, savings and investments, home ownership, insurance, retirement and estate planning. ","hours":{"credit":2,"lecture":2},"offered":{"Upon demand":true}},"ECO300":{"course_id":"ECO300","title":"ECO 300 Service Learning In Economics","req":"<em>Prerequisite: 30 hours, concurrent registration in an Economics course designated as a service learning offering.</em>","desc":"This service component for an existing course incorporates community service with classroom instruction in Economics to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","hours":{"credit":1},"offered":{"Upon demand":true}},"ECO302":{"course_id":"ECO302","title":"ECO 302 Economic Analysis for Investors","req":"<em>Prerequisite: <span data-link='ECO155'>ECO 155</span> or <span data-link='ECO165'>ECO 165</span>, and completion of mathematics general education requirement.</em>","desc":"This course examines economic principles used by investors and financial reporters. Concepts are drawn from several fields of economics including microeconomics, macroeconomics, money and banking, labor economics, and international economics. Students will participate in a stock market game, make in-class presentations and conduct Internet research. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"ECO305":{"course_id":"ECO305","title":"ECO 305 Money and Banking","req":"<em>Prerequisite: <span data-link='ECO155'>ECO 155</span>.</em>","desc":"Nature and functions of money, a survey of the operation and development of the banking system in the U.S.; introduction to monetary theory and policy. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"ECO310":{"course_id":"ECO310","title":"ECO 310 Labor Economics","req":"<em>Prerequisite: <span data-link='ECO155'>ECO 155</span> and <span data-link='ECO165'>ECO 165</span>.</em>","desc":"Factors determining the market for labor; examination of the economic effects of trade unions; recent trends in the labor force and the labor share of national income. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"ECO315":{"course_id":"ECO315","title":"ECO 315 The Economics of Gender","req":"<em>Prerequisite: <span data-link='ECO165'>ECO 165</span>.</em>","desc":"This course teaches students to analyze the economic decisions made by both males and females in two main areas: the labor market and the household. Specific areas of inquiry include the following: the family as an economic unit, gender differences in labor force participation, occupational gender segregation, explanations for gender earnings differentials and efforts to reduce such differentials, gender earnings discrimination, and international gender issues. Identical with <span data-link='GST315'>GST 315</span>. Cannot receive credit for both <span data-link='ECO315'>ECO 315</span> and <span data-link='GST315'>GST 315</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_rf":{"EDC350":{"course_id":"EDC350","title":"EDC 350 School and Society","req":"<em>Prerequisite: admitted to Teacher Education Program; <span data-link='PSY385'>PSY 385</span> or <span data-link='CFD257'>CFD 257</span> (Elementary Education program); or <span data-link='CFD160'>CFD 160</span> (Early Childhood Education program); or <span data-link='PSY360'>PSY 360</span> (Secondary, Middle School, and K-12 programs); or concurrent enrollment.</em>","desc":"This class examines the nature and history of schooling in America and the teaching profession, the purposes and goals of education, and educational philosophy. It also explores social, legal, and political issues connected with teaching and learning, diversity, racism, sexism, and the effects of social class on educational success. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"EDC700":{"course_id":"EDC700","title":"EDC 700 Teaching and Learning I: Current Issues and Trends in Education","req":"<em>Prerequisite: bachelor&apos;s degree and certification as a classroom teacher.</em>","desc":"This course examines educational issues, questions, concerns, and trends teachers face in their schools and daily practices. The impact of national and state policy-making, directions suggested by emerging educational research, and current educational reform efforts will receive particular attention. ","hours":{"credit":5,"lecture":3,"lab":4},"offered":{"Fall":true}},"EDC701":{"course_id":"EDC701","title":"EDC 701 Teaching and Learning II: Diversity, Curriculum and Research","req":"<em>Prerequisite: <span data-link='EDC700'>EDC 700</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>","desc":"This course engages students with research projects and curriculum ideas designed to strengthen and deepen student learning, with a special emphasis on questions of student diversity. The course helps students to formulate questions and use appropriate research principles to collect, analyze, interpret, and report data in order to evaluate the effectiveness of classroom instruction and educational policies. Students examine different curriculum models and theories and devise instructional practices to meet the needs of all learners. ","hours":{"credit":5,"lecture":3,"lab":4},"offered":{"Spring":true}},"EDC702":{"course_id":"EDC702","title":"EDC 702 Teaching and Learning III: Management and Assessment of Learning","req":"<em>Prerequisite: <span data-link='EDC700'>EDC 700</span> and <span data-link='EDC701'>EDC 701</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>","desc":"This course examines the reasons for, benefits of, and limitations of the increasing call for effective and comprehensive assessment practices and helps teachers plan for, construct, use, and analyze a variety of assessment practices. This course also examines various models of and approaches to classroom management and discipline and the relation of management practices to effective learning. ","hours":{"credit":5,"lecture":3,"lab":4},"offered":{"Fall":true}},"EDC703":{"course_id":"EDC703","title":"EDC 703 Teaching and Learning IV: Curriculum Development","req":"<em>Prerequisite: <span data-link='EDC700'>EDC 700</span> and <span data-link='EDC701'>EDC 701</span> and <span data-link='EDC702'>EDC 702</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>","desc":"This course engages students in a careful examination of the curriculum they teach, from district curriculum goals, national curriculum standards, and course- or grade-level goals. The course encourages reflection about instructional practices in light of curriculum goals. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"EDC704":{"course_id":"EDC704","title":"EDC 704 Teaching and Learning V: Research Seminar","req":"<em>Prerequisite: <span data-link='EDC700'>EDC 700</span> and <span data-link='EDC701'>EDC 701</span> and <span data-link='EDC702'>EDC 702</span> and <span data-link='EDC703'>EDC 703</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>","desc":"An in-depth study related to a research topic identified earlier in the program or curricular project begun as part of a learning team, leading to the guided development and completion of an extensive research paper. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"EDC786":{"course_id":"EDC786","title":"EDC 786 Research Seminar in Education","req":"<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>","desc":"An in-depth study of chosen topic in K-12 education leading to the guided development and completion of an extensive research paper or major creative work. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}}},"courses_eg":{},"courses_en":{"ENG184":{"course_id":"ENG184","title":"ENG 184 Mini Literature","desc":"Topics in literature, such as detective fiction, Missouri writers, new fiction. Check semester class schedule for topics offered. Course may be repeated, provided topic and title are different, to a maximum of 6 hours. May be counted toward General Education Humanities requirement for those following a general education catalog prior to fall 1997. Variable content course. ","hours":{"credit":1,"lecture":1},"offered":{"Fall":true,"Spring":true}},"ENG190":{"course_id":"ENG190","title":"ENG 190 Language Skills","desc":"Development of specific writing skills in selected areas of composition, such as sentence grammar and structure, punctuation and capitalization, spelling, diction and dictionary use, outlining and organization. Not a composition course. Check semester class schedule to determine topics being offered. Course may be repeated, provided topic and title are different, to a maximum of 3 hours. Will not satisfy the general education requirement in English. Variable content course. ","hours":{"credit":1,"lecture":1},"offered":{"Fall":true,"Spring":true}},"ENG191":{"course_id":"ENG191","title":"ENG 191 Grammar Skills","desc":"Development of specific skills in American English grammar (including sentence structure, punctuation, capitalization, spelling, and diction). Students will explore and discuss grammar and usage in written communication. Not a composition course. Cannot be used to satisfy any General Education requirement in English or any requirement in the Bachelor of Science in Education degree. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"ENG200":{"course_id":"ENG200","title":"ENG 200 Great Books and Instant Classics","req":"<em>General Education Course (Focus on Humanities).</em>","desc":"The works that society calls its &quot;great books&quot; tell us much about how the society views itself. Popular forms of linguistic expression, though sometimes less celebrated, similarly reflect a culture&apos;s sense of itself. Examining a range of texts, time-honored and otherwise, from numerous critical perspectives, this course explores how literatures reflect the values of the societies that create and enjoy them. Appropriate for students in all majors. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true,"Summer":true}},"ENG201":{"course_id":"ENG201","title":"ENG 201 Public Issues in Popular Culture","req":"<em>Prerequisite: 12 hours. General Education Course (Focus on Public Issues).</em>","desc":"A writing-intensive course that examines contemporary public issues through a variety of cultural expressions, from fiction, poetry, television and comics, to political discourse, folklore, web-based media, and song lyrics, among other popular genres. Exploring issues from these multiple viewpoints, the course will investigate the various underlying value systems that both inform the rhetorical construction of the texts and influence the attitudes and behaviors of their readers. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"ENG203":{"course_id":"ENG203","title":"ENG 203 Creative Writing: Poetry","req":"<em>Prerequisite: <span data-link='ENG110'>ENG 110</span>. General Education Course (Focus on the Arts).</em>","desc":"Introduction to the theory, art, cultural context, craft, and process of poetry writing. Analysis of the full stylistic range of the modern poem and practical experience in writing in the form, with focus on the process form of writing through revision and the collaborative workshop experience. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true,"Summer":true}},"ENG205":{"course_id":"ENG205","title":"ENG 205 Creative Writing: Nonfiction","req":"<em>Prerequisite: <span data-link='ENG110'>ENG 110</span>. General Education Course (Focus on the Arts).</em>","desc":"A study of the key characteristics of creative nonfiction, including an introduction to the evolving forms of text classified as creative nonfiction. Practice in writing prose with a focus on collaborative workshops and revision. Emphasis on the creative interpretation of complex thoughts and human experiences. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true,"Summer":true}}},"courses_fi":{"FCS300":{"course_id":"FCS300","title":"FCS 300 Special Topics in Family and Consumer Sciences","desc":"Selected topics of contemporary interest in Family and Consumer Sciences, offered when resources and demand allow. May be repeated to a total of 6 hours when topics change. Variable Content Course. ","hours":{"credit":1},"offered":{"Upon demand":true}},"FCS301":{"course_id":"FCS301","title":"FCS 301 Textiles, Apparel, and Fashion","desc":"Textiles and apparel course for teachers of Family the Consumer Sciences. Study of textiles used in apparel, selection and care of apparel, apparel construction techniques, and cultural, aesthetic, historical, legal and environmental aspects of textiles, apparel and fashion. ","hours":{"credit":3,"lecture":1,"lab":4},"offered":{"Spring":true}},"FCS302":{"course_id":"FCS302","title":"FCS 302 Family and Consumer Sciences Study Tour","desc":"Study of mills, factories, stores, hospitals, laboratories, hospitality facilities, museums, design studios, historic sites, and/or trade markets, and not-for-profit agencies. ","hours":{"credit":1},"offered":{"Upon demand":true}},"FCS303":{"course_id":"FCS303","title":"FCS 303 Service Learning in Family and Consumer Sciences","req":"<em>Prerequisite: 30 hours and concurrent registration in a designated service learning offering within one of the major areas of study in Family and Consumer Sciences.</em>","desc":"A service learning course incorporates a community service experience with classroom instruction to provide an integrative learning experience which addresses the practice of citizenship and promotes an awareness of and participation in public affairs/service. Requires 40 hours of service to a community organization, agency, or public service provider. The community service placement and assignment will vary, depending on the specialization area and learning objectives. A list of approved placements will be available from the instructor and the Citizenship and Service Learning Office. Students are required to participate in a service learning training session(s) prior to beginning their service placement. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"FCS335":{"course_id":"FCS335","title":"FCS 335 Presentation Techniques","req":"<em>Prerequisite: <span data-link='COM115'>COM 115</span> and 60 hours.</em>","desc":"Planning and presenting techniques for teaching in the classroom, business, industry, or extension settings. A focus on professional presentation strategies incorporating the use of multimedia technology. ","hours":{"credit":2,"lecture":1,"lab":2},"offered":{"Spring":true}},"FCS373":{"course_id":"FCS373","title":"FCS 373 Family Economics","desc":"Recommended Prerequisite: <span data-link='ECO155'>ECO 155</span>. Family as a consumer unit, its financial well-being and interrelationship with the market and the economy. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"FCS400":{"course_id":"FCS400","title":"FCS 400 Problems in Family and Consumer Sciences","desc":"Independent study for those who wish additional work in specific subject areas. ","hours":{"credit":1},"offered":{"Upon demand":true}}},"courses_gb":{},"courses_gg":{"GRY142":{"course_id":"GRY142","title":"GRY 142 Introductory Physical Geography","req":"<em>General Education Course (Focus on Physical Sciences).</em>","desc":"A study of the earth&apos;s natural systems including weather and climate, rocks and minerals, landforms and processes of landform development, biogeography, water resources and soils. Map fundamentals and the interrelationships of the geographic factors of the natural environment are emphasized. Students who take <span data-link='GRY240'>GRY 240</span> and <span data-link='GRY142'>GRY 142</span> may receive credit for only one of these courses. Supplemental course fee. ","hours":{"credit":4,"lecture":3,"lab":2},"offered":{"Fall":true,"Spring":true}},"GRY143":{"course_id":"GRY143","title":"GRY 143 Physical Geography Laboratory","desc":"Laboratory instruction in the earth&apos;s natural systems including weather and climate, rocks and minerals, landforms and processes of landform development, biogeography, water resources and soils. Map fundamentals and the interrelationships of the geographic factors of the natural environment are emphasized. This course is open only to transfer students who have already completed a 3-credit course equivalent to the lecture portion of <span data-link='GRY142'>GRY 142</span>. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true}},"GRY197":{"course_id":"GRY197","title":"GRY 197 Selected Topics in Geography I","req":"<em>Prerequisite: permission.</em>","desc":"Course devoted to a single topic that can vary from semester to semester depending on student and faculty interest. Topics are limited to those requiring no prior geography background. Examples: Geography of the Home Community, Geography of Energy Resources, Geography of Sport. Students should check the semester class schedule to determine the topic title for any given semester. May be repeated to a total of 5 hours credit. Variable content course. ","hours":{"credit":1},"offered":{"Upon demand":true}},"GRY240":{"course_id":"GRY240","title":"GRY 240 Earth Science for Teachers","req":"<em>Prerequisite: 30 hours; open only to Early Childhood, Elementary, and Middle School majors.</em>","desc":"A course designed to give students an understanding of the processes of science and the basic concepts of earth science using the inquiry approach in hands-on laboratory activities. Content includes maps, earth in space, weather and climate, soils and vegetation, rocks and minerals, landforms, processes of landform development, water resources, environmental relationship to the physical setting. Does not apply toward the major in Secondary Education. Students who take <span data-link='GRY240'>GRY 240</span> and <span data-link='GRY142'>GRY 142</span> may receive credit for only one of these courses. ","hours":{"credit":4,"lecture":2,"lab":4},"offered":{"Fall":true,"Spring":true}},"GRY275":{"course_id":"GRY275","title":"GRY 275 Introduction to Plane Surveying","req":"<em>Prerequisite: <span data-link='MTH138'>MTH 138</span> or <span data-link='MTH181'>MTH 181</span> or <span data-link='MTH261'>MTH 261</span> or <span data-link='MTH287'>MTH 287</span>.</em>","desc":"Fundamental concepts and practices of land surveying. Practical exercises comparable to those used at Missouri University of Science and Technology. ","hours":{"credit":3,"lecture":2,"lab":3},"offered":{"Fall":true}},"GRY300":{"course_id":"GRY300","title":"GRY 300 Geography of the United States","desc":"Physical and cultural regions of the United States, including their characteristics and resource utilization. Topics include landforms, climates, natural resources, economic activities, and cultural and political patterns. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"GRY301":{"course_id":"GRY301","title":"GRY 301 Geography of the Ozarks","desc":"Physical and cultural geography of the Ozarks. Surveys basic geology, landforms, soils, vegetation and the geography of settlement, population, major economic activities, lifestyles and the cultural landscape. Emphasis on historical development and spatial distributions. Field trip required. Supplemental course fee. Public Affairs Capstone Experience course. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Upon demand":true}}},"dept_uc":{},"courses_py":{"GER320":{"course_id":"GER320","title":"GER 320 Gender Issues in Later Life","req":"<em>Prerequisite: <span data-link='PSY121'>PSY 121</span>; and <span data-link='GST170'>GST 170</span> or 45 hours.</em>","desc":"A comparison of the aging experiences of men and women in later life. The relevance of gender and gender roles to the aging process will be considered. Specific topics of analysis will include the gender gap in longevity, psychological and physical health, minority status, socioeconomic status, family relationships, and public policy issues. Identical to <span data-link='PSY354'>PSY 354</span>. Can only receive credit for one of the following: <span data-link='GER320'>GER 320</span> or <span data-link='PSY354'>PSY 354</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"GER365":{"course_id":"GER365","title":"GER 365 Families in Later Life","req":"<em>Prerequisite: <span data-link='PSY121'>PSY 121</span>; and <span data-link='CFD155'>CFD 155</span> or <span data-link='CFD163'>CFD 163</span> or 30 hours.</em>","desc":"Examination of the structure and function of families in later life. Topics of interest include demographic trends impacting the structure of the family, marriage, sibling relations, parent-adult child relations, grandparenthood, widowhood, and retirement. The application of family theories and their relevance to later life families will be discussed. Identical with <span data-link='CFD365'>CFD 365</span>, <span data-link='SWK365'>SWK 365</span>, and <span data-link='PSY366'>PSY 366</span>. Can only receive credit for one of following: <span data-link='CFD365'>CFD 365</span>, <span data-link='GER365'>GER 365</span>, <span data-link='PSY366'>PSY 366</span> or <span data-link='SWK365'>SWK 365</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"GER380":{"course_id":"GER380","title":"GER 380 Senior Citizens: Policies and Politics","req":"<em>Prerequisite: 9 hours of gerontology.</em>","desc":"Students will be introduced to the development and practice of social policy, on the state and federal level, and how it affects services to the older adult population. Political organizations that influence the lives of the elderly (e.g., the American Association of Retired Persons, Gray Panthers, Older Women&apos;s League) will be examined as well as government and social welfare programs (i.e., Social Security, Medicaid and Medicare). What constitutes &quot;citizenship&quot; and the role of a &quot;senior citizen&quot; will also be explored. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"GER396":{"course_id":"GER396","title":"GER 396 Directed Readings in Gerontology","req":"<em>Prerequisite: 6 hours of gerontology and permission.</em>","desc":"Readings designed to supplement material introduced in previous Gerontology courses. Includes a wide selection of literature in the field. May be repeated to a total of 6 hours. ","hours":{"credit":1},"offered":{"Upon demand":true}},"GER397":{"course_id":"GER397","title":"GER 397 Special Topics in Gerontology","req":"<em>Prerequisite: 6 hours of designated courses in the gerontology major.</em>","desc":"In-depth inquiry into selected interdisciplinary topics of contemporary interest in gerontology. May be repeated to a total of 6 hours when topic changes. Variable content course. ","hours":{"credit":1},"offered":{"Upon demand":true}},"GER470":{"course_id":"GER470","title":"GER 470 Community Resources for Older Adults","req":"<em>Prerequisite: <span data-link='PSY121'>PSY 121</span>.</em>","desc":"Covers the services, programs and institutions involved in providing services to older adults in the United States, with a focus on community-based services. Typical needs, issues, concerns and desires of older persons are identified and corresponding community-based services to address these needs are discussed. Emerging issues and developments in the field of gerontology will also be discussed as they relate to community services and resources. Site visits to agencies and organizations serving older adults will enhance students&apos; familiarity with resources to improve the quality of life and well-being of aging members in our society. Identical with <span data-link='SWK470'>SWK 470</span>. Cannot receive credit for both <span data-link='GER470'>GER 470</span> and <span data-link='SWK470'>SWK 470</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"GER597":{"course_id":"GER597","title":"GER 597 Special Topics in Gerontology","req":"<em>Prerequisite: 90 hours; and 12 hours of gerontology.</em>","desc":"In-depth inquiry into selected interdisciplinary topics of contemporary interest in gerontology. May be repeated to a total of 6 hours when topic changes. Variable content course. May be taught concurrently with <span data-link='GER697'>GER 697</span>. Cannot receive credit for both <span data-link='GER697'>GER 697</span> and <span data-link='GER597'>GER 597</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}}},"courses_gr":{},"courses_nr":{"NUR303":{"course_id":"NUR303","title":"NUR 303 Art and Science of Nursing I","req":"<em>Prerequisite: admission to the 4-year Generic Nursing program.</em>","desc":"Introduction to basic skills and technology used in professional nursing. Includes clinical experience of not less than 48 hours. Supplemental course fee. ","hours":{"credit":3,"lecture":2,"lab":3},"offered":{"Summer":true}},"NUR304":{"course_id":"NUR304","title":"NUR 304 Art and Science of Nursing II","req":"<em>Prerequisite: admission to the 4-year Generic Nursing Program; and meet program progression requirements.</em>","desc":"Introduction to complex skills, technology, and nursing care of the adult client in professional nursing. Includes clinical experience of not less than 96 hours. Supplemental course fee. ","hours":{"credit":5,"lecture":3,"lab":6},"offered":{"Fall":true}},"NUR306":{"course_id":"NUR306","title":"NUR 306 Professional Emergence","req":"<em>Prerequisite: registered nurse or permission of instructor.</em>","desc":"Enhancement of nurses&apos; ability to function as professionals. Survey of past, current, and developing trends in nursing and health care delivery, including historical, socio-cultural, legal and ethical dimensions in nursing practice. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true,"Summer":true}},"NUR311":{"course_id":"NUR311","title":"NUR 311 Introduction to Family Health Nursing","desc":"The study of the care of the family from a nursing perspective. Provides an introduction to theoretical foundations as it relates to families, genomics, research, and family nursing. Explores family communication, decision making, roles, and values, including beliefs, attitudes, and practices of diverse cultures. Utilizes health care informatics and information technology to assess and analyze data relevant to families. ","hours":{"credit":2,"lecture":2},"offered":{"Fall":true}},"NUR312":{"course_id":"NUR312","title":"NUR 312 Nursing: The Adult Client","req":"<em>Prerequisite: admission to the 4-year Generic Nursing Program; and meet program progression requirements.</em>","desc":"Professional nursing care of adult clients experiencing acute and chronic illness. Includes clinical experience of not less than 96 hours. Supplemental course fee. ","hours":{"credit":6,"lecture":4,"lab":6},"offered":{"Fall":true,"Spring":true}},"NUR322":{"course_id":"NUR322","title":"NUR 322 Nursing: The Childbearing Family","req":"<em>Prerequisite: admission to the 4-year Generic Nursing Program; and meet program progression requirements.</em>","desc":"Professional nursing care of childbearing families in diverse settings. Includes clinical experience of not less than 48 hours. Supplemental course fee. ","hours":{"credit":4,"lecture":3,"lab":3},"offered":{"Fall":true}},"NUR323":{"course_id":"NUR323","title":"NUR 323 Nursing: The Pediatric Client and Family","req":"<em>Prerequisite: admission to the 4-year Generic Nursing Program; and meet program progression requirements.</em>","desc":"Professional nursing care of pediatric clients and their families in diverse settings. Includes clinical experience of not less than 96 hours. Supplemental course fee. ","hours":{"credit":5,"lecture":3,"lab":6},"offered":{"Spring":true}}},"courses_im":{"TCM123":{"course_id":"TCM123","title":"TCM 123 Introduction to Construction for Non-Construction Majors","desc":"An introductory course which explores materials, principles and practices associated with building systems used in commercial and residential construction. Topics of discussion will include structural systems, light framing, roofing, exterior cladding systems and interior finishes. External class activities may include jobsite visits. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"TCM221":{"course_id":"TCM221","title":"TCM 221 Construction Drawings and Quantity Take-off","req":"<em>Prerequisite: <span data-link='TCM121'>TCM 121</span> or <span data-link='TCM122'>TCM 122</span> or <span data-link='TCM123'>TCM 123</span>.</em>","desc":"An introduction to working drawings and specifications commonly encountered in construction. Laboratory exercises in sketching theory and conventions, sectioning and dimensioning, classifying work, developing quantity take-offs of constructions materials, and interpreting construction documentation. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true,"Spring":true}},"TCM223":{"course_id":"TCM223","title":"TCM 223 Construction Surveying","req":"<em>Prerequisite: <span data-link='TCM221'>TCM 221</span>; and <span data-link='MTH261'>MTH 261</span> or <span data-link='MTH287'>MTH 287</span>.</em>","desc":"Construction field engineering activities to include surveying, site layout and dimensional control. Interpretation of plot books, site plans, and topographic maps is also included. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true}},"TCM226":{"course_id":"TCM226","title":"TCM 226 Construction Project Administration","req":"<em>Prerequisite: <span data-link='TCM221'>TCM 221</span>.</em>","desc":"A study of the legal and administrative aspects of construction projects. Includes use of documents, subcontracting, purchasing, changes, claims, payments, and closeout. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"TCM267":{"course_id":"TCM267","title":"TCM 267 Statics","req":"<em>Prerequisite: <span data-link='PHY123'>PHY 123</span> or <span data-link='PHY203'>PHY 203</span>; and <span data-link='MTH261'>MTH 261</span> or 287.</em>","desc":"A study of the mechanics of forces associated with rigid bodies in equilibrium. Development of problem solving skills. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"TCM273":{"course_id":"TCM273","title":"TCM 273 Mechanics of Materials","req":"<em>Prerequisite: <span data-link='PHY233'>PHY 233</span>.</em>","desc":"Introduces the principles of mechanics necessary for the solution of technical problems relating to strength, stiffness, and material selection, and is the student&apos;s first course in mechanical design. Topics covered include stress, strain, pressure vessel analysis, torsion, beams, columns, and combined stresses at a point. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"TCM281":{"course_id":"TCM281","title":"TCM 281 Dynamics","req":"<em>Prerequisite: <span data-link='PHY233'>PHY 233</span>.</em>","desc":"An in-depth, quantitative treatment of technical problems involving motion and acceleration. Topics include plane motion; three dimensional motion; force, mass and acceleration; mechanical work and energy; and impulse and momentum. Linear and angular momentum. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}}},"courses_hr":{"HLH710":{"course_id":"HLH710","title":"HLH 710 Introduction to Health Promotion and Wellness Management","desc":"This is an introductory course in which students will gain a general understanding of the health promotion and wellness management (HPWM) field. The job opportunities, history, mission, terminology, philosophy, ethical principles, organizations, concepts and foundations of HPWM will be explored. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"HLH750":{"course_id":"HLH750","title":"HLH 750 Programming Approaches in Wellness/Health Promotion","desc":"Organizational and administrative approaches utilized in the conduct of wellness/health promotion programs will be studied. Emphasis will be placed upon the selection, development, promotion, conduct, and evaluation of the various components of wellness/health promotion programs. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"HLH752":{"course_id":"HLH752","title":"HLH 752 Health Risk Identification and Management","desc":"Procedures and instrumentation utilized in the identification and assessment of risk factors associated with cardiovascular and other major life-style generated diseases and conditions will be studied. Emphasis will be placed upon the utilization of risk factor data in the conduct of a wellness/health promotion program. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"HLH760":{"course_id":"HLH760","title":"HLH 760 Health Promotion Planning","desc":"A culminating course in the MS in Health Promotion and Wellness Management degree program. This course will focus on the development of health promotion in the workplace: Topics discussed will include effects of health promotion, the compression of morbidity, developing awareness strategies, health assessments, theories of health behavior (self-efficacy, social learning theory, health belief model, theory of planned behavior, stages of change theory), and evaluating existing workplace health promotion programs (physical activity in the workplace, worksite nutrition programs, worksite weight management, tobacco control and cessation, and stress management). The current professional literature related to health promotion will also be reviewed. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"HLH770":{"course_id":"HLH770","title":"HLH 770 Seminar in Health Promotion and Wellness Management","desc":"Review of the professional literature relating to current issues in health promotion and wellness. Topics researched and discussed include health care ethics, diversity, cultural aspects, long-range planning, public relations, legal considerations, and grant-writing. Includes guided development and completion of an extensive research paper. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"HLH791":{"course_id":"HLH791","title":"HLH 791 Wellness Internship","req":"<em>Prerequisite: permission of Health Internship Coordinator.</em>","desc":"Supervised field experience in a health promotion or health care setting. Directly involves the student in the application of organizational skills and wellness manager skills. Student must complete a minimum number of clinical hours. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true}},"KIN101":{"course_id":"KIN101","title":"KIN 101 Beginning Swimming","desc":"Designed to teach novice swimmer basic swimming skills. ","hours":{"credit":1,"lab":2},"offered":{"Upon demand":true}}},"courses_ra":{"HRA300":{"course_id":"HRA300","title":"HRA 300 Special Topics in Hospitality and Restaurant Administration","req":"<em>Prerequisite: permission of Department Head.</em>","desc":"Selected topics of contemporary interest in hospitality and restaurant administration. Offered when resources and demand allow. May be repeated for a total of 6 hours when topics change. Variable Content Course. ","hours":{"credit":1},"offered":{"Upon demand":true}},"HRA302":{"course_id":"HRA302","title":"HRA 302 Hospitality and Restaurant Administration Study Tour","req":"<em>Prerequisite: permission of Department Head.</em>","desc":"Study of and visits to museums, international hospitality tours, historic sites, trade shows, conferences, and conventions related to the hospitality industry. May be taken for a total of 6 hours. ","hours":{"credit":1},"offered":{"Upon demand":true}},"HRA310":{"course_id":"HRA310","title":"HRA 310 Analyzing Financial Performance in Hospitality Operations","req":"<em>Prerequisite: <span data-link='MTH130'>MTH 130</span> or higher; and <span data-link='HRA210'>HRA 210</span>; and <span data-link='HRA215'>HRA 215</span>; and <span data-link='ACC201'>ACC 201</span>.</em>","desc":"Financial techniques in forecasting, budgeting, and performance measurement, and the application of the hospitality industry uniform system of accounts are covered in this course as they apply to operational and fiscal decision making. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"HRA315":{"course_id":"HRA315","title":"HRA 315 Advanced Lodging Management","req":"<em>Prerequisite: <span data-link='HRA210'>HRA 210</span> and <span data-link='HRA215'>HRA 215</span> and <span data-link='ACC201'>ACC 201</span>.</em>","desc":"Students in this course will analyze the lodging industry in depth. Critical thinking skills are stressed as students are exposed to different viewpoints within a coherent theoretical structure, enabling them to formulate their own ideas and solutions. Current trends and challenges in lodging are also studied in depth. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"HRA321":{"course_id":"HRA321","title":"HRA 321 Principles of Food Preparation","req":"<em>Prerequisite: <span data-link='HRA218'>HRA 218</span>.</em>","desc":"Students in this course study the scientific principles and techniques in the selection, preparation and preservation of food including fundamental principles of nutrition and diet. Supplemental course fee. ","hours":{"credit":3,"lecture":1,"lab":4},"offered":{"Fall":true,"Spring":true}},"HRA325":{"course_id":"HRA325","title":"HRA 325 Cultural Cuisine","req":"<em>Prerequisite: permission of instructor.</em>","desc":"A course designed to extensively explore various cultures through a hands-on culinary experience. May be repeated for a total of 6 hours. Supplemental course fee (variable by section.) ","hours":{"credit":1},"offered":{"Upon demand":true}},"HRA330":{"course_id":"HRA330","title":"HRA 330 Banquet Operations","req":"<em>Prerequisite: <span data-link='HRA210'>HRA 210</span> and <span data-link='HRA321'>HRA 321</span>.</em>","desc":"This course provides students with practical skills and knowledge for effective management of food and beverage practices, from the preparation of quantity foods to its service. Laboratory arranged. Supplemental course fee. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true,"Spring":true}}},"courses_hi":{"HST122":{"course_id":"HST122","title":"HST 122 Survey of the History of the United States Since 1877","req":"<em>General Education Course (Focus on Constitutions of US and Missouri and American History and Institutions).</em>","desc":"Modernization of the United States and its role in world affairs from the late 19th Century to the present, with emphasis on industrialization and urbanization and their impact on socioeconomic and international developments. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"HST200":{"course_id":"HST200","title":"HST 200 The Twentieth Century World: An International History","desc":"From the height of Western Imperialism in 1900 to the post Cold War years, this course surveys twentieth-century world history, examining the transformation of international, political, economic, and cultural relations. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"HST210":{"course_id":"HST210","title":"HST 210 Writing II: Historical Inquiry","req":"<em>Prerequisite: <span data-link='ENG110'>ENG 110</span> and 30 hours. General Education Course (Focus on Written Communication and Integrative and Applied Learning).</em>","desc":"Introduction to historical research and writing. Meets Writing II requirement for a major in history. This course emphasizes the techniques of conducting a thorough literature search, the analysis of primary and secondary materials, and instruction and practice in historical writing. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"HST300":{"course_id":"HST300","title":"HST 300 Service Learning in History","req":"<em>Prerequisite: 30 hours, concurrent registration in a History course designated as a service learning offering and permission of department head.</em>","desc":"This service component for an existing course incorporates community service with classroom instruction in History to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"HST313":{"course_id":"HST313","title":"HST 313 American Cultural History","desc":"An introduction to the major issues, themes and methods of American cultural history. This course will explore multiple vantage points and interdisciplinary approaches to understanding American cultural history. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"HST314":{"course_id":"HST314","title":"HST 314 American Expansion and Empire","desc":"Recommended Prerequisite: <span data-link='HST121'>HST 121</span> or <span data-link='HST122'>HST 122</span>. This course surveys the territorial, economic, cultural, and political expansion of the United States from the founding of the country through the 20th century. Topics include the ideology, methods, and effects of expansion, with particular attention on the cultural interactions that resulted from expansion and the ways in which expansion affected American culture and Society. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"HST315":{"course_id":"HST315","title":"HST 315 Military History of the United States","desc":"Recommended Prerequisite: <span data-link='HST121'>HST 121</span> or 122. American Military History from the colonial period to the present; its relation to the national development in war and peace. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}}},"courses_id":{"IDS250":{"course_id":"IDS250","title":"IDS 250 Special Topics: International Travel Course","desc":"A variable content course with topics involving a foreign travel component. Course offerings represent selected and interdisciplinary subjects. Some courses under this designation may be interdepartmental and team-taught. May be repeated as the topics change. ","hours":{"credit":1},"offered":{"Upon demand":true}},"IDS275":{"course_id":"IDS275","title":"IDS 275 Resident Assistant Seminar","desc":"Designed to facilitate new Resident Assistants in developing the skills necessary to work with students living in the residence halls. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true}},"IDS280":{"course_id":"IDS280","title":"IDS 280 Student/Life Leadership","desc":"The course will focus upon the study and practical application of student and student organization leadership skills and the knowledge of campus and community resources. Students will become actively involved in leadership as they participate in individual and group learning experiences. ","hours":{"credit":1,"lab":2},"offered":{"Spring":true}},"IDS297":{"course_id":"IDS297","title":"IDS 297 International Culture and Study Abroad","req":"<em>General Education Course (Focus on Cultural Competence).</em>","desc":"An interdisciplinary study of other cultures while living and studying in an international venue. Through history, language, literature, sociology and other disciplines the student will acquire a deeper understanding of another culture and of the American culture. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"IDS310":{"course_id":"IDS310","title":"IDS 310 Peer Leadership","desc":"Designed for the study and practical application of leadership skills that will benefit Peer Leaders working with <span data-link='GEP101'>GEP 101</span> instructors and students. Open to Peer Leaders only. May be repeated to a total of 3 hours. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"IDS320":{"course_id":"IDS320","title":"IDS 320 Job Search Preparation and Career/Life Planning","desc":"Assists students who have selected an academic major and who are beginning internship, part-time, or full-time job searches, or who are making decisions on graduate and professional school. The course is designed to help students in developing a career plan and investigating the work world in terms of the students&apos; career/life goals. Students will learn the dynamics of decision-making, the importance of gaining experience in their field of interest, and job search skills. They will engage in career research, resume writing, interviewing, networking and other career development practices. Quantity of course content supports need for 2 hour/week format. ","hours":{"credit":2,"lecture":2},"offered":{"Fall":true,"Spring":true}},"IDS350":{"course_id":"IDS350","title":"IDS 350 British Life and Culture","desc":"Through a historical and topical format students will study the interdisciplinary aspects of Great Britain. Lectures will be enhanced through British lecturers and field trips illustrative of the lectures. Missouri-London Program only. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true,"Spring":true}}},"courses_mj":{"JRN370":{"course_id":"JRN370","title":"JRN 370 News Reporting and Writing","req":"<em>Prerequisite: <span data-link='JRN270'>JRN 270</span>.</em>","desc":"Instruction and practice in gathering news material, writing news reports, and editing copy. Includes introduction to news beats and specialized reporting techniques. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"JRN374":{"course_id":"JRN374","title":"JRN 374 Opinion Writing","req":"<em>Prerequisite: <span data-link='JRN270'>JRN 270</span>.</em>","desc":"Instruction and practice in writing editorials, opinion columns, news analyses and critical reviews. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"JRN375":{"course_id":"JRN375","title":"JRN 375 Feature Writing","req":"<em>Prerequisite: <span data-link='JRN270'>JRN 270</span>.</em>","desc":"Practice in writing feature articles for print and online publications, including human interest stories, news features, personality profiles, how-to articles and historical pieces. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"JRN376":{"course_id":"JRN376","title":"JRN 376 Business Reporting","req":"<em>Prerequisite: <span data-link='JRN270'>JRN 270</span>.</em>","desc":"Instruction and practice in gathering information and writing business-related articles. The course covers interviewing and reporting techniques used to write business stories, including enterprise and trend stories as well as company profiles. The student also will gain an understanding of the importance of business news to public affairs. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"JRN381":{"course_id":"JRN381","title":"JRN 381 Broadcast News Writing","req":"<em>Prerequisite: <span data-link='JRN270'>JRN 270</span>.</em>","desc":"Instruction and practice in basic scripting technique and writing skills needed to be a broadcast journalist. Through writing, students will examine the fundamentals of news judgment and the organizational style of storytelling for radio and television formats. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"JRN384":{"course_id":"JRN384","title":"JRN 384 Broadcast Performance","req":"<em>Prerequisite: <span data-link='JRN381'>JRN 381</span>.</em>","desc":"The development of disciplines controlling vocal and visual mechanics as well as interpretative performance for announcers, newscasters, interviewers and narrators of various radio and television situations. ","hours":{"credit":3,"lecture":3,"lab":1},"offered":{"Fall":true,"Spring":true}},"JRN388":{"course_id":"JRN388","title":"JRN 388 Electronic News Gathering","req":"<em>Prerequisite: <span data-link='JRN381'>JRN 381</span> and <span data-link='JRN384'>JRN 384</span>.</em>","desc":"Instruction and practice in news gathering techniques for television. Students will learn the basics of video production (shooting, editing, lighting, etc.) and reporting as well as advanced storytelling techniques, including solo reporting, recording natural sound packages, and live shot production and reporting. Emphasis is placed on gaining expertise in shooting and editing techniques as they apply to news. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true}}},"courses_li":{"LIS502":{"course_id":"LIS502","title":"LIS 502 History of Books and Libraries","desc":"History of books and libraries from the earliest times to the present; influence and importance of the book and the library in society throughout history. May be taught concurrently with <span data-link='LIS602'>LIS 602</span>. Cannot receive credit for both <span data-link='LIS602'>LIS 602</span> and <span data-link='LIS502'>LIS 502</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"LIS504":{"course_id":"LIS504","title":"LIS 504 Reference","req":"<em>Prerequisite: <span data-link='LIS500'>LIS 500</span>.</em>","desc":"An introduction to basic, general print and electronic reference sources. May be taught concurrently with <span data-link='LIS604'>LIS 604</span>. Cannot receive credit for both <span data-link='LIS604'>LIS 604</span> and <span data-link='LIS504'>LIS 504</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"LIS506":{"course_id":"LIS506","title":"LIS 506 Collection Development and Acquisitions","req":"<em>Prerequisite: <span data-link='LIS500'>LIS 500</span>.</em>","desc":"Principles of collection development including selection aids, review media and collection evaluation; methods of selection and acquisitions. May be taught concurrently with <span data-link='LIS606'>LIS 606</span>. Cannot receive credit for both <span data-link='LIS606'>LIS 606</span> and <span data-link='LIS506'>LIS 506</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"LIS508":{"course_id":"LIS508","title":"LIS 508 Cataloging and Classification","req":"<em>Prerequisite: <span data-link='LIS500'>LIS 500</span>.</em>","desc":"Basic cataloging and classification; subject headings; cataloging print and non-print material; MARC records; various types of traditional and electronic catalogs. May be taught concurrently with <span data-link='LIS608'>LIS 608</span>. Cannot receive credit for both <span data-link='LIS608'>LIS 608</span> and <span data-link='LIS508'>LIS 508</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"LIS510":{"course_id":"LIS510","title":"LIS 510 Curriculum and the School Library","req":"<em>Prerequisite: <span data-link='LIS500'>LIS 500</span>.</em>","desc":"Focuses on integrating the school library program and collections with curriculum; emphasizes diverse student learning styles; role of the school librarian as a teacher; use of electronic resources for research, teaching, and learning. May be taught concurrently with <span data-link='LIS610'>LIS 610</span>. Cannot receive credit for both <span data-link='LIS610'>LIS 610</span> and <span data-link='LIS510'>LIS 510</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"LIS512":{"course_id":"LIS512","title":"LIS 512 Reading Guidance for Young Adults","desc":"The study of reading interests and habits of high school age young adults. Methods of meeting the needs of different types of readers and stimulating reading interest through library collections and services. May be taught concurrently with <span data-link='LIS612'>LIS 612</span>. Cannot receive credit for both <span data-link='LIS612'>LIS 612</span> and <span data-link='LIS512'>LIS 512</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"LIS530":{"course_id":"LIS530","title":"LIS 530 Children's Librarianship: Birth through Age 9","desc":"Fundamentals of children&apos;s librarianship for both public librarians and school library media specialists, including collection development, programming, and current issues. May be taught concurrently with <span data-link='LIS630'>LIS 630</span>. Cannot receive credit for both <span data-link='LIS630'>LIS 630</span> and <span data-link='LIS530'>LIS 530</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_mg":{"MGT310":{"course_id":"MGT310","title":"MGT 310 Introduction to the Entertainment Industry","req":"<em>Prerequisite: 54 credit hours; and undergraduate business majors must be admitted to degree program.</em>","desc":"An introduction to the entertainment industry including facets unique to the field such as managerial roles and organizational structures. Topics will also include an exposure to policies, legal, social, economic, and financial characteristics of this industry. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"MGT320":{"course_id":"MGT320","title":"MGT 320 Patterns of Management","req":"<em>Prerequisite: 54 hours.</em>","desc":"A course designed specifically for non-business majors desiring a knowledge of management and its importance and application in various fields. Topical areas include: management functions and problems, decision-making, organizational design, managerial/non-managerial relationships, and management job opportunities. Cannot be taken for credit by students who have previously received credit for <span data-link='MGT340'>MGT 340</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"MGT325":{"course_id":"MGT325","title":"MGT 325 Fundamentals of Personnel Administration","req":"<em>Prerequisite: 54 hours.</em>","desc":"This course is designed for non-business majors. Topics include principles of employee supervision, recruitment, selection, training and development, compensation, labor relations, and separation. This course will be of particular value to managerial, supervisory, administrative, professional, and technical personnel in a variety of organizational settings. Cannot be used to satisfy any requirement for a College of Business major. Cannot be taken for credit by students who have previously received credit for <span data-link='MGT345'>MGT 345</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"MGT340":{"course_id":"MGT340","title":"MGT 340 Organizational Behavior and Management","req":"<em>Prerequisite: 54 hours, including <span data-link='PSY121'>PSY 121</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"A study of individual, interpersonal, and group behavior within organizations and the behavioral implications of management processes. The interaction of human, technological, structural, global, ethical, and environmental factors are also discussed. A &quot;C&quot; grade or better is required in this course in order to take <span data-link='ACC555'>ACC 555</span>. Cannot be taken Pass/Not Pass. Public Affairs Capstone Experience course. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MGT341":{"course_id":"MGT341","title":"MGT 341 Advanced Organization Behavior and Development","req":"<em>Prerequisite: <span data-link='MGT340'>MGT 340</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"An in-depth study of individual and organizational behaviors and processes. Such areas as individual differences, group dynamics, organizational processes, organizational change/development, and culture and ethics will be addressed utilizing a variety of interactive teaching methods. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MGT342":{"course_id":"MGT342","title":"MGT 342 Organization Structure and Design","req":"<em>Prerequisite: <span data-link='MGT340'>MGT 340</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"A study of the macro-organization functioning with emphasis on how organization design dimensions interrelate to effect performance. Organization dimensions studied include environment, technology, size, structure, and effectiveness. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MGT345":{"course_id":"MGT345","title":"MGT 345 Human Resources Management","req":"<em>Prerequisite: <span data-link='MGT340'>MGT 340</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"A study of the personnel functions of procurement, development, compensation, integration, and the maintenance of human resources within the framework of total available resources used in the accomplishment of organizational goals. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}}},"courses_ms":{"MIL211":{"course_id":"MIL211","title":"MIL 211 Basic Military Skills and Techniques","req":"<em>Prerequisite: <span data-link='MIL101'>MIL 101</span> and <span data-link='MIL102'>MIL 102</span> or permission.</em>","desc":"This course is designed for students who desire accelerated instruction on rifle marksmanship, rappelling, communications, map reading (to include the compass), patrolling and tactics. The student will be required to attend a laboratory on Thursdays if a contracted cadet. Students who are contracted are required to meet Army appearance standards. ","hours":{"credit":2,"lecture":2,"lab":1},"offered":{"Fall":true}},"MIL212":{"course_id":"MIL212","title":"MIL 212 Military Fundamentals Practicum","req":"<em>Prerequisite: permission.</em>","desc":"The class is designed for the military science students who desire accelerated instruction on rifle marksmanship, communications, map reading (to include the compass), and patrolling. The student will be required to wear a military uniform and meet Army appearance standards. ","hours":{"credit":2,"lecture":2,"lab":1},"offered":{"Spring":true}},"MIL220":{"course_id":"MIL220","title":"MIL 220 Basic Military Science Fundamentals","req":"<em>Prerequisite: permission.</em>","desc":"Organization and mission of ROTC; the role of the U.S. Army in American history and the application of the principles of war; leadership theory and practice; introduction to military operations and basic tactics; instruction in marksmanship, land navigation and communication. ","hours":{"credit":2},"offered":{"Summer":true}},"MIL225":{"course_id":"MIL225","title":"MIL 225 Basic Military Science Practicum","req":"<em>Prerequisite: permission.</em>","desc":"A 6-week course conducted at Fort Knox, KY. The training is rugged and intensive with emphasis placed on leadership application, practical work and physical conditioning. Training will be conducted six days a week out-of-doors and requires active participation by all students. Enrolled students receive compensation for travel, lodging and food. ","hours":{"credit":5},"offered":{"Fall":true,"Summer":true}},"MIL301":{"course_id":"MIL301","title":"MIL 301 Military Leadership and Operations","req":"<em>Prerequisite: permission.</em>","desc":"Introduction to small unit tactics; principles of military leadership, to include theory, responsibilities, techniques, and practice; branches of the U.S. Army, oral presentation techniques and practice. One field trip is required. Cannot be taken Pass/Not Pass. ","hours":{"credit":3,"lecture":3,"lab":1},"offered":{"Fall":true}},"MIL302":{"course_id":"MIL302","title":"MIL 302 Military Skill Building","req":"<em>Prerequisite: permission.</em>","desc":"Small unit tactics; applied military leadership (builds on knowledge gained in <span data-link='MIL301'>MIL 301</span>) with special emphasis on the junior leader&apos;s duties and responsibilities. Two field trips are required. Cannot be taken Pass/Not Pass. ","hours":{"credit":3,"lecture":3,"lab":1},"offered":{"Spring":true}},"MIL325":{"course_id":"MIL325","title":"MIL 325 Advanced Military Science Practicum","desc":"A prerequisite to receive a commission in the U.S. Army through R.O.T.C. and for MIL Science 411 and 412. The 5-week course is conducted at Fort Lewis, Washington. The instruction, training and evaluation focuses on the professional development issues required to become an Army Officer. The primary focus is on evaluating the student&apos;s leadership potential through this mentally and physically demanding camp. The training and evaluation is conducted seven days a week for five weeks and requires active participation by all students. The student is placed in leadership positions which require him/her to lead up to 120 fellow students for extended periods of time. Enrolled students receive compensation for travel, lodging and food. ","hours":{"credit":5,"lecture":5},"offered":{"Fall":true,"Summer":true}}},"courses_mk":{"MKT351":{"course_id":"MKT351","title":"MKT 351 Consumer Market Behavior","req":"<em>Prerequisite: <span data-link='MKT350'>MKT 350</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"Influence of cultural, social, and psychological factors on consumer and customer behavior evidenced through behavioral science research. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MKT352":{"course_id":"MKT352","title":"MKT 352 Personal Selling","req":"<em>Prerequisite: <span data-link='MKT350'>MKT 350</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"This course teaches the Principles of Sales as a toolkit, which in addition to being useful to a salesperson will also be found useful by most people in everyday life. Students will learn the nuts and bolts of a sales call from start to finish, as well as different customers that will be encountered, different kinds of relationships, ethics, communication skills and adaptive selling. Students will have the opportunity to apply what they have learned during the semester by participating in mock sales calls with salespeople from the community. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MKT354":{"course_id":"MKT354","title":"MKT 354 Principles of Advertising","req":"<em>Prerequisite: <span data-link='MKT350'>MKT 350</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"Advertising roles, principles and procedures; development of creative strategies, media selection-including traditional media as well as nontraditional media, social networking, guerrilla, online, promotion, mobile, and event-basic design, layout and copy development; measures of advertising effectiveness. Includes the development of an integrated campaign. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MKT355":{"course_id":"MKT355","title":"MKT 355 Principles of Retailing","req":"<em>Prerequisite: <span data-link='MKT350'>MKT 350</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"The application of retailing principles to real-world issues. Students are challenged to solve retailing scenarios using an &quot;experience-based&quot; format. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"MKT360":{"course_id":"MKT360","title":"MKT 360 Marketing Research","req":"<em>Prerequisite: <span data-link='MKT350'>MKT 350</span> and <span data-link='QBA337'>QBA 337</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"Basic research techniques designed to introduce the student to modern research procedures and the research process. Emphasis placed on research techniques to collect, analyze, and interpret research information as a basis for improved decision-making; and for the development of marketing strategies and policies. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MKT380":{"course_id":"MKT380","title":"MKT 380 Creative Advertising","req":"<em>Prerequisite: <span data-link='MKT354'>MKT 354</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"An advanced course in the creation of broadcast and print advertising. Emphasizes strategic planning, developing creative concepts and assistance in writing and polishing copy and visuals within an ad, execution of finished product, and refining presentation skills. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"MKT390":{"course_id":"MKT390","title":"MKT 390 Promotion Management and Implementation","req":"<em>Prerequisite: <span data-link='MKT354'>MKT 354</span>; and undergraduate business majors must be admitted to degree program.</em>","desc":"A study of the promotional mix. Attention is focused on sales promotion, its design and implementation; including research, planning, target market assessment, budgeting, vehicle selection, and measures of efficiency and effectiveness. Topics include the buying and selling of mix elements, both traditional and non-traditional. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}}},"courses_ma":{"MTH130":{"course_id":"MTH130","title":"MTH 130 Contemporary Mathematics","req":"<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span>, or approved score on a departmental placement test. General Education Course (Focus on Quantitative Literacy).</em>","desc":"This is a problem solving and applications of mathematics course. Topics to be studied will include, but not limited to: the art of problem solving, geometry, probability, statistics, and mathematics of finance. Cannot count toward a mathematics major or minor. Cannot be taken Pass/Not Pass. <span data-link='MTH130'>MTH 130</span> does not meet the prerequisite for <span data-link='MTH135'>MTH 135</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MTH135":{"course_id":"MTH135","title":"MTH 135 College Algebra","req":"<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span>, or appropriate placement score, Note: <span data-link='MTH130'>MTH 130</span> does not meet the prerequisite for <span data-link='MTH135'>MTH 135</span>. General Education Course (Focus on Quantitative Literacy).</em>","desc":"Contents include the study of linear and quadratic equations; inequalities and their applications; polynomial, rational, exponential and logarithmic functions; and systems of equations. Cannot receive credit toward graduation for both <span data-link='MTH135'>MTH 135</span> and <span data-link='MTH138'>MTH 138</span>. Cannot count toward a mathematics major or minor. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH181'>MTH 181</span>, <span data-link='MTH285'>MTH 285</span>, or <span data-link='MTH287'>MTH 287</span>. Cannot be taken Pass/Not Pass. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MTH138":{"course_id":"MTH138","title":"MTH 138 Pre-Calculus Mathematics","req":"<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span> (Recommended: &quot;B&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span>), or appropriate placement score. General Education Course (Focus on Quantitative Literacy).</em>","desc":"Selected topics in algebra and trigonometry to prepare the student for calculus. Cannot receive credit toward graduation for both <span data-link='MTH138'>MTH 138</span> and <span data-link='MTH135'>MTH 135</span>. Cannot count toward a mathematics major or minor. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH261'>MTH 261</span>, 287, <span data-link='CSC125'>CSC 125</span> or 131. Cannot be taken Pass/Not Pass. ","hours":{"credit":5,"lecture":5},"offered":{"Fall":true,"Spring":true}},"MTH181":{"course_id":"MTH181","title":"MTH 181 Trigonometry","req":"<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH135'>MTH 135</span> or appropriate placement score. General Education Course (Focus on Quantitative Literacy).</em>","desc":"Triangle trigonometry and its applications; trigonometric and inverse trigonometric functions; trigonometric identities and equations; Rational, exponential and logarithmic functions. Cannot receive credit toward graduation for both <span data-link='MTH181'>MTH 181</span> and <span data-link='MTH138'>MTH 138</span>. Cannot count toward a mathematics major or minor. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH287'>MTH 287</span>. Cannot be taken Pass/Not Pass. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MTH215":{"course_id":"MTH215","title":"MTH 215 Discrete Mathematics","req":"<em>Prerequisite: <span data-link='MTH138'>MTH 138</span> or approved calculus course or appropriate placement score.</em>","desc":"Topics include: logic, mathematical reasoning, basic counting, discrete probability, matrices, recursion, sets and relations, graphs and trees. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"MTH261":{"course_id":"MTH261","title":"MTH 261 Analytic Geometry and Calculus I","req":"<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH138'>MTH 138</span> or <span data-link='MTH181'>MTH 181</span> or appropriate placement score. General Education Course (Focus on Quantitative Literacy).</em>","desc":"Analytic geometry of the plane, limits, continuity, differentiation with applications, introductory integration with applications. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH280'>MTH 280</span> or 288. Cannot be taken Pass/Not Pass. ","hours":{"credit":5,"lecture":5},"offered":{"Fall":true,"Spring":true}},"MTH280":{"course_id":"MTH280","title":"MTH 280 Analytic Geometry and Calculus II","req":"<em>Prerequisite: &quot;C&quot; or better in <span data-link='MTH261'>MTH 261</span>.</em>","desc":"Applications of integration, integration techniques, indeterminate forms, improper integrals, sequences, series, conic sections, parametrization, polar coordinates. Cannot be taken Pass/Not Pass. ","hours":{"credit":5,"lecture":5},"offered":{"Fall":true,"Spring":true}}},"courses_mu":{"MUS104":{"course_id":"MUS104","title":"MUS 104 Theory and Musicianship II","req":"<em>Prerequisite: <span data-link='MUS103'>MUS 103</span>.</em>","desc":"Four-part harmony incorporated all diatonic chords in all inversions; secondary dominant and secondary leading tone chords. Sight singing and dictation of melodies and rhythms; intervals and chord quality identification; error detection; dictation of four-part harmony. Credit by Examination is available. ","hours":{"credit":3,"lecture":1,"lab":4},"offered":{"Spring":true}},"MUS107":{"course_id":"MUS107","title":"MUS 107 Recital Attendance I","desc":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non-departmental concerts must be pre-approved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","hours":{},"offered":{"Fall":true,"Spring":true}},"MUS108":{"course_id":"MUS108","title":"MUS 108 Recital Attendance II","desc":"Attendance of at least six music major convocations, one faculty recital, and eight other recitals or concerts sponsored by the department. The fulfillment of any part of these requirements by non-departmental concerts must be pre-approved by the student&apos;s major applied teacher or the department head. Credit will not be given to students who arrive after the recital/concert begins. Graded Pass/Not Pass only. ","hours":{},"offered":{"Fall":true,"Spring":true}},"MUS119":{"course_id":"MUS119","title":"MUS 119 Jazz Theory/Jazz Keyboard Skills","req":"<em>Prerequisite: <span data-link='MUS103'>MUS 103</span>.</em>","desc":"The study of jazz theory and the practical application of functional jazz keyboard skills. ","hours":{"credit":2,"lecture":2},"offered":{"Spring":true}},"MUS130":{"course_id":"MUS130","title":"MUS 130 Multicultural Musical Instrument Techniques","desc":"Techniques of both the performance and pedagogy of traditional instruments from cultures other than those in the Western/European tradition. Variable content course. ","hours":{"credit":1,"lab":2},"offered":{"Upon demand":true}},"MUS131":{"course_id":"MUS131","title":"MUS 131 String Techniques and Skills for the Music Educator","desc":"Instruction in the basic skills of playing and teaching violin, viola, cello and bass in a class situation. Examination of performance problems, diagnostic techniques, teaching strategies, and other specialized topics related to string instruction will be studied, and materials used in public school teaching will be examined and performed. ","hours":{"credit":1,"lab":2},"offered":{"Spring":true}},"MUS133":{"course_id":"MUS133","title":"MUS 133 Guitar for the Music Educator I","desc":"Provides future music teachers with the working knowledge, experience and skills to use the guitar for accompanying music making as well as for teaching fretted instruments in school music classes and ensembles. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true}}},"courses_pn":{"PAS766":{"course_id":"PAS766","title":"PAS 766 Clinical Assessment II","req":"<em>Prerequisite: admission to the MS in Physician Assistant Studies.</em>","desc":"A continuation of Clinical Assessment I. Emphasis will be on continued development of interviewing and physical examination skills, recognizing and interpreting abnormal physical findings, developing problem lists and differential diagnoses, and refining the recording and presenting of patient evaluation data. In addition, students will learn advanced assessment techniques and perform written and practical skills examinations that incorporate the objective structured clinical exam (OSCE). ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Summer":true}},"PAS769":{"course_id":"PAS769","title":"PAS 769 Behavioral Medicine","req":"<em>Prerequisite: admission to the MS in Physician Assistant Studies.</em>","desc":"A biopsychosocial systems approach to the individual, family and community within the health care delivery system that includes issues germane to public health and rural medicine. A variety of topics such as growth and development, human sexuality, health promotion and disease prevention, health education, patient compliance, cultural diversity, substance abuse, family violence, child abuse and rural health issues are examined. ","hours":{"credit":1,"lab":2},"offered":{"Spring":true}},"PAS770":{"course_id":"PAS770","title":"PAS 770 Professional Issues Seminar","req":"<em>Prerequisite: admission to the MS in Physician Assistant Studies.</em>","desc":"Seminar format for discussion of professional and legal issues relevant to the physician assistant profession. Includes topics such as the history of the profession, health care systems, professional organizations, national certification, Missouri licensure, prescriptive privileges, and clinical ethics. ","hours":{"credit":1,"lab":2},"offered":{"Summer":true}},"PAS775":{"course_id":"PAS775","title":"PAS 775 Principles of Clinical Problem Solving","req":"<em>Prerequisite: admission to the MS in Physician Assistant Studies or permission.</em>","desc":"Introduction to critical thinking skills and problem solving techniques. Incorporates problem based learning format where small groups of students under the supervision of a group leader explore the various facets of &quot;real-life&quot; clinical case scenarios. ","hours":{"credit":1,"lab":2},"offered":{"Spring":true}},"PAS776":{"course_id":"PAS776","title":"PAS 776 Clinical Problem Solving Seminar","req":"<em>Prerequisite: admission to the MS in Physician Assistant Studies.</em>","desc":"Advanced exercises in clinical problem solving in a small group format. Commonly presenting clinical problems are utilized as a means to refine students&apos; ability to choose appropriate steps to determine a definitive diagnosis/outcome. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true}},"PAS777":{"course_id":"PAS777","title":"PAS 777 Introduction to Research and Clinical Epidemiology","req":"<em>Prerequisite: admission to the MS in Physician Assistant Studies.</em>","desc":"Foundations of quantitative and qualitative research methodology related to the study of disease in populations. Includes issues related to study design, data collection, and methods of statistical analysis with a focus on application of these principles in the clinical setting. Will serve as the foundation for development of the clinical year research project. ","hours":{"credit":2,"lecture":2},"offered":{"Fall":true}},"PAS780":{"course_id":"PAS780","title":"PAS 780 Pharmacotherapeutics I","req":"<em>Prerequisite: admission to the MS in Physician Assistant Studies.</em>","desc":"The first in a two-course sequence to introduce the principles of pharmacology and pharmacotherapeutics for the diagnosis, prevention and treatment of disease. Emphasis will be placed on the pharmacological, pharmacokinetic and pharmacodynamic properties of drugs and drug classes used in medical practice. ","hours":{"credit":1,"lecture":1},"offered":{"Summer":true}}},"courses_pb":{"PBH740":{"course_id":"PBH740","title":"PBH 740 Health Behavior","desc":"This course examines selected theories of health behavior relevant to individual and community health promotion program planning. Students will analyze biological, psychological, sociological, and environmental influences on health behavior and evaluate strategies for health promotion. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"PBH745":{"course_id":"PBH745","title":"PBH 745 Environmental Health","desc":"This course will investigate and examine the relationships of environmental health problems to human health. Students will survey the major environmental issues facing developed and developing countries. Topics include water supply, air and noise pollution, sewage treatment and waste disposal, pest and pesticides, toxic waste, energy alternatives, food and drug quality assurance, population control, and environmental disease control. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"PBH756":{"course_id":"PBH756","title":"PBH 756 Introduction to Public Health","desc":"This course will provide a general introduction to public health. It will discuss the history of public health; international, federal, state, and local agencies; voluntary health agencies; professional health organizations; the legislative process as it relates to public health, environmental health, health promotion, basic public health statistics and an introduction to epidemiology. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"PBH758":{"course_id":"PBH758","title":"PBH 758 Contemporary Issues in Public Health","desc":"In-depth consideration of pertinent issues, trends, controversy, and current research in public health. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"PBH760":{"course_id":"PBH760","title":"PBH 760 Research Methods in Public Health","desc":"This course is designed to help students gain the necessary knowledge and skills for undertaking research on issues related to public health. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"PBH772":{"course_id":"PBH772","title":"PBH 772 Toxicology and Hazardous Materials","desc":"A study of toxic substances and their effects in the environment and in living organisms. This course also includes a study of safety methods for identifying, monitoring, handling, processing, containing, storing, and disposing hazardous and toxic substances in the environment and workplace. Students are encouraged to have had courses in physiology, biochemistry and/or pharmacology. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"PBH775":{"course_id":"PBH775","title":"PBH 775 Principles and Skills of Public Health Administration","desc":"This course is designed to provide a comprehensive overview of the administrative, managerial and organizational practices of health professionals in a variety of settings. Opportunities for the development and application of administrative competencies in health education/health care settings will be provided. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}}},"courses_ph":{"PHI197":{"course_id":"PHI197","title":"PHI 197 Perspectives in Philosophy","desc":"A variable content course designed to explore the philosophical significance of issues of cultural, social or individual importance. Students should consult the registration schedule to determine the topic to be covered in a given semester. The course may be repeated to a maximum of 6 hours as topics change. ","hours":{"credit":1},"offered":{"Upon demand":true}},"PHI300":{"course_id":"PHI300","title":"PHI 300 Philosophical Ideas in Literature","desc":"Selected works of Western literature in light of their relation to historical trends in philosophy and philosophical speculation in the areas of metaphysics, epistemology, value theory, social and political philosophy. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"PHI301":{"course_id":"PHI301","title":"PHI 301 Service Learning in Philosophy","req":"<em>Prerequisite: 30 hours and permission, and concurrent registration in a Philosophy course designated as a service learning offering.</em>","desc":"This service component for an existing course incorporates community service with classroom instruction in philosophy to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"PHI302":{"course_id":"PHI302","title":"PHI 302 Environmental Ethics","desc":"This course critically examines various philosophical viewpoints that bear upon ethical issues concerning the environment. Among the questions examined are the following: Must concern for the environment revolve around human concerns? Do animals have rights? Does nature have intrinsic value that must be respected regardless of effects upon humans? What is the relative importance of aesthetic or economic values to environmental questions? Do we have obligations to protect resources for future generations? ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"PHI305":{"course_id":"PHI305","title":"PHI 305 Elements of Symbolic Logic","desc":"An introduction to the use of symbolic techniques to represent and evaluate arguments from everyday usage. There is an emphasis upon the student&apos;s development of an understanding of the methods and concepts of present day logic. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"PHI306":{"course_id":"PHI306","title":"PHI 306 History of Western Philosophy: Ancient","desc":"Historical study of ancient philosophy based on the reading of representative writings of major philosophers. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"PHI310":{"course_id":"PHI310","title":"PHI 310 History of Western Philosophy: Modern","desc":"A survey of the major philosophies of the modern period in the Western World, 1550 to 1850, including the work of philosophers who stand in the traditions of Continental rationalism, British empiricism, and German idealism. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_ps":{"PLS169":{"course_id":"PLS169","title":"PLS 169 Introduction to Political Science","desc":"An introduction to the contemporary concerns and historical development of political science as a social science and as a mode of critical thinking about politics and society. Emphasis is upon acquainting students with the scope of intellectual inquiry and the specialized sub-fields of study of modern political science rather than with the particular characteristics of American government and politics. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"PLS205":{"course_id":"PLS205","title":"PLS 205 Introduction to Comparative Government","req":"<em>Prerequisite: <span data-link='PLS101'>PLS 101</span>.</em>","desc":"An introductory comparative study of the principles, techniques, and policy issues of government in constitutional democracies and authoritarian regimes. The course focuses on selected West European (Britain, France, Germany) and non-West European (Japan, Mexico, Russia) countries, and the evolution of the European Community. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"PLS232":{"course_id":"PLS232","title":"PLS 232 International Relations","req":"<em>Prerequisite: <span data-link='PLS101'>PLS 101</span>.</em>","desc":"Conflict and cooperation in the nation-state system. Theories on international organization, power politics, regional integration, nationalism, war. Problems of developing areas such as Africa, Latin America and Southeast Asia. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"PLS255":{"course_id":"PLS255","title":"PLS 255 Public Administration","req":"<em>Prerequisite: <span data-link='PLS101'>PLS 101</span>.</em>","desc":"American administrative organization and activities; centralization, decentralization and relations between the administration and other branches of government. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"PLS300":{"course_id":"PLS300","title":"PLS 300 Service Learning in Political Science","req":"<em>Prerequisite: 30 hours; and concurrent registration in a Political Science course designated as a service learning offering; and permission.</em>","desc":"This service component for an existing course incorporates community service with classroom instruction in Political Science to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the specific course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. ","hours":{"credit":1},"offered":{"Fall":true,"Spring":true}},"PLS301":{"course_id":"PLS301","title":"PLS 301 U.S. National Security","desc":"This class examines American national security from the cultural, institutional and policy perspectives. It will pay close attention to those enduring factors that shape American defense policies as well as exploring developments that have modified America&apos;s approach to security. Moreover, in addition to studying the structure and operation of today&apos;s policymaking process, the course will investigate the way the process has evolved in the past fifty years and will analyze the way key policies are produced and implemented by the U.S. government. Finally, reflecting changes in the world and in the field of national security studies, the course will cover not only the traditional concerns of national security (e.g., creation and use of military force for physical security of the territorial-state), but also the definition and achievement of individual and global security in the face of non-military problems. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"PLS315":{"course_id":"PLS315","title":"PLS 315 Federalism and Intergovernmental Relations","req":"<em>Prerequisite: <span data-link='PLS101'>PLS 101</span>.</em>","desc":"Nature of American Federalism and the dynamics of intergovernmental relationships; the course examines the role of the national and the state governments in intergovernmental relations as well as the state, local, interstate and interlocal relations. Issues of federal grants, fiscal outlook of cities, problems of inner cities, and metropolitan governments are also discussed. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}}},"courses_pt":{"PTE712":{"course_id":"PTE712","title":"PTE 712 Biomechanics and Kinesiology","req":"<em>Prerequisite: admission to the program.</em>","desc":"This course provides the basis for understanding human movement. This encompasses functional anatomy, forces applied to, and by, the body, and the mechanics of human movement, including its quantitative assessment. Angular and linear kinetics and kinematics are studied and applied to patient management. Interactions among the skeletal, muscular, and neural systems of the body are emphasized as they relate to understanding normal and abnormal human movement. ","hours":{"credit":5,"lecture":4,"lab":3},"offered":{"Fall":true}},"PTE713":{"course_id":"PTE713","title":"PTE 713 Human Development and the Life Cycle","req":"<em>Prerequisite: admission to the program or permission.</em>","desc":"This course describes the major features of embryology, maturation of the fetus, changes that occur during pregnancy, childbirth, the neonatal period, childhood, adolescence, adulthood and aging. The course stresses an integrated approach to understanding all of these periods of life as a cycle of events, each with its unique challenges to the health care professional. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"PTE714":{"course_id":"PTE714","title":"PTE 714 Imaging Analysis in Physical Therapy Practice","req":"<em>Prerequisite: enrollment in the program and successful completion of all prior course work therein.</em>","desc":"This course emphasizes the analysis and interpretation of diagnostic images of patients with a variety of impairments or dysfunctions of the musculoskeletal, cardiopulmonary, nervous, and circulatory systems as they apply to contemporary physical therapy practice. Various imaging techniques will be incorporated into case studies which will be used to emphasize incorporation of image findings into the process of patient management. ","hours":{"credit":2,"lecture":2,"lab":1},"offered":{"Spring":true}},"PTE720":{"course_id":"PTE720","title":"PTE 720 Neuroanatomy-Neuroscience","req":"<em>Prerequisite: enrollment in the program and successful completion of all prior course work therein.</em>","desc":"This course describes the gross anatomy and applied function of the central and peripheral nervous systems. Normal anatomy and function is compared and contrasted with abnormal anatomy and function due to disease or injury. ","hours":{"credit":4,"lecture":3,"lab":3},"offered":{"Spring":true}},"PTE721":{"course_id":"PTE721","title":"PTE 721 Professional Issues II","req":"<em>Prerequisite: enrollment in the program and successful completion of all prior course work therein.</em>","desc":"This course focuses on employment settings, legal issues regarding Physical Therapist Assistants, the structure of the American Physical Therapy Association, regulations, policies, practice acts, federal legislation, and direct access to patients. Additionally, this course focuses on the legal aspects of professional life including basic elements of contract law, criminal law, educational law, employment law, insurance law, and business law. Students continue to develop an Individual Clinical Internship Plan with specific goals and objectives and select clinical sites for Clinical Internship I - IV. ","hours":{"credit":2,"lab":4},"offered":{"Spring":true}},"PTE722":{"course_id":"PTE722","title":"PTE 722 Physical Agent and Mechanical Modalities","req":"<em>Prerequisite: enrollment in the program and successful completion of all prior course work therein.</em>","desc":"This course describes thermal modalities (diathermy, therapeutic heat and cold, therapeutic ultrasound, low-power lasers, ultraviolet therapy) and mechanical modalities (spinal traction, intermittent compression devices, continuous passive movement devices, therapeutic soft tissue mobilization, and massage). In addition, the underlying scientific principles and clinical uses of physical agents and mechanical modalities are described. ","hours":{"credit":2,"lecture":2,"lab":2},"offered":{"Spring":true}},"PTE723":{"course_id":"PTE723","title":"PTE 723 Patient Management: Musculoskeletal I","req":"<em>Prerequisite: enrollment in the program and successful completion of all prior course work therein.</em>","desc":"This course emphasizes the management of patients with musculoskeletal dysfunctions of the appendicular skeleton. Case studies are used to emphasize the process of patient management, i.e., examination, assessment, diagnosis, prognosis, treatment, analysis of functional outcomes, and re-assessment. The joints of the limbs are the central themes around which the cases are built. General and specific examination and treatment techniques are included, stressing the integration of knowledge and skills. Treatment techniques include (but are not limited to) the use of soft tissue mobilization, myofascial release, therapeutic exercise, and basic joint mobilization. ","hours":{"credit":4,"lecture":2,"lab":6},"offered":{"Spring":true}}},"courses_re":{"REL103":{"course_id":"REL103","title":"REL 103 History of the English Bible","desc":"The ancient manuscripts of the Bible; early versions; the English Bible; evaluation of recent translations. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"REL131":{"course_id":"REL131","title":"REL 131 Religion in America","req":"<em>General Education Course (Focus on Social and Behavioral Sciences).</em>","desc":"A historical survey of different religious groups in America and their contributions to American identity and values. Includes the connections between religious affiliation and race, ethnicity, gender, politics, the media, and other aspects of U.S. society and culture. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"REL197":{"course_id":"REL197","title":"REL 197 Topics in Religious Studies","desc":"Topics of general interest in the area of religious studies such as Humor in the Bible, Religion and Literature, Religion and Film. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. ","hours":{"credit":1},"offered":{"Upon demand":true}},"REL200":{"course_id":"REL200","title":"REL 200 Religion in the News","desc":"Increases students&apos; awareness of the presence and relevance of religion in current events and examines the influence of the news media on shaping public awareness and opinion of religion-related issues. ","hours":{"credit":1,"lecture":1},"offered":{"Upon demand":true}},"REL210":{"course_id":"REL210","title":"REL 210 Paths of World Religions","req":"<em>General Education Course (Focus on Cultural Competence).</em>","desc":"A global survey of religious movements, including Hinduism, Buddhism, Taoism, Confucianism, Judaism, Christianity, and Islam. Students will learn how these religions have affected individual and cultural identities in history and in the contemporary world. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"REL312":{"course_id":"REL312","title":"REL 312 The Hebrew Prophets","desc":"Recommended Prerequisite: <span data-link='REL101'>REL 101</span>. A survey of the prophetic literature of ancient Israel in its social and historical contexts. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"REL315":{"course_id":"REL315","title":"REL 315 Native American Religions","desc":"Recommended Prerequisite: <span data-link='REL131'>REL 131</span>. A survey of historical and contemporary Native American cultures and spiritualities, including Native responses to European contact and colonization. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}}},"courses_na":{"SCI414":{"course_id":"SCI414","title":"SCI 414 Teaching of Secondary School Natural Science","req":"<em>Prerequisite: admission to the Teacher Education Program; <span data-link='SCI214'>SCI 214</span> and <span data-link='SCI314'>SCI 314</span>; completion of 20 hours in the primary science field; minimum of one required course in BIO, CHM, PHY, GLG or GRY; <span data-link='EDC350'>EDC 350</span> or concurrent enrollment; <span data-link='RDG474'>RDG 474</span> is recommended.</em>","desc":"Integration of current science learning theories and standards into practical classroom experiences for students of diverse backgrounds and abilities. Students will learn to design and teach science through various inquiry pedagogical approaches. Students will learn to assess content knowledge achievement through formal and informal techniques. Practical classroom management will be emphasized. A 15 hour practicum is required. Field trips are required. Portfolio checkpoint 2 is partially addressed through assignments in this courses. Credited only on BSEd. A grade of &quot;C&quot; or better is required in this class in order to take <span data-link='SCI493'>SCI 493</span> and <span data-link='SCI494'>SCI 494</span>. Cannot be taken Pass/Not Pass. Public Affairs Capstone Experience course. ","hours":{"credit":3,"lecture":2,"lab":2},"offered":{"Fall":true}},"SCI493":{"course_id":"SCI493","title":"SCI 493 Supervised Teaching (Secondary Science)","req":"<em>Prerequisite: <span data-link='SCI414'>SCI 414</span>; a grade of &quot;C: or better in all professional education courses; current pre-professional liability insurance; and approval for supervised teaching.</em>","desc":"Student observes, then teaches science under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. Public Affairs Capstone Experience course. ","hours":{"credit":6},"offered":{"Fall":true,"Spring":true}},"SCI494":{"course_id":"SCI494","title":"SCI 494 Supervised Teaching (Secondary Science)","req":"<em>Prerequisite: concurrent enrollment in <span data-link='SCI493'>SCI 493</span>.</em>","desc":"Student observes, then teaches under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. Public Affairs Capstone Experience course. ","hours":{"credit":6},"offered":{"Fall":true,"Spring":true}},"SCI499":{"course_id":"SCI499","title":"SCI 499 Clinical Experience in Teaching II","req":"<em>Prerequisite: <span data-link='EDC199'>EDC 199</span>; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>","desc":"This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: <span data-link='AGE499'>AGE 499</span>, <span data-link='AGT499'>AGT 499</span>, <span data-link='ART469'>ART 469</span>, <span data-link='BSE499'>BSE 499</span>, <span data-link='COM493'>COM 493</span>, <span data-link='ECE499'>ECE 499</span>, <span data-link='ELE499'>ELE 499</span>, <span data-link='ENG434'>ENG 434</span>, <span data-link='FCS498'>FCS 498</span>, <span data-link='HST499'>HST 499</span>, <span data-link='KIN498'>KIN 498</span>, <span data-link='MCL491'>MCL 491</span>, <span data-link='MID499'>MID 499</span>, <span data-link='MTH496'>MTH 496</span>, <span data-link='MUS499'>MUS 499</span>, <span data-link='SCI499'>SCI 499</span>, <span data-link='SEC499'>SEC 499</span>, <span data-link='SPE499'>SPE 499</span>, <span data-link='THE493'>THE 493</span>. Supplemental course fee. ","hours":{"credit":4},"offered":{"Fall":true,"Spring":true}},"SCI505":{"course_id":"SCI505","title":"SCI 505 Intellectual Foundations of Science and Technology","req":"<em>Prerequisite: 70 hours including 8 hours of natural science.</em>","desc":"An historical and philosophical examination of the origins and the development of science and technology. The differences between science and technology, their interrelationships in modern times, and the impact of each of these on society will be considered. May be taught concurrently with <span data-link='SCI605'>SCI 605</span>. Cannot receive credit for both <span data-link='SCI605'>SCI 605</span> and <span data-link='SCI505'>SCI 505</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"SCI580":{"course_id":"SCI580","title":"SCI 580 Topics in Science Education","req":"<em>Prerequisite: 70 hours.</em>","desc":"A variable content course for offering selected topics of interest to science teachers in the elementary, middle, or secondary schools; or in college classrooms. May be repeated up to 6 hours when the topic varies. No more than 6 hours may be counted toward a degree. May be taught concurrently with <span data-link='SCI685'>SCI 685</span>. Cannot receive credit for both <span data-link='SCI685'>SCI 685</span> and <span data-link='SCI580'>SCI 580</span>. ","hours":{"credit":1},"offered":{"Upon demand":true}},"SCI605":{"course_id":"SCI605","title":"SCI 605 Intellectual Foundations of Science and Technology","desc":"An historical and philosophical examination of the origins and the development of science and technology. The differences between science and technology, their interrelationships in modern times, and the impact of each of these on society will be considered. May be taught concurrently with <span data-link='SCI505'>SCI 505</span>. Cannot receive credit for both <span data-link='SCI505'>SCI 505</span> and <span data-link='SCI605'>SCI 605</span>. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}}},"courses_sw":{"SWK300":{"course_id":"SWK300","title":"SWK 300 Service Learning in Social Work","req":"<em>Prerequisite: 30 hours and concurrent enrollment in a social work course designated as a service learning offering (<span data-link='SWK200'>SWK 200</span>, <span data-link='SWK219'>SWK 219</span>, or <span data-link='SWK306'>SWK 306</span>).</em>","desc":"This service component for an existing course incorporates community service with classroom instruction to provide an integrative learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization or human/social service agency. Approved settings will focus on populations-at-risk, diverse populations and groups that have experienced social and economic injustice. A list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. May be repeated. Graded Pass/Not Pass only. ","hours":{"credit":1,"lab":2},"offered":{"Fall":true,"Spring":true}},"SWK306":{"course_id":"SWK306","title":"SWK 306 Interviewing Skills in Generalist Social Work Practice","req":"<em>Prerequisite: admission to the BSW program.</em>","desc":"An introduction to basic interviewing skills based upon the purpose of and plan for the interview in the context of generalist social work practice. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"SWK307":{"course_id":"SWK307","title":"SWK 307 Social Work Practice with Individuals","req":"<em>Prerequisite: admission to the BSW program; and <span data-link='SWK306'>SWK 306</span>.</em>","desc":"Basic principles, practice theories and skill for beginning generalist practice with individuals. Integrates practice theory and intervention skills within the context of the Generalist Intervention/Problem-Solving model. The class emphasizes personal awareness, professional growth, critical thinking and skills practice. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"SWK313":{"course_id":"SWK313","title":"SWK 313 Social Justice","req":"<em>Prerequisite: admission to the BSW program; and <span data-link='ECO155'>ECO 155</span> or <span data-link='ECO165'>ECO 165</span> or concurrent enrollment in <span data-link='ECO155'>ECO 155</span> or <span data-link='ECO165'>ECO 165</span>; and <span data-link='PLS101'>PLS 101</span>.</em>","desc":"The primary subject matter of this course is social and economic inequality in United States society. Students are introduced to the patterns and processes of social and economic inequality in its major forms: class, race/ethnicity, gender, and sexual and political orientation. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"SWK314":{"course_id":"SWK314","title":"SWK 314 Social Welfare Policy and Services II","req":"<em>Prerequisite: admission to the BSW program; and <span data-link='SWK213'>SWK 213</span>.</em>","desc":"An introduction to the analytic, interactional, value clarification and political strategies necessary for policy analysis and implementation. ","hours":{"credit":3,"lecture":3},"offered":{"Spring":true}},"SWK320":{"course_id":"SWK320","title":"SWK 320 Services for Women","desc":"Examination of the multiple problems women experience, and needed community resources. Areas of study broadly include women and health, violence against women, women and socio-economic status. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}},"SWK325":{"course_id":"SWK325","title":"SWK 325 Human Behavior and the Social Environment I","req":"<em>Prerequisite: admission to the BSW program; <span data-link='PSY121'>PSY 121</span> and <span data-link='SOC150'>SOC 150</span> or concurrent enrollment in <span data-link='PSY121'>PSY 121</span> and <span data-link='SOC150'>SOC 150</span>; and <span data-link='BIO101'>BIO 101</span> and 111, or <span data-link='BMS100'>BMS 100</span> or <span data-link='BMS105'>BMS 105</span> or <span data-link='BMS110'>BMS 110</span>.</em>","desc":"An introduction to the dynamics of human behavior and the effects of the social environment on the development of individuals and families. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true}}},"courses_uh":{"UHC396":{"course_id":"UHC396","title":"UHC 396 Honors Independent Study","req":"<em>Prerequisite: permission; open to Honors College members only.</em>","desc":"Students should consult with a faculty member of the department who specializes in the subject and with the faculty member&apos;s consent present a written proposal to the department head and the Honors College for final approval. Proposals should be presented for approval before final registration for the semester in which the independent study is to be done. Only one approved independent study program may be taken in any semester. When appropriate, this course may be cross-listed with independent study courses in other academic departments. May be repeated. ","hours":{"credit":1},"offered":{"Upon demand":true}},"UHC397":{"course_id":"UHC397","title":"UHC 397 Honors Colloquia","req":"<em>Prerequisite: 50 hours or permission; open to Honors College members only.</em>","desc":"This course will explore in depth an interdisciplinary topic of intellectual significance related to the University&apos;s Public Affairs Mission. Emphasis is placed upon discussion and individual research projects. When appropriate, this course may be cross-listed with special topics courses in other academic departments. May be repeated once with content change. Variable content course. ","hours":{"credit":3,"lecture":3},"offered":{"Fall":true,"Spring":true}},"UHC398":{"course_id":"UHC398","title":"UHC 398 Honors Undergraduate Research","req":"<em>Prerequisite: permission; open to Honors College members only.</em>","desc":"Allows students to gain research experience by working with an individual faculty member either as a research assistant or as a primary researcher working under faculty supervision. Students should consult with a faculty member of the department who specializes in the subject and with the faculty member&apos;s consent present a written proposal to the department head and the Honors College for final approval. Proposals should be presented for approval before final registration for the semester in which the research is to be done. Only one approved undergraduate research project may be taken in any semester. When appropriate, this course may be cross-listed with undergraduate research courses in other academic departments. May be repeated. ","hours":{"credit":1},"offered":{"Upon demand":true}},"UHC399":{"course_id":"UHC399","title":"UHC 399 Honors Internship/Apprenticeship","req":"<em>Prerequisite: permission of supervising instructor, the Honors College and the host institution; open to Honors College members only.</em>","desc":"This course provides students with the opportunity to obtain practical and theoretical knowledge in a variety of career fields through the completion of a supervised internship experience. Students are expected to complete 45 hours of work with an approved organization and to complete corresponding academic reflection projects under the supervision of a departmental faculty member. Students should consult with a faculty member of the department who specializes in the subject and with the faculty member&apos;s consent present a written proposal to the department head and the Honors College for final approval. Proposals should be presented for approval before final registration for the semester in which the internship is to be done. Only one approved internship may be taken in any semester. When appropriate, this course may be cross-listed with undergraduate internship courses in other academic departments. May be repeated. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"UHC410":{"course_id":"UHC410","title":"UHC 410 Senior Honors Seminar","desc":"This seminar will explore in depth a topic of intellectual significance that lends itself to exploration from a number of different disciplines. Variable content course. ","hours":{"credit":3,"lecture":3},"offered":{"Upon demand":true}},"UHC499":{"course_id":"UHC499","title":"UHC 499 Honors Distinction Project","req":"<em>Prerequisite: permission; open to Honors College members only.</em>","desc":"The Honors Distinction Project is a creative capstone project prepared in accordance with the requirements for the Honors Distinction the Major program. Student will complete a significant intellectual project in the major under the supervision of a departmental faculty member. Students should consult with a faculty member of the department who specializes in the subject and with the faculty member&apos;s consent present a written proposal to the department head and the Honors College for final approval. Proposals should be presented for approval before final registration for the semester in which the Distinction Project is to be done. When appropriate, this course may be cross-listed with senior research project courses in other academic departments. May be repeated for a maximum of 8 hours. ","hours":{"credit":3},"offered":{"Upon demand":true}}}}