{
  "CSC125": {
    "course_id": "CSC125",
    "title": "CSC 125 Introduction to C++ Programming",
    "desc": "Programming and problem-solving using C++. Language constructs for assignment, flow control, input/output and functions are studied and applied. Techniques of object-oriented programming are introduced. ",
    "hours": {
      "credit": 4,
      "lecture": 3,
      "lab": 2
    },
    "offered": {
      "Fall": true
    }
  },
  "CSC130": {
    "course_id": "CSC130",
    "title": "CSC 130 The World of Computer Science",
    "desc": "A broad overview of computer science, with topics ranging from the basic structure of a computer to artificial intelligence. Students will use a high-level language to investigate and implement solutions to problems in a range of fields. Suitable for non-majors who want to learn more about computer science. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CSC131": {
    "course_id": "CSC131",
    "title": "CSC 131 Computational Thinking",
    "req": "<em>Prerequisite: &quot;C&quot; or better in <span data-link='CSC130'>CSC 130</span> and eligible for <span data-link='MTH261'>MTH 261</span>.</em>",
    "desc": "Solving problems using computation and implementing solutions in a high-level programming language. Introduction to problem analysis, solution design, data structures, and algorithms. ",
    "hours": {
      "credit": 4,
      "lecture": 3,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CSC197": {
    "course_id": "CSC197",
    "title": "CSC 197 Introductory Topics in Computer Science",
    "desc": "Variable content course with topics that can change from semester to semester. Topics will be identified by title in the schedule of classes. The course may be repeated if a different topic is offered, however, no more than six credits may count toward any degree. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CSC210": {
    "course_id": "CSC210",
    "title": "CSC 210 Public Affairs Issues in Computing",
    "req": "<em>Prerequisite: 12 hours. General Education Course (Focus on Public Issues).</em>",
    "desc": "An introduction to public affairs issues in computing. Topics include civic applications, public sources of data, data and computer system security, opportunities and dangers of artificial intelligence and data mining, social media and computer mediated collaboration, and cultural factors in the internationalization of software. Student will design a civic application or system intended to serve the public good. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CSC226": {
    "course_id": "CSC226",
    "title": "CSC 226 Special Languages",
    "desc": "Study of computer languages and their use in particular application domains. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CSC232": {
    "course_id": "CSC232",
    "title": "CSC 232 Data Structures",
    "req": "<em>Prerequisite: &quot;C&quot; or better in <span data-link='CSC130'>CSC 130</span> and <span data-link='CSC131'>CSC 131</span>; and <span data-link='MTH215'>MTH 215</span> or <span data-link='MTH315'>MTH 315</span> or concurrent enrollment.</em>",
    "desc": "A continuation of <span data-link='CSC131'>CSC 131</span>. Topics will include: algorithm design; complexity analysis; abstract data types and encapsulation; basic data structures and their application, including stacks, queues, linked lists and binary trees; dynamic memory allocation; recursion; sorting and searching; debugging techniques. ",
    "hours": {
      "credit": 4,
      "lecture": 3,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  }
}