{
  "IDS101": {
    "course_id": "IDS101",
    "title": "IDS 101 Interdisciplinary Seminar",
    "desc": "Variable content, variable credit course that is offered only in the summer term and only to the participants of Missouri State University summer academies. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Summer": true
    }
  },
  "IDS118": {
    "course_id": "IDS118",
    "title": "IDS 118 Enhancing Learning Techniques for College and Life",
    "desc": "Designed for any student who wishes to develop stronger study and learning techniques such as note taking, test taking and preparation, time management, text study, memory and concentration. Cannot be used to satisfy any General Education Program requirement or any major or minor requirement. Cannot receive credit for both <span data-link='IDS118'>IDS 118</span> and <span data-link='RDG107'>RDG 107</span>. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "IDS120": {
    "course_id": "IDS120",
    "title": "IDS 120 Exploring Majors and Careers",
    "desc": "Designed to assist students in learning the process for making meaningful academic and career choices that are aligned with their unique strengths, interests, values, and personality. Students will participate in self-assessments, major and career exploration, and decision-making activities. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "IDS250": {
    "course_id": "IDS250",
    "title": "IDS 250 Special Topics: International Travel Course",
    "desc": "A variable content course with topics involving a foreign travel component. Course offerings represent selected and interdisciplinary subjects. Some courses under this designation may be interdepartmental and team-taught. May be repeated as the topics change. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "IDS275": {
    "course_id": "IDS275",
    "title": "IDS 275 Resident Assistant Seminar",
    "desc": "Designed to facilitate new Resident Assistants in developing the skills necessary to work with students living in the residence halls. ",
    "hours": {
      "credit": 1,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "IDS280": {
    "course_id": "IDS280",
    "title": "IDS 280 Student/Life Leadership",
    "desc": "The course will focus upon the study and practical application of student and student organization leadership skills and the knowledge of campus and community resources. Students will become actively involved in leadership as they participate in individual and group learning experiences. ",
    "hours": {
      "credit": 1,
      "lab": 2
    },
    "offered": {
      "Spring": true
    }
  },
  "IDS297": {
    "course_id": "IDS297",
    "title": "IDS 297 International Culture and Study Abroad",
    "req": "<em>General Education Course (Focus on Cultural Competence).</em>",
    "desc": "An interdisciplinary study of other cultures while living and studying in an international venue. Through history, language, literature, sociology and other disciplines the student will acquire a deeper understanding of another culture and of the American culture. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "IDS310": {
    "course_id": "IDS310",
    "title": "IDS 310 Peer Leadership",
    "desc": "Designed for the study and practical application of leadership skills that will benefit Peer Leaders working with <span data-link='GEP101'>GEP 101</span> instructors and students. Open to Peer Leaders only. May be repeated to a total of 3 hours. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "IDS320": {
    "course_id": "IDS320",
    "title": "IDS 320 Job Search Preparation and Career/Life Planning",
    "desc": "Assists students who have selected an academic major and who are beginning internship, part-time, or full-time job searches, or who are making decisions on graduate and professional school. The course is designed to help students in developing a career plan and investigating the work world in terms of the students&apos; career/life goals. Students will learn the dynamics of decision-making, the importance of gaining experience in their field of interest, and job search skills. They will engage in career research, resume writing, interviewing, networking and other career development practices. Quantity of course content supports need for 2 hour/week format. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "IDS350": {
    "course_id": "IDS350",
    "title": "IDS 350 British Life and Culture",
    "desc": "Through a historical and topical format students will study the interdisciplinary aspects of Great Britain. Lectures will be enhanced through British lecturers and field trips illustrative of the lectures. Missouri-London Program only. ",
    "hours": {
      "credit": 3,
      "lecture": 2,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "IDS397": {
    "course_id": "IDS397",
    "title": "IDS 397 International Culture and Study Abroad",
    "desc": "An interdisciplinary study of other cultures while living and studying in an international venue. Through history, language, literature, sociology and other disciplines the student will acquire a deeper understanding of another culture and of the American culture. May be repeated once with content change. Variable Content Course. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "IDS499": {
    "course_id": "IDS499",
    "title": "IDS 499 Senior Integrating Experience",
    "req": "<em>Prerequisite: permission of Associate Provost for Student Development and Public Affairs.</em>",
    "desc": "This course provides a structure for assessing individualized majors. Students will be advised of the need to include a senior integrating experience in their individualized major program. The student&apos;s Faculty Advisory Committee must approve the proposed experience during the individualized major hearing. One or more of the committee members will oversee the experience, and will provide verification of its satisfactory completion to the Associate Provost for Student Development and Public Affairs . The student will then receive a passing grade for the course. Graded Pass/Not Pass only. ",
    "hours": {},
    "offered": {
      "Upon demand": true
    }
  }
}