{
  "EDC150": {
    "course_id": "EDC150",
    "title": "EDC 150 Introduction to Teaching",
    "desc": "This course is recommended for all students considering or planning for a teaching career. The course is required for admission to some teacher education programs (see individual program requirements in catalog). An introduction to the teaching profession including an introduction to the Teacher Education Program at MSU, teaching standards and assessments, current reforms to the teaching profession, and other helpful information. May be taken concurrently with <span data-link='SEC302'>SEC 302</span>, <span data-link='ELE302'>ELE 302</span> or <span data-link='SPE310'>SPE 310</span> provided all respective prerequisites are met. Graded Pass/Not Pass only. ",
    "hours": {},
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "EDC199": {
    "course_id": "EDC199",
    "title": "EDC 199 Clinical Experiences in Teaching",
    "req": "<em>Prerequisite: approved application to earn academic credit for two (2) years experience as a Teacher&apos;s Aide/Assistant, as permitted by DESE Rule 5 CSR 80-805.040; previous or concurrent enrollment in professional education coursework; and permission of instructor.</em>",
    "desc": "Conducted teaching activities by students during aiding/assisting experiences, under the direction of the cooperating teacher and permission of a designated school principal, are verified as comparable to and demonstrating similar competencies of those expected by conventional student teachers. Students also participate in professional development activities, determined to be appropriate by the instructor. This course is credited only on BSEd or appropriate masters-level certification programs. ",
    "hours": {
      "credit": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "EDC345": {
    "course_id": "EDC345",
    "title": "EDC 345 Introduction to Multicultural Education and Diversity",
    "desc": "An introduction to cultural issues, diversity, and related perspectives in education. Examination of individual differences in ethnicity, race, socioeconomic status, gender, exceptionalities, language, religion, sexual orientation, and geographic area in the context of education and society. Development of skills, knowledge, and dispositions related to teaching and learning in varied settings with diverse learners required of all educators to be effective in a global society. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "EDC350": {
    "course_id": "EDC350",
    "title": "EDC 350 School and Society",
    "req": "<em>Prerequisite: admitted to Teacher Education Program; <span data-link='PSY385'>PSY 385</span> or <span data-link='CFD257'>CFD 257</span> (Elementary Education program); or <span data-link='CFD160'>CFD 160</span> (Early Childhood Education program); or <span data-link='PSY360'>PSY 360</span> (Secondary, Middle School, and K-12 programs); or concurrent enrollment.</em>",
    "desc": "This class examines the nature and history of schooling in America and the teaching profession, the purposes and goals of education, and educational philosophy. It also explores social, legal, and political issues connected with teaching and learning, diversity, racism, sexism, and the effects of social class on educational success. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "EDC700": {
    "course_id": "EDC700",
    "title": "EDC 700 Teaching and Learning I: Current Issues and Trends in Education",
    "req": "<em>Prerequisite: bachelor&apos;s degree and certification as a classroom teacher.</em>",
    "desc": "This course examines educational issues, questions, concerns, and trends teachers face in their schools and daily practices. The impact of national and state policy-making, directions suggested by emerging educational research, and current educational reform efforts will receive particular attention. ",
    "hours": {
      "credit": 5,
      "lecture": 3,
      "lab": 4
    },
    "offered": {
      "Fall": true
    }
  },
  "EDC701": {
    "course_id": "EDC701",
    "title": "EDC 701 Teaching and Learning II: Diversity, Curriculum and Research",
    "req": "<em>Prerequisite: <span data-link='EDC700'>EDC 700</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>",
    "desc": "This course engages students with research projects and curriculum ideas designed to strengthen and deepen student learning, with a special emphasis on questions of student diversity. The course helps students to formulate questions and use appropriate research principles to collect, analyze, interpret, and report data in order to evaluate the effectiveness of classroom instruction and educational policies. Students examine different curriculum models and theories and devise instructional practices to meet the needs of all learners. ",
    "hours": {
      "credit": 5,
      "lecture": 3,
      "lab": 4
    },
    "offered": {
      "Spring": true
    }
  },
  "EDC702": {
    "course_id": "EDC702",
    "title": "EDC 702 Teaching and Learning III: Management and Assessment of Learning",
    "req": "<em>Prerequisite: <span data-link='EDC700'>EDC 700</span> and <span data-link='EDC701'>EDC 701</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>",
    "desc": "This course examines the reasons for, benefits of, and limitations of the increasing call for effective and comprehensive assessment practices and helps teachers plan for, construct, use, and analyze a variety of assessment practices. This course also examines various models of and approaches to classroom management and discipline and the relation of management practices to effective learning. ",
    "hours": {
      "credit": 5,
      "lecture": 3,
      "lab": 4
    },
    "offered": {
      "Fall": true
    }
  },
  "EDC703": {
    "course_id": "EDC703",
    "title": "EDC 703 Teaching and Learning IV: Curriculum Development",
    "req": "<em>Prerequisite: <span data-link='EDC700'>EDC 700</span> and <span data-link='EDC701'>EDC 701</span> and <span data-link='EDC702'>EDC 702</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>",
    "desc": "This course engages students in a careful examination of the curriculum they teach, from district curriculum goals, national curriculum standards, and course- or grade-level goals. The course encourages reflection about instructional practices in light of curriculum goals. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "EDC704": {
    "course_id": "EDC704",
    "title": "EDC 704 Teaching and Learning V: Research Seminar",
    "req": "<em>Prerequisite: <span data-link='EDC700'>EDC 700</span> and <span data-link='EDC701'>EDC 701</span> and <span data-link='EDC702'>EDC 702</span> and <span data-link='EDC703'>EDC 703</span>; bachelor&apos;s degree and certification as a classroom teacher.</em>",
    "desc": "An in-depth study related to a research topic identified earlier in the program or curricular project begun as part of a learning team, leading to the guided development and completion of an extensive research paper. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "EDC786": {
    "course_id": "EDC786",
    "title": "EDC 786 Research Seminar in Education",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "An in-depth study of chosen topic in K-12 education leading to the guided development and completion of an extensive research paper or major creative work. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "EDC800": {
    "course_id": "EDC800",
    "title": "EDC 800 Teacher Leadership I: Contemporary Educational Problems",
    "req": "<em>Prerequisite: bachelor&apos;s degree and certification as a classroom teacher; master&apos;s degree in an education related field.</em>",
    "desc": "This blended (online and face-to-face) course examines current educational problems at the macro-social level and how current trends in education ease or exacerbate those problems. These problems include, but are not limited to, the achievement gap, charter schools, socio-economics, homelessness, school funding, race/gender, community-school relationships, the social impact of technology, public school funding, the state of democracy, and so forth. ",
    "hours": {
      "credit": 5,
      "lecture": 3,
      "lab": 4
    },
    "offered": {
      "Fall": true
    }
  },
  "EDC801": {
    "course_id": "EDC801",
    "title": "EDC 801 Teacher Leadership II: Diversity and Curricular Design",
    "req": "<em>Prerequisite: <span data-link='EDC800'>EDC 800</span>; bachelor&apos;s degree and certification as a classroom teacher; master&apos;s degree in an education related field.</em>",
    "desc": "This blended (online and face-to-face) course examines diversity and our shrinking global relationships through the lens of various theoretical perspectives (feminist, critical race theory, queer theory, etc.) as the means to critique current curriculum models and construct more culturally response curriculum for 21st century students. Participants will lead in the creation of curriculum that is responsive to their particular students, has a global perspective, and is mindful of ability differences ",
    "hours": {
      "credit": 5,
      "lecture": 3,
      "lab": 4
    },
    "offered": {
      "Fall": true
    }
  },
  "EDC802": {
    "course_id": "EDC802",
    "title": "EDC 802 Teacher Leadership III: Building Classroom Climate and Effective Student Assessments",
    "req": "<em>Prerequisite: <span data-link='EDC800'>EDC 800</span> and <span data-link='EDC801'>EDC 801</span>; bachelor&apos;s degree and certification as a classroom teacher; master&apos;s degree in an education related field.</em>",
    "desc": "This blended (online and face-to-face) course examines various philosophical bases for creating successful classroom communities and reasonable strategies for assessment student growth. This course also examines the myriad ways that classroom community understandings impact why and how students might be assessed. ",
    "hours": {
      "credit": 5,
      "lecture": 3,
      "lab": 4
    },
    "offered": {
      "Fall": true
    }
  },
  "EDC803": {
    "course_id": "EDC803",
    "title": "EDC 803 Teacher Leadership IV: Curriculum Development",
    "req": "<em>Prerequisite: <span data-link='EDC800'>EDC 800</span> and <span data-link='EDC801'>EDC 801</span> and <span data-link='EDC802'>EDC 802</span>; bachelor&apos;s degree and certification as a classroom teacher; master&apos;s degree in an education related field.</em>",
    "desc": "This blended (online and face-to-face) course engages students in a critical examination of curriculum theory as the basis for making curricular decisions. The course encourages reflection about curriculum goals in light of contemporary and historically understood curriculum theory. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "EDT365": {
    "course_id": "EDT365",
    "title": "EDT 365 Educational Applications of Technology and Media",
    "req": "<em>Prerequisite: <span data-link='ELE302'>ELE 302</span> or <span data-link='SPE310'>SPE 310</span> or <span data-link='SEC302'>SEC 302</span>, or concurrent enrollment for teacher education majors.</em>",
    "desc": "Principles and techniques for selection and utilization of computer and video as well as other basic forms of media and technology. The class combines research, instructional design, equipment operation and materials production in lecture and laboratory settings to prepare teachers to be reflective decision makers on proper methods of using technology in teaching. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "EDT530": {
    "course_id": "EDT530",
    "title": "EDT 530 Technology Systems Management and Maintenance",
    "desc": "This course will include an introduction to computer and peripheral hardware, microcomputer operating systems and education-related software packages, and the management of computers in a classroom or school setting. The management and maintenance of a system of computers is useful in many educational, instructional, communication and media production settings. Educational technology students should be prepared to troubleshoot and resolve basic technology problems that occur in an educational setting. Therefore, a variety of education-specific topics will be presented in this course. May be taught concurrently with <span data-link='EDT630'>EDT 630</span>. Cannot receive credit for both <span data-link='EDT530'>EDT 530</span> and <span data-link='EDT630'>EDT 630</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "EDT562": {
    "course_id": "EDT562",
    "title": "EDT 562 Educational Applications of Computers for Teaching",
    "desc": "Using microcomputers in educational settings. Includes the investigation of software in desktop publishing, record management and multimedia applications. Special emphasis will be given to selection of appropriate programs for specific classroom utilization as well as computer interfaced peripheral devices. May be taught concurrently with <span data-link='EDT662'>EDT 662</span>. Cannot receive credit for both <span data-link='EDT562'>EDT 562</span> and <span data-link='EDT662'>EDT 662</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 2,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "EDT563": {
    "course_id": "EDT563",
    "title": "EDT 563 Technology Administration and Management",
    "desc": "Provides technology specialists, technology coordinators, library media specialists, school administrators and educators with a working knowledge of the administrative processes and concerns of operating an educational technology support facility. The primary focus will be toward leadership, strategic planning, and change management and writing technology plans. The content of this course is primarily structured for educational institutions but could be utilized for instructional and training systems in many types of industrial, religious, medical and corporate organizations that teach and train. May be taught concurrently with <span data-link='EDT640'>EDT 640</span>. Cannot receive credit for both <span data-link='EDT563'>EDT 563</span> and <span data-link='EDT640'>EDT 640</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT565": {
    "course_id": "EDT565",
    "title": "EDT 565 Selection and Utilization of Educational Technology",
    "desc": "Targets principles of attention, perception, and retention regarding selection and implementation of instructional strategies. Students apply instructional design principles and learning theories to develop professional products; develop and implement evaluation strategies for hypermedia materials; combine electronic and non-electronic media; use telecommunications tools for production purposes; and integrate a variety of instructional technology tools. May be taught concurrently with <span data-link='EDT650'>EDT 650</span>. Cannot receive credit for both <span data-link='EDT565'>EDT 565</span> and <span data-link='EDT650'>EDT 650</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT597": {
    "course_id": "EDT597",
    "title": "EDT 597 Topical Issues in Educational Technology",
    "desc": "A variable credit course with amount of credit based on the extent of the work required. Special topics related to the field of Educational Technology which may broaden the scope of the program of study. May be repeated up to a maximum of 6 hours. May be taught concurrently with <span data-link='EDT690'>EDT 690</span>. Cannot receive credit for both <span data-link='EDT597'>EDT 597</span> and <span data-link='EDT690'>EDT 690</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT630": {
    "course_id": "EDT630",
    "title": "EDT 630 Technology Systems Management and Maintenance",
    "desc": "This course will include an introduction to computer and peripheral hardware, microcomputer operating systems and education-related software packages, and the management of computers in a classroom or school setting. The management and maintenance of a system of computers is useful in many educational, instructional, communication and media production settings. Educational technology students should be prepared to troubleshoot and resolve basic technology problems that occur in an educational setting. Therefore, a variety of education-specific topics will be presented in this course. May be taught concurrently with <span data-link='EDT530'>EDT 530</span>. Cannot receive credit for both <span data-link='EDT630'>EDT 630</span> and <span data-link='EDT530'>EDT 530</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "EDT640": {
    "course_id": "EDT640",
    "title": "EDT 640 Technology Administration and Management",
    "desc": "This course is designed to provide technology specialists, technology coordinators, library media specialists, school administrators and educators with a working knowledge of the administrative processes and concerns of operating an educational technology support facility. The primary focus will be toward leadership, strategic planning, and change management and writing technology plans. The content of this course is primarily structured for educational institutions but could be utilized for instructional and training systems in many types of industrial, religious, medical and corporate organizations that teach and train. May be taught concurrently with <span data-link='EDT563'>EDT 563</span>. Cannot receive credit for both <span data-link='EDT640'>EDT 640</span> and <span data-link='EDT563'>EDT 563</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT650": {
    "course_id": "EDT650",
    "title": "EDT 650 Selection and Utilization of Educational Technology",
    "desc": "Targets principles of attention, perception, and retention regarding selection and implementation of instructional strategies. Students apply instructional design principles and learning theories to develop professional products; develop and implement evaluation strategies for hypermedia materials; combine electronic and non-electronic media; use telecommunications tools for production purposes; and integrate a variety of instructional technology tools. May be taught concurrently with <span data-link='EDT565'>EDT 565</span>. Cannot receive credit for both <span data-link='EDT650'>EDT 650</span> and <span data-link='EDT565'>EDT 565</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT662": {
    "course_id": "EDT662",
    "title": "EDT 662 Educational Applications of Computers for Teaching",
    "desc": "Using microcomputers in educational settings. Includes the investigation of software in desktop publishing, record management and multimedia applications. Special emphasis will be given to selection of appropriate programs for specific classroom utilization as well as computer interfaced peripheral devices. May be taught concurrently with <span data-link='EDT562'>EDT 562</span>. Cannot receive credit for both <span data-link='EDT662'>EDT 662</span> and <span data-link='EDT562'>EDT 562</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 2,
      "lab": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT690": {
    "course_id": "EDT690",
    "title": "EDT 690 Topical Issues in Educational Technology",
    "desc": "A variable credit course with amount of credit based on the extent of the work required. Special topics related to the field of Educational Technology which may broaden the scope of the program of study. May be repeated up to a maximum of 6 hours. May be taught concurrently with <span data-link='EDT597'>EDT 597</span>. Cannot receive credit for both <span data-link='EDT690'>EDT 690</span> and <span data-link='EDT597'>EDT 597</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT696": {
    "course_id": "EDT696",
    "title": "EDT 696 Continuing Education in Educational Technology",
    "desc": "Special topics related to Educational Technology for continuing professional development. A variable credit course with amount of credit based on the extent of work required. Cannot count toward the Educational Technology MSED program. May be repeated to a maximum of 6 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT763": {
    "course_id": "EDT763",
    "title": "EDT 763 Administration of Educational Technology",
    "desc": "Emphasis is placed on management skills including budgeting; facility design; policies and procedures; selection and utilization; evaluation; assessment and other topics related to coordinating an educational technology program at a building, district, institutional or organizational level. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "EDT764": {
    "course_id": "EDT764",
    "title": "EDT 764 Instructional Design",
    "desc": "Emphasis on the analysis and development of instruction for large group, small group, and individual student instruction. The utilization of systems approaches and packaged instructional forms will be stressed. The course will integrate systems approaches with learning theory involving educational technology. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "EDT765": {
    "course_id": "EDT765",
    "title": "EDT 765 Educational Media Production",
    "desc": "Principles and techniques of designing and producing advanced forms of media software materials in video, audio, and photography formats with emphasis on multi-media that includes computer generated graphics interfaced with video and audio editing as well as more basic production techniques. ",
    "hours": {
      "credit": 3,
      "lecture": 2,
      "lab": 2
    },
    "offered": {
      "Summer": true
    }
  },
  "EDT767": {
    "course_id": "EDT767",
    "title": "EDT 767 Educational Technology Practicum",
    "desc": "This is a field-experience based course that requires the student to spend a minimum of 20 clock hours in a working environment where educational media technology services and programs are used or developed. The practicum may include: school media services: university programs, development centers in industry, government or medical programs, educational TV studios, computer facilities or other media production venues. ",
    "hours": {
      "credit": 2,
      "lab": 4
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT777": {
    "course_id": "EDT777",
    "title": "EDT 777 Problems in Educational Technology",
    "desc": "Research in or in-depth examination of issues and problems in the field of Educational Technology. May be repeated up to a maximum of 5 hours when topic varies. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT797": {
    "course_id": "EDT797",
    "title": "EDT 797 Educational Technology Special Research Project",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "An extensive multimedia production project which results in a functional product with extensive written documentation to support its use as a research or instructional tool which could provide results for extended research and publication. ",
    "hours": {
      "credit": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT798": {
    "course_id": "EDT798",
    "title": "EDT 798 Research Seminar in Educational Technology",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "An extensive research paper focused on the field of instructional Design and Technology. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "EDT799": {
    "course_id": "EDT799",
    "title": "EDT 799 Educational Technology Thesis",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "Independent research and study connected with preparation of a thesis in the field of Educational Technology. The paper will consist of original or creative research accountable to committee review and defense. May be repeated for a maximum of 6 hours credit. ",
    "hours": {
      "credit": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "MID400": {
    "course_id": "MID400",
    "title": "MID 400 Philosophy, Curriculum, and Organization of Middle School Education",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "An overview of middle level education philosophy, curriculum planning and development, instruction, and organization. Emphasis is on cognitive, behavioral, and affective needs of middle level students, and on the development of interdisciplinary thematic units. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MID421": {
    "course_id": "MID421",
    "title": "MID 421 Philosophy and Organization of Middle School Education",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "An overview of the philosophy, organization and curriculum of the middle school with emphasis upon teaching methods appropriate for use with students in late childhood and early adolescence. Strategies for advisory, study skills, and transition programs. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "MID425": {
    "course_id": "MID425",
    "title": "MID 425 Middle School Curriculum",
    "req": "<em>Prerequisite: <span data-link='MID421'>MID 421</span> or concurrent enrollment; and admitted to Teacher Education Program.</em>",
    "desc": "Foundations in the development and articulation of middle school curriculum, with emphasis on the development of interdisciplinary thematic units and lessons relevant to the young adolescent learner. Integrated approaches to teaching and learning designed, implemented, and evaluated as part of a teaching team. Alternative assessments, including performance-based portfolios. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "MID439": {
    "course_id": "MID439",
    "title": "MID 439 Middle School Instructional Strategies",
    "req": "<em>Prerequisite: <span data-link='MID421'>MID 421</span> or <span data-link='MID400'>MID 400</span>; and admitted to Teacher Education Program.</em>",
    "desc": "Recommended Prerequisite: <span data-link='MID425'>MID 425</span>. Students will be assigned to site-based middle school teaching teams at Greenwood Laboratory School and/or area middle schools and will attend weekly seminars. Instructional methods and techniques appropriate for middle school learners will be studied including: teaching subject area classes in the core curriculum and strategies for teaching exploratory and advisory classes. Includes exploration of current issues, research, and innovative approaches to teaching at-risk youth and those with diverse backgrounds. ",
    "hours": {
      "credit": 3,
      "lecture": 2,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MID493": {
    "course_id": "MID493",
    "title": "MID 493 Supervised Teaching (Middle School)",
    "req": "<em>Prerequisite: <span data-link='MID400'>MID 400</span> or <span data-link='MID425'>MID 425</span>; and <span data-link='MID439'>MID 439</span> and <span data-link='RDG318'>RDG 318</span> and <span data-link='RDG474'>RDG 474</span>; and all method courses in chosen content areas; a grade of &quot;C&quot; or better in all professional education courses; current pre-professional liability insurance; and approval for supervised teaching.</em>",
    "desc": "Student observes then teaches under the direction of the cooperating teacher and university supervisor. Student participates in extra-curricular, co-curricular, and exploratory activities and attends both individual and group conferences. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA or in the subject matter emphasis area. Supplemental course fee. Public Affairs Capstone Experience course. ",
    "hours": {
      "credit": 6
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MID494": {
    "course_id": "MID494",
    "title": "MID 494 Supervised Teaching (Middle School)",
    "req": "<em>Prerequisite: concurrent enrollment in <span data-link='MID493'>MID 493</span>.</em>",
    "desc": "Student observes then teaches under the direction of the cooperating teacher and university supervisor. Student participates in extra-curricular, co-curricular, and exploratory activities and attends both individual and group conferences. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA or in the subject matter emphasis area. Supplemental course fee. Public Affairs Capstone Experience course. ",
    "hours": {
      "credit": 6
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MID499": {
    "course_id": "MID499",
    "title": "MID 499 Clinical Experiences in Teaching II",
    "req": "<em>Prerequisite: <span data-link='EDC199'>EDC 199</span>; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>",
    "desc": "This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: <span data-link='AGE499'>AGE 499</span>, <span data-link='AGT499'>AGT 499</span>, <span data-link='ART469'>ART 469</span>, <span data-link='BSE499'>BSE 499</span>, <span data-link='COM493'>COM 493</span>, <span data-link='ECE499'>ECE 499</span>, <span data-link='ELE499'>ELE 499</span>, <span data-link='ENG434'>ENG 434</span>, <span data-link='FCS498'>FCS 498</span>, <span data-link='HST499'>HST 499</span>, <span data-link='KIN498'>KIN 498</span>, <span data-link='MCL491'>MCL 491</span>, <span data-link='MID499'>MID 499</span>, <span data-link='MTH496'>MTH 496</span>, <span data-link='MUS499'>MUS 499</span>, <span data-link='SCI499'>SCI 499</span>, <span data-link='SEC499'>SEC 499</span>, <span data-link='SPE499'>SPE 499</span>, <span data-link='THE493'>THE 493</span>. Supplemental course fee. ",
    "hours": {
      "credit": 4
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MID725": {
    "course_id": "MID725",
    "title": "MID 725 Advanced Theory and Practice in the Teaching of Early Adolescents",
    "desc": "Materials, methods, and procedures for designing developmentally appropriate learning experiences for early adolescents; current trends and issues in the field. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "MID810": {
    "course_id": "MID810",
    "title": "MID 810 The Middle School-The Junior High School",
    "desc": "An examination of educational programs most appropriate for students in late childhood and early adolescence with emphasis upon the philosophy, curriculum, instruction, and organization of middle schools and junior high schools. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG107": {
    "course_id": "RDG107",
    "title": "RDG 107 Critical Reading and Study Skills in Academic Texts",
    "desc": "Introduction to college reading designed to help students acquire and improve critical reading comprehension skills of academic texts necessary for college-level coursework. Provides intensive reading instruction in comprehension, vocabulary development, reading rate, reading efficiency techniques, and reading study strategies. Cannot be used to satisfy any General Education Program requirement or any major or minor requirement. Cannot receive credit for both <span data-link='RDG107'>RDG 107</span> and <span data-link='IDS118'>IDS 118</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 1,
      "lab": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG300": {
    "course_id": "RDG300",
    "title": "RDG 300 Service Learning in Literacy",
    "req": "<em>Prerequisite: 30 hours and concurrent registration in a RDG course designated as a service learning offering and admitted to Teacher Education Program.</em>",
    "desc": "This service component for an existing course incorporates community service with classroom instruction in literacy to provide an integrated learning experience that addresses the practice of citizenship and promotes an awareness of and participation in public affairs. Includes 40 hours of service that benefits an external community organization, agency, or public service provider. Approved service placements and assignments will vary depending on the course topic and learning objectives; a list of approved placements and assignments is available from the instructor and the Citizenship and Service Learning Office. Cannot be substituted for <span data-link='RDG421'>RDG 421</span> or any other required practicum. May be repeated. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG318": {
    "course_id": "RDG318",
    "title": "RDG 318 Foundations of Literacy Instruction",
    "req": "<em>Prerequisite: <span data-link='ELE302'>ELE 302</span> or <span data-link='SPE310'>SPE 310</span> or <span data-link='SEC302'>SEC 302</span> with grade of &quot;C&quot; or higher.</em>",
    "desc": "An initial course in literacy foundations and methods from emergent literacy through middle school/junior high school. Examines various approaches of current literacy instruction and practices, including the basic components of literacy and applications to content areas. Creates a literate environment that fosters reading and writing by integrating foundational knowledge. Emphasizes contemporary classrooms, which are assumed to contain children of diverse cultures and abilities. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "RDG319": {
    "course_id": "RDG319",
    "title": "RDG 319 Practicum-Foundations of Literacy Instruction",
    "req": "<em>Prerequisite: admitted to Teacher Education Program and current pre-professional liability insurance.</em>",
    "desc": "Practical application of developmental, functional, and recreational literacy instructional practices from emergent literacy through middle school/junior high school by the assignment of students to practicum centers where they will be required to observe, prepare, teach, and analyze literacy lessons. Family Care and Safety Registry (FCSR) check is required. ",
    "hours": {
      "credit": 1,
      "lab": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG420": {
    "course_id": "RDG420",
    "title": "RDG 420 Methods of Teaching Reading and Language Arts in Elementary Schools",
    "req": "<em>Prerequisite: <span data-link='RDG318'>RDG 318</span>; and admitted to Teacher Education Program; and concurrent enrollment in <span data-link='RDG421'>RDG 421</span>.</em>",
    "desc": "A practical approach to elementary reading and language arts instruction including assessment of the literacy needs and progress of children and selecting appropriate materials and procedures for the contemporary classroom, which is assumed to contain children of diverse cultures and learning abilities. Concepts from reading, language, and child development are used to teach reading, writing, speaking, viewing, listening, and thinking skills to help children apply their developing abilities to different situations, materials, and ideas. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "RDG421": {
    "course_id": "RDG421",
    "title": "RDG 421 Practicum-Methods of Teaching Reading and Language Arts in the Elementary Schools",
    "req": "<em>Prerequisite: <span data-link='RDG318'>RDG 318</span> and concurrent enrollment in <span data-link='RDG420'>RDG 420</span> and admitted to Teacher Education Program.</em>",
    "desc": "Practicum application of techniques in personalizing elementary literacy instruction, by the assignment of students to practicum centers where they will be required to assess the literacy status and progress of children and select appropriate materials and techniques for developmental and corrective reading. Family Care and Safety Registry (RCSR) check is required. Additional field experience activities required outside of class time. ",
    "hours": {
      "credit": 2,
      "lecture": 1,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "RDG422": {
    "course_id": "RDG422",
    "title": "RDG 422 Techniques of Teaching Literacy in the Content Fields",
    "req": "<em>Prerequisite: <span data-link='RDG318'>RDG 318</span> and admitted to Teacher Education Program.</em>",
    "desc": "Assess literacy levels and select appropriate materials in various content fields. Techniques of teaching reading and writing in content areas, with emphasis on functional and study skills in these materials. Application will be made to the contemporary classroom, which is assumed to contain children of diverse cultures and learning abilities. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG474": {
    "course_id": "RDG474",
    "title": "RDG 474 Reading and Writing in the Content Fields",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Methods and strategies for using reading and writing as tools for learning in regular middle and secondary school classrooms in which there exists a wide range of literacy achievement. Includes awareness of reading and writing approaches and problems; study skills, literacy evaluation and measurement; vocabulary and comprehension development; selection of materials appropriate for each student. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "RDG480": {
    "course_id": "RDG480",
    "title": "RDG 480 Problems in Literacy Education",
    "desc": "The student, in consultation with advisor or instructor, selects a topic in literacy for in-depth, independent study. Number of hours of involvement determined by semester hours of credit. May be repeated to a total of 5 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG556": {
    "course_id": "RDG556",
    "title": "RDG 556 Topical Issues in Literacy",
    "req": "<em>Prerequisite: permission may be required (see class schedule).</em>",
    "desc": "To develop understanding and skills in relevant areas of literacy education. Credit hours may vary depending on topic. Variable content course. May be repeated to a total of 5 hours when topics change. A maximum of 3 hours may be used toward degree. May be taught concurrently with <span data-link='RDG656'>RDG 656</span>. Cannot receive credit for both <span data-link='RDG656'>RDG 656</span> and <span data-link='RDG556'>RDG 556</span> on same topic. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG560": {
    "course_id": "RDG560",
    "title": "RDG 560 Diversity Issues in Literacy and Content Area Instruction",
    "desc": "Designed for preservice and practicing elementary, middle, and high school teachers working on undergraduate degrees in Elementary Education or Secondary Education; as well as graduate degrees in Literacy, Elementary Education, MAT, or other MS or MSED graduate degrees. Students will expand their knowledge of racial, cultural, ethnic, linguistics, and socio-economics diversity; and learn strategies to implement diversity issues into their literacy instruction and/or content area lessons. Students will be introduced to different aspects of diversity through a wide variety of course readings, multicultural literature, videos, guest speakers, multicultural interview, and community field trips. May be taught concurrently with <span data-link='RDG660'>RDG 660</span>. Cannot receive credit for both <span data-link='RDG660'>RDG 660</span> and <span data-link='RDG560'>RDG 560</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "RDG565": {
    "course_id": "RDG565",
    "title": "RDG 565 Cultural Diversity in Literacy and Instruction: Classrooms and Community",
    "desc": "Designed for preservice and practicing middle and high school teachers working on undergraduate degrees in Elementary, Middle School, or Secondary Education. Students will expand their knowledge of ethnicity, race, socio-economics status, gender, exceptionalities, language, religion, sexual orientation, and geographic areas in the context of classrooms, schools, and community; and learn strategies to implement diversity into their literacy instruction and/or content area lessons. Students will be introduced to different aspects of domestic and global diversity through a wide variety of course readings, culturally diverse literature, instructional videos, documentaries, webcasts, and intercultural interviews. May be taught concurrently with <span data-link='RDG665'>RDG 665</span>. Cannot receive credit for both <span data-link='RDG565'>RDG 565</span> and <span data-link='RDG665'>RDG 665</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG573": {
    "course_id": "RDG573",
    "title": "RDG 573 Psychology of Literacy",
    "desc": "Practical contemporary learning theories and principles that are basic to acquiring literacy. Focus on evidence-based research supporting learner-centered classrooms and issues of cognitive and metacognitive development, the affective and motivational dimensions of instruction, the developmental and social aspects of learning, and individual differences in learning associated with cultural and social backgrounds. May be taught concurrently with <span data-link='RDG673'>RDG 673</span>. Cannot receive credit for both <span data-link='RDG573'>RDG 573</span> and <span data-link='RDG673'>RDG 673</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG574": {
    "course_id": "RDG574",
    "title": "RDG 574 Analysis and Correction of Difficulties in Literacy",
    "req": "<em>Prerequisite: <span data-link='RDG318'>RDG 318</span> or both <span data-link='RDG420'>RDG 420</span> and <span data-link='RDG421'>RDG 421</span>, or equivalent; and admitted to Teacher Education Program.</em>",
    "desc": "Techniques of analysis and correction of difficulties in literacy for elementary, secondary, special education and reading/literacy teachers. Trends in dealing with diagnostic procedures, instructional techniques, special materials, and assessment. Students concentrate study within their level of training. Family Care and Safety Registry (RCSR) check is required. May be taught concurrently with <span data-link='RDG640'>RDG 640</span>. Cannot receive credit for both <span data-link='RDG640'>RDG 640</span> and <span data-link='RDG574'>RDG 574</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG580": {
    "course_id": "RDG580",
    "title": "RDG 580 Successful Classroom Communities to Enhance Student Learning",
    "desc": "Integration of areas supporting student learning including productive interactions with families. Concentrated modules on literacy learning of regular education students, struggling readers, and exceptional students. Basic principles in effective communication with parents and other professionals to reinforce appropriate classroom learning. Cannot be substituted for any course required for Special Education degrees or certificates. May be taught concurrently with <span data-link='RDG680'>RDG 680</span>. Cannot receive credit for both <span data-link='RDG680'>RDG 680</span> and <span data-link='RDG580'>RDG 580</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "RDG585": {
    "course_id": "RDG585",
    "title": "RDG 585 Techniques of Responsive Support in the Literacy Classroom",
    "desc": "Techniques to support positive, active learning through appropriate response to intervention plans within the literacy classroom. Study of alternative and appropriate behaviors to meet students&apos; needs in acceptable ways through modeling, guided practice, and cueing within a supportive environment, which includes teachers, parents, and other stakeholders in students&apos; learning. Cannot be substituted for <span data-link='SPE515'>SPE 515</span>, 615, 616, or any course required for a Special Education degree or certificate. May be taught concurrently with <span data-link='RDG685'>RDG 685</span>. Cannot receive credit for both <span data-link='RDG585'>RDG 585</span> and <span data-link='RDG685'>RDG 685</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "RDG599": {
    "course_id": "RDG599",
    "title": "RDG 599 Literacy Projects",
    "desc": "This course is designed to provide students an opportunity to informally assess and tutor adults or children exhibiting literacy difficulties. Students are expected to have an increased awareness and understanding pertaining to literacy and to recognize the importance of improving the educational process of adults and children. Number of class hours determined by semester hours of credit. Cannot be substituted for any required reading/literacy course. May be repeated to a total of 3 hours. May be taught concurrently with <span data-link='RDG600'>RDG 600</span>. Cannot receive credit for both <span data-link='RDG600'>RDG 600</span> and <span data-link='RDG599'>RDG 599</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG600": {
    "course_id": "RDG600",
    "title": "RDG 600 Literacy Projects",
    "desc": "This course is designed to provide students an opportunity to informally assess and tutor adults or children exhibiting literacy difficulties. Students are expected to have an increased awareness and understanding pertaining to literacy and to recognize the importance of improving the educational process of adults and children. Number of class hours determined by semester hours of credit. Cannot be substituted for any required reading/literacy course. May be repeated to a total of 3 hours. May be taught concurrently with <span data-link='RDG599'>RDG 599</span>. Cannot receive credit for both <span data-link='RDG599'>RDG 599</span> and <span data-link='RDG600'>RDG 600</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG640": {
    "course_id": "RDG640",
    "title": "RDG 640 Analysis and Correction of Difficulties in Literacy",
    "req": "<em>Prerequisite: <span data-link='RDG318'>RDG 318</span> or both <span data-link='RDG420'>RDG 420</span> and <span data-link='RDG421'>RDG 421</span>, or equivalent; and admitted to Teacher Education Program.</em>",
    "desc": "Techniques of analysis and correction of difficulties in literacy for elementary, secondary, special education and reading/literacy teachers. Trends in dealing with diagnostic procedures, instructional techniques, special materials, and assessment. Students concentrate study within their level of training. Family Care and Safety Registry (FCSR) check is required. May be taught concurrently with <span data-link='RDG574'>RDG 574</span>. Cannot receive credit for both <span data-link='RDG640'>RDG 640</span> and <span data-link='RDG574'>RDG 574</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG656": {
    "course_id": "RDG656",
    "title": "RDG 656 Topical Issues in Literacy",
    "req": "<em>Prerequisite: permission may be required (see class schedule).</em>",
    "desc": "To develop understanding and skills in relevant areas of literacy education. Credit hours may vary depending on topic. Variable content course. May be repeated to a total of 5 hours when topics change. A maximum of 3 hours may be used toward degree. May be taught concurrently with <span data-link='RDG556'>RDG 556</span>. Cannot receive credit for both <span data-link='RDG556'>RDG 556</span> and <span data-link='RDG656'>RDG 656</span> on same topic. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG660": {
    "course_id": "RDG660",
    "title": "RDG 660 Diversity Issues in Literacy and Content Area Instruction",
    "desc": "Designed for preservice and practicing elementary, middle, and high school teachers working on undergraduate degrees in Elementary Education or Secondary Education; as well as graduate degrees in Literacy, Elementary Education, MAT, or other MS or MSED graduate degrees. Students will expand their knowledge of racial, cultural, ethnic, linguistics, and socio-economics diversity; and learn strategics to implement diversity issues into their literacy instruction and/or content area lessons. Students will be introduced to different aspects of diversity through a wide variety of course readings, multicultural literature, videos, guest speakers, multicultural interview, and community field trips. May be taught concurrently with <span data-link='RDG560'>RDG 560</span>. Cannot receive credit for both <span data-link='RDG560'>RDG 560</span> and <span data-link='RDG660'>RDG 660</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "RDG665": {
    "course_id": "RDG665",
    "title": "RDG 665 Cultural Diversity in Literacy and Instruction: Classrooms and Community",
    "desc": "Designed for preservice and practicing middle and high school teachers working on graduate degrees in Literacy, Educational Technology, Master of Arts in Teaching, Master of Arts in Teaching and Learning, Elementary Education, or other MS, MA or MSEd graduate degrees. Students will expand their knowledge of ethnicity, race, socio-economics status, gender, exceptionalities, language, religion, sexual orientation, and geographic areas in the context of classrooms, schools, and community; and learn strategies to implement diversity into their literacy instruction and/or content area lessons. Students will be introduced to different aspects of domestic and global diversity through a wide variety of course readings, culturally diverse literature, instructional videos, documentaries, webcasts, and intercultural interviews. May be taught concurrently with <span data-link='RDG565'>RDG 565</span>. Cannot receive credit for both <span data-link='RDG665'>RDG 665</span> and <span data-link='RDG565'>RDG 565</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG673": {
    "course_id": "RDG673",
    "title": "RDG 673 Psychology of Literacy",
    "desc": "Practical contemporary learning theories and principles that are basic to acquiring literacy. Focus on evidence-based research supporting learner-centered classrooms and issues of cognitive and metacognitive development, the affective and motivational dimensions of instruction, the developmental and social aspects of learning, and individual differences in learning associated with cultural and social backgrounds. May be taught concurrently with <span data-link='RDG573'>RDG 573</span>. Cannot receive credit for both <span data-link='RDG673'>RDG 673</span> and <span data-link='RDG573'>RDG 573</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG680": {
    "course_id": "RDG680",
    "title": "RDG 680 Successful Classroom Communities to Enhance Student Learning",
    "desc": "Integration of areas supporting student learning including productive interactions with families. Concentrated modules on literacy learning of regular education students, struggling readers, and exceptional students. Basic principles in effective communication with parents and other professionals to reinforce appropriate classroom learning. Cannot be substituted for any course required for Special Education degrees or certificates. May be taught concurrently with <span data-link='RDG580'>RDG 580</span>. Cannot receive credit for both <span data-link='RDG680'>RDG 680</span> and <span data-link='RDG580'>RDG 580</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "RDG685": {
    "course_id": "RDG685",
    "title": "RDG 685 Techniques of Responsive Support in the Literacy Classroom",
    "desc": "Techniques to support positive, active learning through appropriate response to intervention plans within the literacy classroom. Study of alternative and appropriate behaviors to meet students&apos; needs in acceptable ways through modeling, guided practice, and cueing within a supportive environment, which includes teachers, parents, and other stakeholders in student&apos;s learning. Cannot be substituted for <span data-link='SPE515'>SPE 515</span>, 615, 616, or any course required for a SPE degree or certificate. May be taught concurrently with <span data-link='RDG585'>RDG 585</span>. Cannot receive credit for both <span data-link='RDG585'>RDG 585</span> and 685. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "RDG700": {
    "course_id": "RDG700",
    "title": "RDG 700 Relationship of Language to Literacy and Intellectual Development",
    "desc": "Utilizing elements of language and intellectual development which provide the basis for the development of appropriate literacy skills. Helping teachers gain skill in using teaching strategies which help children develop language and intellectual competencies. To be taken during the first semester of the graduate literacy program. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "RDG710": {
    "course_id": "RDG710",
    "title": "RDG 710 Content Area Literacy",
    "req": "<em>Prerequisite: enrollment limited to students in the MSED, MA, and MAT programs.</em>",
    "desc": "Teaching subject matter in content areas in ways for utilizing and further developing fundamental literacy; effective reading and writing skills, vocabulary development in specific areas, study skills, utilization of cognitive processes. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "RDG720": {
    "course_id": "RDG720",
    "title": "RDG 720 Use of Multi-Media Resources in Literacy",
    "desc": "Criteria, methods and tools for selection and effective utilization of both print and nonprint material, enhancing and encouraging competency in literacy; production of materials utilizing various media. Students concentrate study within their level of training (elementary or secondary.) ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "RDG730": {
    "course_id": "RDG730",
    "title": "RDG 730 Assessment and Instruction of Less Skilled Readers and Writers",
    "req": "<em>Prerequisite: <span data-link='RDG318'>RDG 318</span>; or both <span data-link='RDG420'>RDG 420</span> and <span data-link='RDG421'>RDG 421</span>, or equivalent.</em>",
    "desc": "Supervised small group practice in a clinical setting assessing and instructing students who are experiencing difficulty learning to read and write. Planned with and directed by a graduate faculty member. Less intensive and more generalized clinical experience for those not intending to pursue Special Reading Teacher certification. Cannot be substituted for any course required for special reading certification (<span data-link='RDG574'>RDG 574</span>/640, 780, 781, or 782). Family Care and Safety Registry (FCSR) check is required. Literacy majors must enroll for 6 hours, other majors may enroll for 3 hours. 3(2-2) or ",
    "hours": {
      "credit": 6,
      "lecture": 2,
      "lab": 8
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG740": {
    "course_id": "RDG740",
    "title": "RDG 740 Issues and Trends in Literacy Education",
    "desc": "Provides intensive study of significant issues and trends in literacy education. Emphasis on locating and analyzing current issues and trends and encouraging teachers and administrators to apply the information to research-based best practices in the classroom. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Summer": true
    }
  },
  "RDG770": {
    "course_id": "RDG770",
    "title": "RDG 770 Curriculum Design in Literacy",
    "desc": "This course examines the theories and research on literacy from comprehension to implications for instructional practice. Candidates will gain knowledge and share with classmates influences on the teaching of literacy, which may include practices from historical to contemporary times. Research and read literature to prepare for establishing a total school literacy curriculum. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG780": {
    "course_id": "RDG780",
    "title": "RDG 780 Assessment Procedures for the Literacy Specialist",
    "req": "<em>Prerequisite: <span data-link='RDG640'>RDG 640</span>.</em>",
    "desc": "Designed especially for the special reading teacher or literacy coach who needs an advanced course for special reading teacher certification. Psycho-educational testing techniques, multisensory teaching techniques, report writing, resource personnel, and clinic operations will form the basis for this course. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "RDG781": {
    "course_id": "RDG781",
    "title": "RDG 781 Assessment of Literacy Problems",
    "req": "<em>Prerequisite: <span data-link='RDG780'>RDG 780</span>; and concurrent enrollment in <span data-link='RDG782'>RDG 782</span>.</em>",
    "desc": "Supervised individual practice diagnosing literacy problems. Students work with elementary, secondary, or adult learners. Includes 4 hours of practicum. ",
    "hours": {
      "credit": 3,
      "lecture": 1,
      "lab": 4
    },
    "offered": {
      "Summer": true
    }
  },
  "RDG782": {
    "course_id": "RDG782",
    "title": "RDG 782 Remediation of Literacy Problems",
    "req": "<em>Prerequisite: <span data-link='RDG780'>RDG 780</span>; and concurrent enrollment in <span data-link='RDG781'>RDG 781</span>.</em>",
    "desc": "Supervised individual practice with remedial procedures for literacy problems. Students work with elementary, secondary, or adult learners. Includes 4 hours of practicum. ",
    "hours": {
      "credit": 3,
      "lecture": 1,
      "lab": 4
    },
    "offered": {
      "Summer": true
    }
  },
  "RDG791": {
    "course_id": "RDG791",
    "title": "RDG 791 Problems in Literacy Education",
    "req": "<em>Prerequisite: concurrent enrollment in <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "In consultation with the advisor, major issues in the field of literacy education are selected for investigation through independent study. Number of hours of involvement determined by semester hours of credit. May be repeated to a total of 3 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "RDG795": {
    "course_id": "RDG795",
    "title": "RDG 795 Research Seminar in Literacy",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span> and <span data-link='RDG700'>RDG 700</span> or <span data-link='RDG710'>RDG 710</span> and <span data-link='RDG791'>RDG 791</span>.</em>",
    "desc": "An in-depth study of a topic in literacy, leading to the guided development and completion of an extensive research paper. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "RDG799": {
    "course_id": "RDG799",
    "title": "RDG 799 Thesis",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span> and <span data-link='RDG700'>RDG 700</span> and <span data-link='RDG710'>RDG 710</span> and <span data-link='RDG791'>RDG 791</span>.</em>",
    "desc": "Independent research and study connected with preparation of thesis. May be repeated to a maximum of 6 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC300": {
    "course_id": "SEC300",
    "title": "SEC 300 Clinical and Field Experiences in Secondary Education",
    "req": "<em>Prerequisite: <span data-link='SFR250'>SFR 250</span> and an initial Missouri State Board of Education entry examination must be taken and concurrent enrollment in <span data-link='SEC301'>SEC 301</span>.</em>",
    "desc": "Students enrolled attend a weekly clinical and/or discussion session on campus and participate in field experiences at the Greenwood Laboratory School and/or area secondary schools. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 2,
      "lab": 4
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC301": {
    "course_id": "SEC301",
    "title": "SEC 301 Introduction to Teaching in the Secondary School",
    "req": "<em>Prerequisite: <span data-link='SFR250'>SFR 250</span> and an initial Missouri State Board of Education entry examination must be taken and concurrent enrollment in <span data-link='SEC300'>SEC 300</span>.</em>",
    "desc": "Principles and objectives of secondary education; methods of meeting the diverse educational needs of today&apos;s secondary students; techniques of teaching; unit construction and daily planning. Required first portfolio checkpoint will occur in this course. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC302": {
    "course_id": "SEC302",
    "title": "SEC 302 General Methods of Instruction in the Middle and Secondary Schools",
    "req": "<em>Prerequisite: 45 hours; 2.50 combined GPA; and a passing grade in <span data-link='EDC150'>EDC 150</span> or concurrent enrollment or equivalent competencies.</em>",
    "desc": "Principles and objectives of secondary education; methods of meeting the diverse educational needs of today&apos;s middle and secondary students; techniques of teaching; unit construction and daily planning. Students participate in a 30 hour field experience at the Greenwood Laboratory School and/or area middle or secondary schools. A grade of C or better is required in this course in order to enroll in supervised teaching. Required first portfolio checkpoint will occur in this course. This course is a combination of previously offered <span data-link='SEC300'>SEC 300</span>/301 and students cannot receive credit for both <span data-link='SEC300'>SEC 300</span>/301 and <span data-link='SEC302'>SEC 302</span>. All sections of the Missouri State Board of Education entry examination must be passed to proceed beyond this point in the Professional Education Program. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 3,
      "lecture": 2,
      "lab": 2
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "SEC493": {
    "course_id": "SEC493",
    "title": "SEC 493 Supervised Teaching (Secondary)",
    "req": "<em>Prerequisite: completion of all method courses in chosen content area; a grade of &quot;C&quot; or better in all professional education courses; current pre-professional liability insurance; and approval for supervised teaching.</em>",
    "desc": "Student observes, then teaches under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. ",
    "hours": {
      "credit": 5
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "SEC494": {
    "course_id": "SEC494",
    "title": "SEC 494 Supervised Teaching (Secondary)",
    "req": "<em>Prerequisite: concurrent enrollment in <span data-link='SEC493'>SEC 493</span>.</em>",
    "desc": "Student observes, then teaches under the direction of the cooperating teacher and the university supervisor. Student participates in school-related activities appropriate to the assignment and attends all required meetings. In order to receive a grade in this course, the student&apos;s professional portfolio must meet or exceed final criteria. Course will not count toward the major GPA. Supplemental course fee. ",
    "hours": {
      "credit": 5
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "SEC495": {
    "course_id": "SEC495",
    "title": "SEC 495 Theory into Practice: Applications Workshop",
    "req": "<em>Prerequisite: completion of all method courses in chosen content area; a grade of C or better in all professional education courses; approval for student teaching; and concurrent enrollment in <span data-link='SEC493'>SEC 493</span> or other supervised teaching course.</em>",
    "desc": "Students enroll in workshops, offered during the student teaching semester, that help student teachers with particularly important and difficult tasks involving such things as how to work with diverse student populations, how to apply effective reading strategies, and how to manage students in the classroom. Additional aspects of teaching unique to particular subject matter areas will also be explored. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "SEC499": {
    "course_id": "SEC499",
    "title": "SEC 499 Clinical Experiences in Teaching II",
    "req": "<em>Prerequisite: <span data-link='EDC199'>EDC 199</span>; and admitted to Teacher Education Program; and grades of &quot;C&quot; or better in all professional education courses; and completion of portfolio checkpoints 1 and 2; and current pre-professional liability insurance; and program approval.</em>",
    "desc": "This course is designed to meet HB 1711 for student&apos;s experience as a Teacher&apos;s Aide or Assistant Rule (Rule 5 CSR 80-805.040), to that of conventional student teachers within the same program. It is also designed to support completion of additional clinical requirements within that program including: seminars and workshops, required meetings, school related activities appropriate to the assignment, demonstrated mastery of the MoSPE standards and completion and overall assessment of a Professional Preparation Portfolio. This course is credited only on BSEd or appropriate masters-level certification programs. Can only receive credit for one of the following: <span data-link='AGE499'>AGE 499</span>, <span data-link='AGT499'>AGT 499</span>, <span data-link='ART469'>ART 469</span>, <span data-link='BSE499'>BSE 499</span>, <span data-link='COM493'>COM 493</span>, <span data-link='ECE499'>ECE 499</span>, <span data-link='ELE499'>ELE 499</span>, <span data-link='ENG434'>ENG 434</span>, <span data-link='FCS498'>FCS 498</span>, <span data-link='HST499'>HST 499</span>, <span data-link='KIN498'>KIN 498</span>, <span data-link='MCL491'>MCL 491</span>, <span data-link='MID499'>MID 499</span>, <span data-link='MTH496'>MTH 496</span>, <span data-link='MUS499'>MUS 499</span>, <span data-link='SCI499'>SCI 499</span>, <span data-link='SEC499'>SEC 499</span>, <span data-link='SPE499'>SPE 499</span>, <span data-link='THE493'>THE 493</span>. Supplemental course fee. ",
    "hours": {
      "credit": 4
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "SEC522": {
    "course_id": "SEC522",
    "title": "SEC 522 Philosophy of Vocational Education",
    "desc": "Philosophical foundations of vocational education; philosophies of vocational education in contemporary school. Identical with <span data-link='AGV522'>AGV 522</span> and <span data-link='BSE522'>BSE 522</span>. May be repeated to a total of 3 hours. May be taught concurrently with <span data-link='SEC622'>SEC 622</span>. Cannot receive credit for both <span data-link='SEC622'>SEC 622</span> and <span data-link='SEC522'>SEC 522</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC526": {
    "course_id": "SEC526",
    "title": "SEC 526 Coordination of Cooperative Education",
    "desc": "Problems and procedures in organizing and operating part-time cooperative and evening occupation programs. Restricted to those who can qualify as coordinators. Identical with <span data-link='AGV526'>AGV 526</span> and <span data-link='BSE526'>BSE 526</span>. May be repeated to a total of 2 hours. May be taught concurrently with <span data-link='SEC626'>SEC 626</span>. Cannot receive credit for both <span data-link='SEC626'>SEC 626</span> and <span data-link='SEC526'>SEC 526</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC527": {
    "course_id": "SEC527",
    "title": "SEC 527 Teaching Adults in Vocational Education",
    "desc": "Rise of the adult education movement; learning abilities, educational interests and vocational needs of adults; problems and procedures in organizing and operating adult education programs; relationship of adult education to public school education. Identical with <span data-link='AGV527'>AGV 527</span> and <span data-link='AGE508'>AGE 508</span>. Cannot receive credit for <span data-link='SEC527'>SEC 527</span> and <span data-link='AGV527'>AGV 527</span> and <span data-link='AGE508'>AGE 508</span>. May be taught concurrently with <span data-link='SEC627'>SEC 627</span>. Cannot receive credit for both <span data-link='SEC627'>SEC 627</span> and <span data-link='SEC527'>SEC 527</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC528": {
    "course_id": "SEC528",
    "title": "SEC 528 Measurement and Evaluation of Vocational Education Programs",
    "desc": "Assessing specific program needs as determined from occupational surveys and other demographic data; follow-up techniques to evaluate the overall effectiveness of the program on manpower needs in a given labor market area. Identical with <span data-link='AGV528'>AGV 528</span> and <span data-link='BSE528'>BSE 528</span>. May be repeated to a total of 3 hours. May be taught concurrently with <span data-link='SEC628'>SEC 628</span>. Cannot receive credit for both <span data-link='SEC628'>SEC 628</span> and <span data-link='SEC528'>SEC 528</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC622": {
    "course_id": "SEC622",
    "title": "SEC 622 Philosophy of Vocational Education",
    "desc": "Philosophical foundations of vocational education; philosophies of vocational education in contemporary school. Identical with <span data-link='AGV622'>AGV 622</span> and <span data-link='BSE622'>BSE 622</span>. May be repeated to a total of 3 hours. May be taught concurrently with <span data-link='SEC522'>SEC 522</span>. Cannot receive credit for both <span data-link='SEC522'>SEC 522</span> and <span data-link='SEC622'>SEC 622</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC626": {
    "course_id": "SEC626",
    "title": "SEC 626 Coordination of Cooperative Education",
    "desc": "Problems and procedures in organizing and operating part-time cooperative and evening occupation programs. Restricted to those who can qualify as coordinators. Identical with <span data-link='AGV626'>AGV 626</span> and <span data-link='BSE626'>BSE 626</span>. May be repeated to a total of 2 hours. May be taught concurrently with <span data-link='SEC526'>SEC 526</span>. Cannot receive credit for both <span data-link='SEC526'>SEC 526</span> and <span data-link='SEC626'>SEC 626</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC627": {
    "course_id": "SEC627",
    "title": "SEC 627 Teaching Adults in Vocational Education",
    "desc": "Rise of the adult education movement; learning abilities, educational interests and vocational needs of adults; problems and procedures in organizing and operating adult education programs; relationship of adult education to public school education. Identical with <span data-link='AGV627'>AGV 627</span> and <span data-link='AGE608'>AGE 608</span>. Cannot receive credit for <span data-link='SEC627'>SEC 627</span> and <span data-link='AGV627'>AGV 627</span> and <span data-link='AGE608'>AGE 608</span>. May be taught concurrently with <span data-link='SEC527'>SEC 527</span>. Cannot receive credit for both <span data-link='SEC527'>SEC 527</span> and <span data-link='SEC627'>SEC 627</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC628": {
    "course_id": "SEC628",
    "title": "SEC 628 Measurement and Evaluation of Vocational Education Programs",
    "desc": "Assessing specific program needs as determined from occupational surveys and other demographic data; follow-up techniques to evaluate the overall effectiveness of the program on manpower needs in a given labor market area. Identical with <span data-link='AGV628'>AGV 628</span> and <span data-link='BSE628'>BSE 628</span>. May be repeated to a total of 3 hours. May be taught concurrently with <span data-link='SEC528'>SEC 528</span>. Cannot receive credit for both <span data-link='SEC528'>SEC 528</span> and <span data-link='SEC628'>SEC 628</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC701": {
    "course_id": "SEC701",
    "title": "SEC 701 Secondary School Curriculum",
    "desc": "Foundation course in the development and organization of the secondary school curriculum. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "SEC703": {
    "course_id": "SEC703",
    "title": "SEC 703 Seminar in Current Trends in Teaching English",
    "req": "<em>Prerequisite: <span data-link='ENG405'>ENG 405</span>.</em>",
    "desc": "For experienced teachers of English in grades 9-12; research and recent developments in teaching literature and composition. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC704": {
    "course_id": "SEC704",
    "title": "SEC 704 Seminar in Current Trends in Teaching Social Studies",
    "req": "<em>Prerequisite: <span data-link='HST418'>HST 418</span>.</em>",
    "desc": "For experienced teachers of social studies in grades 9-12; research and recent developments in teaching various areas of social studies. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC705": {
    "course_id": "SEC705",
    "title": "SEC 705 Curriculum Construction in Business Education",
    "desc": "Objectives and interrelationships of business education courses and programs. Development of curricular materials and evaluative devices. Identical to <span data-link='BSE705'>BSE 705</span>. May be repeated to a total of 3 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC706": {
    "course_id": "SEC706",
    "title": "SEC 706 Seminar in Current Trends in Teaching Business Education",
    "req": "<em>Prerequisite: <span data-link='BSE403'>BSE 403</span>.</em>",
    "desc": "For experienced teachers of business education in grades 9-12; research and recent developments in teaching business education. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC707": {
    "course_id": "SEC707",
    "title": "SEC 707 Seminar in Current Trends in Teaching Mathematics",
    "req": "<em>Prerequisite: <span data-link='MTH409'>MTH 409</span>.</em>",
    "desc": "For experienced teachers of mathematics in grades 9-12; research in recent trends and developments in teaching mathematics. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Fall": true
    }
  },
  "SEC708": {
    "course_id": "SEC708",
    "title": "SEC 708 Seminar in Current Trends in the Teaching of Biology",
    "req": "<em>Prerequisite: <span data-link='SCI414'>SCI 414</span>.</em>",
    "desc": "Methods of teaching biology; emphasizing modern techniques and developments in both the biological science curriculum and instructional procedures relating to that curriculum. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SEC783": {
    "course_id": "SEC783",
    "title": "SEC 783 Internship in Teaching I",
    "req": "<em>Prerequisite: <span data-link='SFR797'>SFR 797</span>; complete appropriate background check and obtain current professional liability insurance.</em>",
    "desc": "A site-based clinical experience. Students will observe the operations of a school, serve as teacher aides and administrative aides in the school; and work closely with school and community service organizations. Students will also complete an on-going seminar through online or literature based delivery systems. Students will implement an initial Teacher Work Sample in a classroom under the supervision of a cooperating teacher. ",
    "hours": {
      "credit": 3,
      "lecture": 1,
      "lab": 4
    },
    "offered": {
      "Fall": true
    }
  },
  "SEC784": {
    "course_id": "SEC784",
    "title": "SEC 784 Internship in Teaching II",
    "req": "<em>Prerequisite: <span data-link='SEC783'>SEC 783</span>; and acceptance into the Master of Arts in Teaching degree program.</em>",
    "desc": "The candidate must have successfully completed the Missouri Educator Gateway Assessments (MEGA) as established by the Missouri Board of Education, obtained current pre-professional liability insurance, completed the appropriate background check and be approved for supervised teaching. A semester-based supervised teaching experience. Students teach full time, under the supervision of a cooperating teacher and a University supervisor. Students also attend an ongoing seminar and design and implement a Teacher Work Sample required for graduation. The candidate&apos;s professional portfolio should be completed during this course. Supplemental course fee. ",
    "hours": {
      "credit": 10,
      "lecture": 2,
      "lab": 16
    },
    "offered": {
      "Spring": true
    }
  },
  "SEC785": {
    "course_id": "SEC785",
    "title": "SEC 785 Internship in Teaching III",
    "req": "<em>Prerequisite: <span data-link='SEC783'>SEC 783</span> and <span data-link='SEC784'>SEC 784</span>.</em>",
    "desc": "Students will complete a professional preparation portfolio. The professional portfolio will be evaluated by instructors in order to determine how well the candidate demonstrated understanding of DESE content standards and MoSPE standards. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR250": {
    "course_id": "SFR250",
    "title": "SFR 250 Foundations of American Education",
    "req": "<em>Prerequisite: completion of 30 semester hours.</em>",
    "desc": "This course introduces education majors to the departments. Knowledge Base with its emphasis on teachers as reflective decision-makers. It examines both the nature and history of the teaching profession, K-12 school orientation, and educational theories. It also explores sociocultural, political, and legal issues in American education. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR305": {
    "course_id": "SFR305",
    "title": "SFR 305 Field Experiences in Education",
    "desc": "Student attends scheduled discussion sessions on campus and participates in field experiences at Greenwood Laboratory School and/or area schools. Designed for transfer students who have partially completed the field experiences requirement and students working on a certification which requires a second field experience. 1(0-2) or ",
    "hours": {
      "credit": 2,
      "lab": 4
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "SFR351": {
    "course_id": "SFR351",
    "title": "SFR 351 Philosophical Problems of Education",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Introduction to educational problems involving language, logic, ethics, theory of knowledge, and theory of action, as they apply to school problems of pedagogy, curriculum, and policy. Contemporary and historical treatments of the problems. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR353": {
    "course_id": "SFR353",
    "title": "SFR 353 History of Educational Thought",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "The history of major educational ideas and their relationships to contemporary educational theories and practices. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR354": {
    "course_id": "SFR354",
    "title": "SFR 354 Social and Philosophical Foundations of American Education",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "The roles and functions of the school in the social and philosophical context of American culture. Attention to cultural diversity and its effects upon the school and the learner. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR396": {
    "course_id": "SFR396",
    "title": "SFR 396 Student Assessment and Evaluation",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Planning, constructing, using, and analyzing a variety of assessment practices to enable preservice teachers to make reflective decisions in the classroom. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR399": {
    "course_id": "SFR399",
    "title": "SFR 399 Problems in Education",
    "desc": "Independent research conducted on topics relevant to the field of education. The student and instructor mutually agree upon the direction and extent of the project. Credited only on the BSEd degree. May be repeated to a maximum of 3 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR442": {
    "course_id": "SFR442",
    "title": "SFR 442 Techniques of Classroom Management",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Emphasis on prevention of behavior problems. The study of theoretical approaches to handling disruptive behavior in the classroom. Application of theory to simulated classroom situations. Includes assistance in teaching students with handicaps and/or from different cultural backgrounds. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR444": {
    "course_id": "SFR444",
    "title": "SFR 444 Approaches to Individualizing Education",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Analyzing the academic interest, levels, and learning styles of the student. Methods of developing individual programs, self-instructional packages, and learning aids. Introduction to prepared materials and other technology to enable the teacher to individualize instruction. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR482": {
    "course_id": "SFR482",
    "title": "SFR 482 Teacher Relationships with the School of Society",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Professional responsibilities and roles of the teacher in relationships with students, staff, and community; job procurement and interview skills, teaching as a career and profession. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR486": {
    "course_id": "SFR486",
    "title": "SFR 486 Management and Assessment in the Middle and Secondary Classroom",
    "req": "<em>Prerequisite: admission to Teacher Education Program and <span data-link='PSY360'>PSY 360</span>, or equivalent competencies.</em>",
    "desc": "Planning, constructing, using, and analyzing a variety of assessment practices and understanding uses of standardized testing in education. Covers adolescent social behavior, management theory and strategies that promote effective learning and development while minimizing disruptive behavior. Application of theory to classroom practice and everyday situations. Identical with <span data-link='PSY486'>PSY 486</span>. Cannot receive credit for both <span data-link='SFR486'>SFR 486</span> and <span data-link='PSY486'>PSY 486</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "SFR521": {
    "course_id": "SFR521",
    "title": "SFR 521 Techniques for Teaching Adults",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "A survey of the principles, objectives and trends in instructional techniques for adult education. May be taught concurrently with <span data-link='SFR621'>SFR 621</span>. Cannot receive credit for both <span data-link='SFR621'>SFR 621</span> and <span data-link='SFR521'>SFR 521</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR547": {
    "course_id": "SFR547",
    "title": "SFR 547 Guidance and Interpersonal Relationships in the Classroom",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Appropriate classroom communication and interpersonal skills. Emphasis on the relationship between self concept development and achievement in a diverse student population. May be taught concurrently with <span data-link='SFR647'>SFR 647</span>. Cannot receive credit for both <span data-link='SFR647'>SFR 647</span> and <span data-link='SFR547'>SFR 547</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR576": {
    "course_id": "SFR576",
    "title": "SFR 576 Topical Issues in Education",
    "desc": "To develop further understanding and skills in the improvement of teaching procedures, curriculum, supervision, or administration. Each course is concerned with a single topic. Number of class hours determined by semester hours of credit. A maximum of 3 hours may be used on a degree program. Variable Content Course. May be taught concurrently with <span data-link='SFR676'>SFR 676</span>. Cannot receive credit for both <span data-link='SFR676'>SFR 676</span> and <span data-link='SFR576'>SFR 576</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR581": {
    "course_id": "SFR581",
    "title": "SFR 581 Law and the Classroom Teacher",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Rights and responsibilities of classroom teachers as determined by the legal structure created by state and federal constitutions, legislative actions, and judicial decisions. Implications of legal foundations for teachers relative to ethics, relationships with students, colleagues, minority groups, professional organizations, and others. May be taught concurrently with <span data-link='SFR681'>SFR 681</span>. Cannot receive credit for both <span data-link='SFR681'>SFR 681</span> and <span data-link='SFR581'>SFR 581</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR583": {
    "course_id": "SFR583",
    "title": "SFR 583 Contemporary Issues in Education",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "In-depth analysis of selected issues currently generating great interest and controversy in American education. Attention to the effects of the issues on the teaching profession, curriculum, instruction, and school personnel. May be taught concurrently with <span data-link='SFR682'>SFR 682</span>. Cannot receive credit for both <span data-link='SFR682'>SFR 682</span> and <span data-link='SFR583'>SFR 583</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR595": {
    "course_id": "SFR595",
    "title": "SFR 595 Applications of Educational Measurement",
    "req": "<em>Prerequisite: admitted to Teacher Education Program.</em>",
    "desc": "Using the results of testing in schools. The role, advantages, and limitations of evaluative instruments and techniques in educational decision making. May be taught concurrently with <span data-link='SFR695'>SFR 695</span>. Cannot receive credit for both <span data-link='SFR695'>SFR 695</span> and <span data-link='SFR595'>SFR 595</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR621": {
    "course_id": "SFR621",
    "title": "SFR 621 Techniques for Teaching Adults",
    "desc": "A survey of the principles, objectives and trends in instructional techniques for adult education. May be taught concurrently with <span data-link='SFR521'>SFR 521</span>. Cannot receive credit for both <span data-link='SFR521'>SFR 521</span> and <span data-link='SFR621'>SFR 621</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR647": {
    "course_id": "SFR647",
    "title": "SFR 647 Guidance and Interpersonal Relationships in the Classroom",
    "desc": "Appropriate classroom communication and interpersonal skills. Emphasis on the relationship between self concept development and achievement in a diverse student population. May be taught concurrently with <span data-link='SFR547'>SFR 547</span>. Cannot receive credit for both <span data-link='SFR547'>SFR 547</span> and <span data-link='SFR647'>SFR 647</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR676": {
    "course_id": "SFR676",
    "title": "SFR 676 Topical Issues in Education",
    "desc": "To develop further understanding and skills in the improvement of teaching procedures, curriculum, supervision, or administration. Each course is concerned with a single topic. Number of class hours determined by semester hours of credit. A maximum of 3 hours may be used on a degree program. Variable Content Course. May be taught concurrently with <span data-link='SFR576'>SFR 576</span>. Cannot receive credit for both <span data-link='SFR576'>SFR 576</span> and <span data-link='SFR676'>SFR 676</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR681": {
    "course_id": "SFR681",
    "title": "SFR 681 Law and the Classroom Teacher",
    "req": "<em>Prerequisite: Teacher Certification students must be admitted to Teacher Education Program.</em>",
    "desc": "Rights and responsibilities of classroom teachers as determined by the legal structure created by state and federal constitutions, legislative actions, and judicial decisions. Implications of legal foundations for teachers relative to ethics, relationships with students, colleagues, minority groups, professional organizations, and others. May be taught concurrently with <span data-link='SFR581'>SFR 581</span>. Cannot receive credit for both <span data-link='SFR581'>SFR 581</span> and <span data-link='SFR681'>SFR 681</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR682": {
    "course_id": "SFR682",
    "title": "SFR 682 Contemporary Issues in Education",
    "req": "<em>Prerequisite: Teacher Certification students must be admitted to Teacher Education Program.</em>",
    "desc": "In-depth analysis of selected issues currently generating great interest and controversy in American education. Attention to the effects of the issues on the teaching profession, curriculum, instruction, and school personnel. May be taught concurrently with <span data-link='SFR583'>SFR 583</span>. Cannot receive credit for both <span data-link='SFR583'>SFR 583</span> and <span data-link='SFR682'>SFR 682</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR695": {
    "course_id": "SFR695",
    "title": "SFR 695 Applications of Educational Measurement",
    "req": "<em>Prerequisite: Teacher Certification students must be admitted to Teacher Education Program.</em>",
    "desc": "Using the results of testing in schools. The role, advantages, and limitations of evaluative instruments and techniques in educational decision making. May be taught concurrently with <span data-link='SFR595'>SFR 595</span>. Cannot receive credit for both <span data-link='SFR595'>SFR 595</span> and <span data-link='SFR695'>SFR 695</span>. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR709": {
    "course_id": "SFR709",
    "title": "SFR 709 Individualizing Instruction",
    "desc": "Training in various procedures for individualizing instruction at all grade levels. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR711": {
    "course_id": "SFR711",
    "title": "SFR 711 Principles and Organization of Student Activities",
    "desc": "Acquaints teachers and administrators with problems and procedures involved in the organizations and supervision of student activities. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR723": {
    "course_id": "SFR723",
    "title": "SFR 723 Organization and Administration of Adult Education",
    "desc": "Theory and practice relating to the organization, administration, and supervision of adult education. Emphasis will be placed upon adult education programs in the public school and the junior-community college. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR724": {
    "course_id": "SFR724",
    "title": "SFR 724 Organization and Administration of Vocational Education",
    "desc": "Problems, procedures and local, state and federal relationships in organization and administration of vocational education in the contemporary school. Identical with <span data-link='AGV724'>AGV 724</span>. May be repeated to a maximum of 3 credit hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR730": {
    "course_id": "SFR730",
    "title": "SFR 730 Curriculum Construction in the School",
    "desc": "Traditional, humanistic, and behavioristic approaches to advanced curriculum development in the school. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR750": {
    "course_id": "SFR750",
    "title": "SFR 750 Philosophies of Education",
    "desc": "Philosophical problems of education; philosophical systems in America; their effect upon educational practice. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR753": {
    "course_id": "SFR753",
    "title": "SFR 753 Comparative Educational Systems",
    "desc": "Comparative analysis of major ideas and institutions of selected international systems of education. Comparisons between international systems of education and systems dominant in America. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR780": {
    "course_id": "SFR780",
    "title": "SFR 780 Educational Research Methodology",
    "desc": "Survey of research methods used in education; research design and evaluation; problems of interpretation and application; development of a formal research proposal. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true,
      "Summer": true
    }
  },
  "SFR781": {
    "course_id": "SFR781",
    "title": "SFR 781 Educational Research Literacy",
    "desc": "Introduction to the appreciation and understanding of research and common research methods in Education. In addition to basic research concepts, students will learn to read, understand, evaluate, and synthesize research, and explore the application of research results in their professional work. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR791": {
    "course_id": "SFR791",
    "title": "SFR 791 Educational Workshop",
    "desc": "Workshop to upgrade understandings and skills, concerned with the improvement of secondary teaching procedures, curriculum, supervision, administration or guidance. Each workshop will be concerned with a single topic. Number of class hours determined by length of workshop. May be repeated to a maximum of 9 hours. Thirty clock hours equal one credit hour. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR792": {
    "course_id": "SFR792",
    "title": "SFR 792 Supervision of Student Teachers",
    "req": "<em>Prerequisite: valid elementary or secondary teaching certificate.</em>",
    "desc": "For public school teachers cooperating in college student-teaching programs; organizing and directing work of the student teacher. ",
    "hours": {
      "credit": 2,
      "lecture": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR793": {
    "course_id": "SFR793",
    "title": "SFR 793 Qualitative Research Methods",
    "desc": "This course is focused on qualitative methods in the social sciences and specifically in educational research, including educational action research. Depending on prior research work, students will plan, implement, or further a qualitative or action research study. Students will learn firsthand about collecting and analyzing qualitative data, developing theories, and writing up the results. Students will also explore the role of educational action research in professional development, in improving classroom practices, and in developing school policy. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR794": {
    "course_id": "SFR794",
    "title": "SFR 794 Research Practicum",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "Conducting research projects with schools and other educational agencies. Students will be engaged in articulating research problems, reviewing literature, collecting and analyzing data, and presenting results. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR796": {
    "course_id": "SFR796",
    "title": "SFR 796 Problems in Education",
    "desc": "Specific problems in education related to needs and interests of the student. May be repeated to a total of 3 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR797": {
    "course_id": "SFR797",
    "title": "SFR 797 Advanced Studies in Teaching and Learning",
    "req": "<em>Prerequisite: admitted to the Master of Arts in Teaching program.</em>",
    "desc": "The purpose of this course is to develop deep understandings and skills regarding secondary teaching, procedures, methods, curriculum, supervision, administration and foundations. Candidates will be introduced to the electronic portfolio. Portfolio checkpoint one will occur in this course. ",
    "hours": {
      "credit": 9
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR799": {
    "course_id": "SFR799",
    "title": "SFR 799 Thesis",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "May be repeated to a maximum of 6 hours credit. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR858": {
    "course_id": "SFR858",
    "title": "SFR 858 Current Issues Affecting Education",
    "desc": "This multi-disciplinary mini-course is composed of selected topics of current interest to all school personnel. Opportunities are provided for object examination of highly volatile controversies surrounding education. May be repeated for a total of 6 hours credit. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "SFR890": {
    "course_id": "SFR890",
    "title": "SFR 890 Field Research and Evaluation",
    "req": "<em>Prerequisite: <span data-link='SFR780'>SFR 780</span>.</em>",
    "desc": "Specifically designed to give each student the prerequisite skills and competencies necessary for completion of field study research project(s) as well as preparation for conducting on-the-job institutional research. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  }
}