{
  "CRM210": {
    "course_id": "CRM210",
    "title": "CRM 210 Introduction to the American Criminal Justice System",
    "desc": "An overview of the American criminal justice system, its functions, problems and potential solutions. This course is a prerequisite for upper division criminology and criminal justice courses. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM215": {
    "course_id": "CRM215",
    "title": "CRM 215 Career Preparation in Criminology and Criminal Justice",
    "desc": "Acquaint students with the types of job opportunities available in the field of criminology and criminal justice including required credentials, career preparation, and the job search process. Opportunities for graduate study, along with the process of applying for more advanced education, also are discussed. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM250": {
    "course_id": "CRM250",
    "title": "CRM 250 Policing",
    "desc": "This course examines the history, structure and function of law enforcement as a means of addressing behavior which violates the law. Problems faced by law enforcement and solutions to those problems are also discussed. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM260": {
    "course_id": "CRM260",
    "title": "CRM 260 Criminal Law and the Courts",
    "desc": "This course examines the basic principles, processes, and structures found in adult criminal courts in the United States and Missouri. The course also examines the nature and development of criminal law from the Common Law to its current state nationwide, with an emphasis on current Missouri criminal law. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM270": {
    "course_id": "CRM270",
    "title": "CRM 270 Institutional and Community-Based Corrections",
    "desc": "A course designed to critically examine the various social control responses to delinquent and criminal behavior. Includes the history, philosophies, and practices of American corrections and an evaluation of the advantages and disadvantages of each societal/correctional response. Problems in the field of corrections and related solutions are also examined. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM300": {
    "course_id": "CRM300",
    "title": "CRM 300 Service Learning in Criminology",
    "req": "<em>Prerequisite: 30 hours and concurrent registration in a Criminology course designated as service learning offering.</em>",
    "desc": "An integrative learning experience which addresses the practice of citizenship and promotes an awareness of and participation in public affairs by incorporating community service with classroom instruction. Includes 40 hours on-task service to a community organization, agency or public service provider. The community service placement agency and service assignment will vary, dependent on the disciplinary course topic and learning objectives. May be repeated. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM301": {
    "course_id": "CRM301",
    "title": "CRM 301 Crime and the Media",
    "desc": "A sociologically-based exploration of the relationship between various forms of mass media as they impact public attitudes and social policies regarding crime and the justice system. Solutions to problems created by the media are also discussed. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM302": {
    "course_id": "CRM302",
    "title": "CRM 302 Reforming America's Prisons",
    "desc": "This course explores the nature of confinement used by the American criminal justice system and includes a study of prisons and jails. Both the humanitarian and rehabilitative conditions of these facilities are reviewed in a critical context with attention paid to ways in which existing problems may be corrected. Prison reform is studied from a system-wide perspective recognizing the role of legislatures, courts, and the public in bringing about effective reform. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM303": {
    "course_id": "CRM303",
    "title": "CRM 303 Capital Punishment",
    "desc": "Students explore the history of the death penalty as well as its current use in the United States. Methods of execution and their impact upon executioners, death penalty jurors, and the families of both the executed and their victim&apos;s family members are analyzed. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM304": {
    "course_id": "CRM304",
    "title": "CRM 304 Sex Crimes",
    "desc": "This course highlights sex offenses, sex offenders, victims of sex offenses and a variety of responses to sexual offending patterns. Definition of different sex crimes will be discussed, along with an examination of the violence involved and policies geared towards these types of offenses. Methods of working with sex offenders in rehabilitative efforts are also discussed. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM305": {
    "course_id": "CRM305",
    "title": "CRM 305 Serial Killers",
    "desc": "This course provides education and knowledge about serial killers, highlighting a few of the most notorious serial killers in the United States. Definitions of serial killing, an examination of serial killing typologies, root causes of serial killing, and the patterns of serial killers are examined. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM306": {
    "course_id": "CRM306",
    "title": "CRM 306 Criminal Profiles: Who Did It?",
    "desc": "This course is designed to expose students to patterns of criminal behavior within the context of justice, law and society. Students will identify and analyze the nature of the offense, the manner in which it was committed, along with various aspects of the criminal&apos;s background, behavior, and motive during and after the crime. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM307": {
    "course_id": "CRM307",
    "title": "CRM 307 Life Behind Bars: Got Time?",
    "desc": "This course highlights the dynamics of interaction that take place between inmates and staff in a correctional setting. Students will examine the various deprivations inmates face during incarceration, and their methods for compensation through developing networks of interactions that focus on the illegal trade of goods and services. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM308": {
    "course_id": "CRM308",
    "title": "CRM 308 To Shoot or Not To Shoot: Ethical Dilemmas in Criminal Justice",
    "desc": "This course examines and nature and meaning of ethical behavior within the context of the criminal justice system. Students will identify the various ethical dilemmas faced by law enforcement, courtroom and correctional practitioners, as well as examine their own views of right and wrong. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM309": {
    "course_id": "CRM309",
    "title": "CRM 309 Bad Girls: An Introduction to Aggressive and Delinquent Females",
    "desc": "&quot;Bad girls&quot; of society have developed a reputation for their increasingly aggressive behaviors. This course will discuss and investigate the unique characteristics, distinct traits and needs of the female delinquent. Effective approaches for working with this population will also be explored. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM310": {
    "course_id": "CRM310",
    "title": "CRM 310 Investigating Motive in Hate Crime and Terrorism",
    "desc": "The purpose of this course is to critically examine the motives behind hate crime, domestic terrorism, and foreign terrorism. Course will explore both the various types of motives as well as methods of using our understanding of motive to prevent acts of violence and disruption. Attention will be given to psychological, economic, and social factors which contribute to a hate crime or terrorism mindset. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM311": {
    "course_id": "CRM311",
    "title": "CRM 311 Cybercrime",
    "desc": "This course will provide the student with an overview of cybercrime and the offenders who commit the offense. It will explore the various types of cybercrime including internet pornography, harassment, fraud, and hacking. Legal issues regarding cybercrime will also be discussed. Methods of combatting cybercrime and assisting the victims of cybercrime will be presented. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM313": {
    "course_id": "CRM313",
    "title": "CRM 313 Prison Violence and Disorder",
    "desc": "This course examines the nature, extent, and causes of prison violence. It explores the psychological, environmental, cultural, and organizational factors that contribute to various forms of violence and disorder in prisons. Special emphasis is placed on identifying solutions for correctional policy and practice to reduce incidents of assault, riots, and gang disturbances in prisons. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM314": {
    "course_id": "CRM314",
    "title": "CRM 314 Forensic Science and Cases of Injustice",
    "desc": "With particular emphasis on the study of forensic science (science within the framework of the American legal system), this course evaluates various types of evidence left behind at the crime scene, the technology and protocols used to collect and evaluate each piece of evidence, the weight/value each piece of evidence should be assigned within the investigation, as well as the qualifications and scope (range of expertise) each testifying expert must provide. In addition and through case studies, students will be exposed to problems within the America legal system which can result in the conviction of innocent people. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM316": {
    "course_id": "CRM316",
    "title": "CRM 316 Post-Conviction Justice Clinic",
    "req": "<em>Prerequisite: <span data-link='CRM314'>CRM 314</span>.</em>",
    "desc": "This course provides hands-on, real world experience to students charged with re-investigating cases of currently incarcerated defendants seeking post-conviction relief and making claims of actual innocence to the Midwest Innocence Project (University of Missouri-Kansas City School of Law). With particular emphasis on the examination of forensic evidence, students will evaluate various aspects of each case, ultimately creating a detailed and science-based report of their findings. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM320": {
    "course_id": "CRM320",
    "title": "CRM 320 Criminological Theory",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "Examines the nature and dimensions of juvenile delinquency and adult criminality. Historical and contemporary theories of crime and delinquency are reviewed as are possible solutions to the forces which may generate delinquent and criminal behavior. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM325": {
    "course_id": "CRM325",
    "title": "CRM 325 Family Violence",
    "desc": "This course is designed as an introduction to the study of family violence. Students will develop an understanding of the major issues related to child abuse, sibling abuse, intimate partner violence, and elder abuse. Students will be introduced to the criminological literature on family violence. The course will explore the social causes and consequences of family violence, the prevention of family violence, and the criminal justice response to family violence. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM330": {
    "course_id": "CRM330",
    "title": "CRM 330 Juvenile Justice",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course reviews the topic of juvenile delinquency, with primary focus on a review of the history, extent and significance of delinquency and traces the emergence and effectiveness of the juvenile justice system as a societal response to juvenile offenders. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM332": {
    "course_id": "CRM332",
    "title": "CRM 332 Seminar on Violence",
    "desc": "Acts of violence and violent predators will be explored through this course. Research on criminal violence will be offered with theoretical explanations. Crimes emphasized through the course material will include homicide, assault, robbery, rape and hate crime. Family, workplace, schools and gang violence will also be examined. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM333": {
    "course_id": "CRM333",
    "title": "CRM 333 Sex Offenses",
    "desc": "This course examines sexual offenses, including the crimes and the criminals, with an emphasis on definitions, motives, theories and explanations. A variety of sex crimes will be discussed with perspectives being offered about the crimes, offenders, victims and criminal justice system with relation to this type of behavior. Fetishes and paraphilias will be explored through the investigation into sexual offending cycles. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM335": {
    "course_id": "CRM335",
    "title": "CRM 335 Criminal Typologies",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span>.</em>",
    "desc": "This course is designed to examine the nature and extent of criminal behavior. Students will explore patterns of offender behavior including crimes against the person, interpersonal violence, property crimes, white collar and organized crime, public order crimes and political crimes. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM340": {
    "course_id": "CRM340",
    "title": "CRM 340 Research Methods in Criminology and Criminal Justice",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "An overview of research design as applied to research on crime and justice. Topics include hypothesis formulation, sampling techniques, reliability and validity, survey construction, field observation, and evaluation research. May be taught concurrently with <span data-link='CRM641'>CRM 641</span>. Cannot receive credit for both <span data-link='CRM340'>CRM 340</span> and <span data-link='CRM641'>CRM 641</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM351": {
    "course_id": "CRM351",
    "title": "CRM 351 Trafficking of Humans, Drugs, and Guns",
    "desc": "This course examines rapidly changing issues such as drug trafficking, human trafficking, and illegal arms trading that are major areas of concern for law enforcement, politicians, and policy makers, and an increasingly important area of research. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM355": {
    "course_id": "CRM355",
    "title": "CRM 355 Current Issues in Policing",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course addresses a selection of contemporary issues and controversies facing police officers and law enforcement agencies. Topics covered may include, but are not limited to, problem-oriented and community policing, police use of force, racial profiling, leadership in law enforcement, and police corruption. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM365": {
    "course_id": "CRM365",
    "title": "CRM 365 Criminal Procedure",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course critically examines the constitutional and other legal controls placed on the government&apos;s ability to collect evidence to be used in criminal proceedings. Special attention is given to Supreme Court decisions related to the issues of privacy, detention, arrest, searches, seizures, interrogations, confessions, wiretapping and eavesdropping, right to counsel, and protections against self-incrimination. Issues of officer liability are also addressed. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM375": {
    "course_id": "CRM375",
    "title": "CRM 375 Current Issues in Corrections",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course addresses a selection of contemporary issues and controversies facing corrections officers and corrections agencies. Topics covered may include, but are not limited to, inmate-staff relations, inmate subculture, management issues, and reentry issues ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM380": {
    "course_id": "CRM380",
    "title": "CRM 380 Criminal Justice Organizations and Management",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course provides an overview of organizational theory and administrative behavior in criminal justice agencies, and exposes students to the latest research and practices in criminal justice management and organizations. Effects of leadership decision-making, court cases, personnel policies, budgeting, and planning on the justice system are analyzed. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM396": {
    "course_id": "CRM396",
    "title": "CRM 396 Directed Readings in Criminology",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and permission of instructor.</em>",
    "desc": "Readings designed to introduce students to new material or to supplement material introduced in previous departmental courses. May be repeated to total of 6 hours if topic changes. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM397": {
    "course_id": "CRM397",
    "title": "CRM 397 Special Topics in Criminology",
    "desc": "A variable topic course offering an overview of one or more issues related to criminology. May be repeated when topic changes. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM410": {
    "course_id": "CRM410",
    "title": "CRM 410 Crime, Justice, and Gender",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "A sociological examination of the impact of gender on crime and justice issues. The course format relates the impact of gender to the differential treatment of women and men as offenders, victims, and professionals in the system. Possible solutions to the problems identified in the course are also explored. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "CRM415": {
    "course_id": "CRM415",
    "title": "CRM 415 Crime, Class, Race, and Justice",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "A sociological examination of race and class issues in crime, victimization, the origins of law, and the operation of the American criminal justice system. Implications for social policy are explored. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "CRM420": {
    "course_id": "CRM420",
    "title": "CRM 420 Comparative Criminal Justice Systems",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "A comparative and historical study of the origins of law, crime rates, and the structure and operation of the criminal justice system in the United States as compared to other western and eastern nations. Included is the study of criminal and juvenile law, police, courts and the corrections system. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM425": {
    "course_id": "CRM425",
    "title": "CRM 425 Wrongful Convictions",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "This course is designed to provide students with an overview of criminal procedures leading to the wrongful conviction of alleged offenders. This will include an overview of the extent of wrongful convictions in the United States as well as the primary contributing factors of wrongful conviction. Students will also be exposed to potential policy changes and laws that have been made or suggested to reduce the incidence of wrongful convictions. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM430": {
    "course_id": "CRM430",
    "title": "CRM 430 Victimless Crime",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "A sociological examination of attempts to legally control private behavior covering both historical and contemporary examples such as prostitution, drug use, homosexuality, and abortion. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM435": {
    "course_id": "CRM435",
    "title": "CRM 435 Evidence",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course critically examines the laws and rules of evidence at trial. Common law rules and the Federal Rules of Evidence are discussed, along with leading court cases. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM440": {
    "course_id": "CRM440",
    "title": "CRM 440 Foundations of Homeland Defense and Security",
    "desc": "This course provides an overview of homeland security and defense undertaken in the United States since September 11, 2001. The course provides students with the generally accepted knowledge required of homeland security professionals. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM445": {
    "course_id": "CRM445",
    "title": "CRM 445 Victimology",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "This course examines the characteristics of crime victimization as it relates to the various components of the criminal justice system. Students will develop a better understanding of the contextual relationship between victims and offenders, as well as the role of police, courts and corrections in the dynamics of crime victimization, as well as the physical, emotional and financial impact of crime. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM475": {
    "course_id": "CRM475",
    "title": "CRM 475 Community Corrections",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course focuses on describing and evaluating the policies and initiatives used to monitor and treat criminal offenders sanctioned to community supervision. Community-based correctional programs and practices given special attention include probation and parole, work release, halfway houses, residential treatment centers, and diversionary programs. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM477": {
    "course_id": "CRM477",
    "title": "CRM 477 Geographic and Spatial Analysis of Crime",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "This course will provide an in-depth look at the history of our efforts to describe, understand, and respond to concentrations of crime across place and time. From early efforts in the 1800s to the most current research utilizing sophisticated computerized crime mapping, the questions of where, when, and why crime is most prevalent will be examined with a focus on how high-risk places and times can be addressed and prevented. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM480": {
    "course_id": "CRM480",
    "title": "CRM 480 The Gang Phenomenon",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "In this course students explore the history of the gang phenomenon, the variety and types of gangs, reasons why gangs form, their structure, the functions they serve for their members and the social policies which have been developed to deal with gangs. Solutions to the gang phenomenon are also investigated. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "CRM485": {
    "course_id": "CRM485",
    "title": "CRM 485 Drugs in Society",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM320'>CRM 320</span>.</em>",
    "desc": "An important social problem facing our society today is that of drug use/abuse. This problem cuts across all cultures, as well as across social class, sex, and racial groups. It affects the economy of the country as well as the image we, as a nation, project to other peoples. It is a political issue of not just national, but also international proportions. In order to understand this problem better, this course attempts to place &quot;drugs&quot; in a sociological perspective and through using the sociological imagination. Solutions to the drug problem are also considered. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM487": {
    "course_id": "CRM487",
    "title": "CRM 487 Green Criminology",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course is designed to introduce students to the history, theories, law, and the nature of environmental crimes. Law enforcement, prosecutorial and judicial practices will be reviewed and set in their social and political context. Past, current and potential issues in green criminology will be examined regarding environmental crime. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM490": {
    "course_id": "CRM490",
    "title": "CRM 490 Internship in Criminology",
    "req": "<em>Prerequisite: Criminology major, completion of 18 hours in the CRM major program, and permission of instructor.</em>",
    "desc": "Faculty supervised experience in an agency related to issues of crime and justice. Students are expected to work 50 hours in the agency for each credit hour. Students must submit applications for <span data-link='CRM490'>CRM 490</span> no later than April 15 for subsequent summer (when offered) and fall enrollment, and November 1 for subsequent spring enrollment. ",
    "hours": {
      "credit": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM495": {
    "course_id": "CRM495",
    "title": "CRM 495 Criminal Justice Ethics",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and <span data-link='CRM250'>CRM 250</span> and <span data-link='CRM260'>CRM 260</span> and <span data-link='CRM270'>CRM 270</span>.</em>",
    "desc": "This course will address ethical issues in the criminal justice system at both the theoretical and applied levels. Students will examine critical issues encountered by victims, offenders, and practitioners within the criminal justice system. Emphasis will be placed on ethical dilemmas in the police, court, and correction systems. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM497": {
    "course_id": "CRM497",
    "title": "CRM 497 Special Issues in Criminology",
    "req": "<em>Prerequisite: <span data-link='CRM210'>CRM 210</span> and permission of instructor.</em>",
    "desc": "A variable topic course offering an in-depth analysis of one or more issues related to Criminology. May be repeated to a total of 6 hours when topic changes. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM597": {
    "course_id": "CRM597",
    "title": "CRM 597 Special Topics and Issues in Criminal Justice",
    "req": "<em>Prerequisite: permission of instructor.</em>",
    "desc": "A variable topic course examining issues of crime, its causes, as well as social and political responses to crime by various institutions including government, media, law enforcement, the courts, and corrections. Variable content course. May be repeated for a total of 6 hours if the topic changes. May be taught concurrently with <span data-link='CRM697'>CRM 697</span>. Cannot receive credit for both <span data-link='CRM697'>CRM 697</span> and <span data-link='CRM597'>CRM 597</span>. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM598": {
    "course_id": "CRM598",
    "title": "CRM 598 Senior Seminar in Criminology and Criminal Justice",
    "req": "<em>Prerequisite: <span data-link='CRM340'>CRM 340</span>; and Criminology major; and senior standing with 95 hours.</em>",
    "desc": "This is the capstone course for Criminology majors. Students in this course will examine contemporary policy, diversity and ethical issues involving crime and justice in society. Students will complete a policy analysis paper that integrates coursework taken for the Criminology major. Public Affairs Capstone Experience course. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM641": {
    "course_id": "CRM641",
    "title": "CRM 641 Research Methods in Criminology and Criminal Justice",
    "desc": "An overview of research design as applied to research on crime and justice. Topics include hypothesis formulation, sampling techniques, reliability and validity, survey construction, field observation, and evaluation research. May be taught concurrently with <span data-link='CRM340'>CRM 340</span>. Cannot receive credit for both <span data-link='CRM641'>CRM 641</span> and <span data-link='CRM340'>CRM 340</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM657": {
    "course_id": "CRM657",
    "title": "CRM 657 Forensic Psychology: Child Abuse and the Law",
    "desc": "Study of the legal issues related to child abuse and exploitation. Students will gain an understanding of the law pertaining to child cases and how interactions with children can bolster or diminish the quality of children&apos;s memory report as seen by the judicial system. The Greene County Prosecutor&apos;s Office will participate in the design of this course, thus the specific legal issues discussed will remain current and may change based on the needs of the community. Identical with <span data-link='PSY657'>PSY 657</span>. Cannot receive credit for both <span data-link='CRM657'>CRM 657</span> and <span data-link='PSY657'>PSY 657</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM697": {
    "course_id": "CRM697",
    "title": "CRM 697 Special Topics and Issues in Criminal Justice",
    "req": "<em>Prerequisite: permission of instructor.</em>",
    "desc": "A variable topic course examining issues of crime, its causes, as well as social and political responses to crime by various institutions including government, media, law enforcement, the courts, and corrections. Variable content course. May be repeated for a total of 6 hours if the topic changes. May be taught concurrently with <span data-link='CRM597'>CRM 597</span>. Cannot receive credit for both <span data-link='CRM597'>CRM 597</span> and <span data-link='CRM697'>CRM 697</span> unless topic changes. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM701": {
    "course_id": "CRM701",
    "title": "CRM 701 Criminal Justice Policy",
    "req": "<em>Prerequisite: admission to the MS in Criminology and Criminal Justice or MS in Administrative Studies with the Criminal Justice option.</em>",
    "desc": "This course takes a critical look at the construction, implementation, evaluation, and justification of a wide range of criminal justice policies and programs. Significant attention is given to methodological processes in determining policy and program effectiveness. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "CRM705": {
    "course_id": "CRM705",
    "title": "CRM 705 Applied Research in Criminal Justice",
    "req": "<em>Prerequisite: admission to the MS in Criminology and Criminal Justice program and successful completion of an undergraduate or graduate research methods course.</em>",
    "desc": "This course provides students with the background and skills necessary to conduct sound and ethical research in their professional fields and successfully navigate through academic research relevant to guiding and improving criminal justice policy and practice. The capstone requirement consists of a mini-research proposal. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "CRM715": {
    "course_id": "CRM715",
    "title": "CRM 715 Leadership and Management in Criminal Justice",
    "req": "<em>Prerequisite: admission to the MS in Criminology and Criminal Justice or MS in Administrative Studies with the Criminal Justice option.</em>",
    "desc": "This course familiarizes students with theories, issues, and innovations related to leadership and management in criminal justice settings. Students are exposed to techniques aimed at enhancing leadership and management capabilities. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "CRM720": {
    "course_id": "CRM720",
    "title": "CRM 720 Crime Theory and Policy",
    "req": "<em>Prerequisite: admission to the MS in Criminology and Criminal Justice or MS in Administrative Studies with the Criminal Justice option.</em>",
    "desc": "This course surveys various classical and contemporary theories of lawbreaking. The relationship between criminological theory and justice system policy is emphasized. A position paper on a theoretically-driven policy is required. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "CRM730": {
    "course_id": "CRM730",
    "title": "CRM 730 Juvenile Justice",
    "desc": "This course aims to stimulate and facilitate critical and reflective thought regarding the legitimacy and effectiveness of juvenile justice policy and practice in the United States. Students analyze the mission and goals of juvenile justice systems, organizational design and managerial and staff roles, contemporary policies and programs, and methods of performance evaluation in juvenile agencies. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM740": {
    "course_id": "CRM740",
    "title": "CRM 740 Foundations of Homeland Defense and Security",
    "desc": "This course provides an overview of homeland security and defense undertaken in the United States since September 11, 2001. The course provides students with the generally accepted knowledge required of homeland security professionals. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM745": {
    "course_id": "CRM745",
    "title": "CRM 745 Topics in Homeland Defense and Security",
    "req": "<em>Prerequisite: <span data-link='CRM740'>CRM 740</span>.</em>",
    "desc": "A comprehensive and integrated homeland security and defense strategy must also include the full range of elected officials, first responders, the human, animal and plant health communities, business and our citizens. This course will examine the application, progress and problems of the development and implementation of a homeland security/defense strategy. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM746": {
    "course_id": "CRM746",
    "title": "CRM 746 Global Criminology",
    "desc": "This course explores how the traditional field of criminology is being transformed by forces of globalization. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM747": {
    "course_id": "CRM747",
    "title": "CRM 747 Policing Terrorism",
    "desc": "This course examines the role of law enforcement in counter terrorism efforts in the United States. It explores law enforcement responses to terrorism from a critical, best-practices perspective and addresses controversial strategies employed by enforcement agencies responding to terrorism within the context of a democratic government. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM750": {
    "course_id": "CRM750",
    "title": "CRM 750 Law Enforcement and Community",
    "desc": "This course addresses concerns and issues facing law enforcement agencies within a community context. Administrative implications of these subjects will also be addressed. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM765": {
    "course_id": "CRM765",
    "title": "CRM 765 Legal Issues in Criminal Justice",
    "desc": "This course introduces the student to the role of law and courts in the criminal justice system, with a particular focus on the relationship of the law to police investigatory procedures. Particular emphasis is placed on the role of the United States Supreme Court in interpreting the Fourth, Fifth, and Sixth Amendments. Current legal issues in criminal justice will also be examined. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM770": {
    "course_id": "CRM770",
    "title": "CRM 770 Correctional Theory and Practice",
    "desc": "This course examines social control responses to lawbreakers including the exploration of classical and contemporary theories and philosophies that have guided American correctional policy, both institutional and community based. Management implications related to policy are addressed. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM780": {
    "course_id": "CRM780",
    "title": "CRM 780 Gangs and Gang Policy",
    "desc": "This course explores the nature and scope of street gangs and critically analyzes gang-control policies and programs. A variety of gang-related issues are discussed, including the problems inherent in defining the term &quot;gang,&quot; the historical development and organizational structure of gangs, and gang origination, persistence, desistence, prevalence, and migration. In addition, proposed solutions to gang problems are analyzed by examining such policies and programs as gang databases, gang prosecution units, gang enhancement statues, and civil injunctions. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM785": {
    "course_id": "CRM785",
    "title": "CRM 785 U.S. Drug Control Policy",
    "desc": "This course provides a historical overview of the formulation, implementation and evaluation of U.S. drug control policy. The focus is on critically reviewing the cultural, social and political forces that have shaped our nation&apos;s drug control policies and assessing the research that has been conducted to evaluate the effects of such policies. Topics to be examined include prohibition, interdiction, eradication, legalization, law enforcement and military responses, effects on the criminal justice system, treatment, education and prevention. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM790": {
    "course_id": "CRM790",
    "title": "CRM 790 Graduate Practicum in Criminology",
    "req": "<em>Prerequisite: permission of instructor.</em>",
    "desc": "Faculty supervised experience in a criminology-related agency. Students are expected to work 45 hours in the agency for each credit hour. The practicum includes academic reflection on work experience at the agency. May be repeated for up to 6 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM796": {
    "course_id": "CRM796",
    "title": "CRM 796 Independent Study in Criminology and Criminal Justice",
    "req": "<em>Prerequisite: admission to the MS in Criminology and Criminal Justice or the MS in Administrative Studies with the Criminal Justice option; and permission of instructor.</em>",
    "desc": "Faculty supervised independent research directed by a member of the department graduate faculty. May be repeated to a maximum of six hours when the topic varies. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "CRM797": {
    "course_id": "CRM797",
    "title": "CRM 797 Policy Analysis Capstone",
    "req": "<em>Prerequisite: completion of 27 hours in the MS in Criminology and Criminal Justice program, including the completion or concurrent enrollment in <span data-link='CRM701'>CRM 701</span>, <span data-link='CRM705'>CRM 705</span>, <span data-link='CRM715'>CRM 715</span> and <span data-link='CRM720'>CRM 720</span>; and permission of a graduate faculty member.</em>",
    "desc": "This capstone experience requires an in-depth analysis of a specific criminal justice policy with an emphasis on demonstrating an understanding of the policy (including its historical background and current applications), specifying strengths and weaknesses, and offering suggestions for future research and improvement of the policy. This course should be taken the last semester of coursework. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM798": {
    "course_id": "CRM798",
    "title": "CRM 798 Thesis I",
    "req": "<em>Prerequisite: completion of or concurrent enrollment in <span data-link='CRM701'>CRM 701</span>, <span data-link='CRM705'>CRM 705</span>, <span data-link='CRM715'>CRM 715</span>, and <span data-link='CRM720'>CRM 720</span>; and permission of graduate thesis committee following the successful defense of an initial concept paper.</em>",
    "desc": "This phase of the thesis process requires the completion and successful defense of a thesis prospectus, including statement of the problem, literature review, and methodology sections. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "CRM799": {
    "course_id": "CRM799",
    "title": "CRM 799 Thesis II",
    "req": "<em>Prerequisite: completion of or concurrent enrollment in <span data-link='CRM701'>CRM 701</span>, <span data-link='CRM705'>CRM 705</span>, <span data-link='CRM715'>CRM 715</span> and <span data-link='CRM720'>CRM 720</span>; and approval of thesis prospectus by the student&apos;s thesis committee.</em>",
    "desc": "This phase of the thesis process calls for the collection, analysis, and interpretation of data and the development of final conclusions and implications. The final product must be successfully defended in front of the thesis committee. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  }
}