{
  "REL100": {
    "course_id": "REL100",
    "title": "REL 100 Introduction to Religion",
    "req": "<em>General Education Course (Focus on Cultural Competence).</em>",
    "desc": "Investigates what religion is and does, compares culturally diverse religious ideas and practices. This course explores how religion influences the relationship between individual and community by examining religious ethical systems, and providing community engagement opportunities. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL101": {
    "course_id": "REL101",
    "title": "REL 101 Literature and World of the Old Testament/Hebrew Bible",
    "req": "<em>General Education Course (Focus on Humanities).</em>",
    "desc": "Explores the religion, life experiences, cultures, thoughts, and history of the ancient Israelites as found in their literature and artifacts. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL102": {
    "course_id": "REL102",
    "title": "REL 102 Literature and World of the New Testament",
    "req": "<em>General Education Course (Focus on Humanities).</em>",
    "desc": "An introduction to early Christian literature and the persons and movements that produced it in their Jewish and Greco-Roman contexts. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL103": {
    "course_id": "REL103",
    "title": "REL 103 History of the English Bible",
    "desc": "The ancient manuscripts of the Bible; early versions; the English Bible; evaluation of recent translations. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL131": {
    "course_id": "REL131",
    "title": "REL 131 Religion in America",
    "req": "<em>General Education Course (Focus on Social and Behavioral Sciences).</em>",
    "desc": "A historical survey of different religious groups in America and their contributions to American identity and values. Includes the connections between religious affiliation and race, ethnicity, gender, politics, the media, and other aspects of U.S. society and culture. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL197": {
    "course_id": "REL197",
    "title": "REL 197 Topics in Religious Studies",
    "desc": "Topics of general interest in the area of religious studies such as Humor in the Bible, Religion and Literature, Religion and Film. May be repeated, as topics change, to a maximum of 6 hours. Variable content course. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL200": {
    "course_id": "REL200",
    "title": "REL 200 Religion in the News",
    "desc": "Increases students&apos; awareness of the presence and relevance of religion in current events and examines the influence of the news media on shaping public awareness and opinion of religion-related issues. ",
    "hours": {
      "credit": 1,
      "lecture": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL210": {
    "course_id": "REL210",
    "title": "REL 210 Paths of World Religions",
    "req": "<em>General Education Course (Focus on Cultural Competence).</em>",
    "desc": "A global survey of religious movements, including Hinduism, Buddhism, Taoism, Confucianism, Judaism, Christianity, and Islam. Students will learn how these religions have affected individual and cultural identities in history and in the contemporary world. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL312": {
    "course_id": "REL312",
    "title": "REL 312 The Hebrew Prophets",
    "desc": "Recommended Prerequisite: <span data-link='REL101'>REL 101</span>. A survey of the prophetic literature of ancient Israel in its social and historical contexts. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL315": {
    "course_id": "REL315",
    "title": "REL 315 Native American Religions",
    "desc": "Recommended Prerequisite: <span data-link='REL131'>REL 131</span>. A survey of historical and contemporary Native American cultures and spiritualities, including Native responses to European contact and colonization. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL319": {
    "course_id": "REL319",
    "title": "REL 319 The Bible and Film",
    "desc": "This movie-viewing course enables students to compare and to contrast films reflecting on biblical stories and themes. Films are viewed and grouped according to biblical stories, books, and themes and change each semester. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL320": {
    "course_id": "REL320",
    "title": "REL 320 Jesus of Nazareth",
    "desc": "Recommended Prerequisite: <span data-link='REL102'>REL 102</span>. Jesus as presented in the canonical gospels and other early sources with attention given to literary and historical issues. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "REL321": {
    "course_id": "REL321",
    "title": "REL 321 Paul",
    "desc": "Recommended Prerequisite: <span data-link='REL102'>REL 102</span>. An introduction to the historical Paul and scholarly interpretation of his writings. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "REL323": {
    "course_id": "REL323",
    "title": "REL 323 Apocalypses",
    "req": "<em>Prerequisite: <span data-link='REL101'>REL 101</span> or <span data-link='REL102'>REL 102</span>.</em>",
    "desc": "A historical and socio-rhetorical analysis of ancient Jewish and Christian apocalyptic movements and literature with some attention to modern examples. Canonical texts such as Daniel and Revelation will be examined in the context of numerous extra-canonical Jewish and Christian apocalypses. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL330": {
    "course_id": "REL330",
    "title": "REL 330 Judaism",
    "desc": "A survey of the history and religion of the Jewish peoples, including the Holocaust, the State of Israel, and modern Jewish movements. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL332": {
    "course_id": "REL332",
    "title": "REL 332 Modern Religious Thought",
    "desc": "Examines ways modernity impacted philosophy of religion in Europe and North America in the twentieth century. Major movements studied may include: Existentialism (Nietzsche, Kierkegaard, Tillich); Process Thought (Whitehead); Feminism (Ruether, Daly); Deconstruction (Derrida, Caputo); and African American thought (King, Cone). ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL335": {
    "course_id": "REL335",
    "title": "REL 335 The Holocaust: Religious Perspectives",
    "desc": "Examines historical, theological and philosophical aspects of the Holocaust, from early anti-Semitism to the modern genocide of six million Jews and other targeted groups during World War II. Includes personal accounts of participants, responses of various religious leaders and institutions, and the significance of the Holocaust today. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL340": {
    "course_id": "REL340",
    "title": "REL 340 Christianity",
    "desc": "Surveys Christian history from the second century to the present, exploring how past events have led to the development of contemporary churches, denominations, beliefs, and practices. Major topics: Eastern Christianity, Medieval Christendom, the Protestant Reformation, the Enlightenment, and global Christianity in the twenty-first century. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL341": {
    "course_id": "REL341",
    "title": "REL 341 C. S. Lewis",
    "desc": "An analysis of a selection of Lewis&apos;s works of fiction and apologetics. Student will interpret these works in their historical, theological, philosophical, literary and cultural contexts. They will also read and discuss critiques of and challenges to Lewis&apos;s ideas. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL344": {
    "course_id": "REL344",
    "title": "REL 344 New Religious Movements",
    "desc": "Often negatively designated by outsiders as &quot;cults&quot;, New Religious Movements continue to emerge at a rapid rate. This course examines the histories, structures, beliefs, and impacts of such groups as the Church of Jesus Christ of Latter-day Saints, Nation of Islam, Scientology, Raelians, and others. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL345": {
    "course_id": "REL345",
    "title": "REL 345 African American Religious Experience",
    "desc": "Recommended Prerequisite: <span data-link='REL131'>REL 131</span>. Explores the establishment and maintenance of African American religious institutions, particularly the Black Churches and their future development. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL346": {
    "course_id": "REL346",
    "title": "REL 346 Sexuality and American Religion",
    "desc": "Recommended Prerequisite: <span data-link='REL131'>REL 131</span>. Examines historical and contemporary beliefs about sexuality as reflected in sexual practices and experiences, such as celibacy, marital and extra-marital sex, and homosexuality, in American Protestantism, Catholicism, Judaism, Islam, and Native American cultures. Also, the ways American social culture and religious attitudes about sexuality have influenced each other. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL347": {
    "course_id": "REL347",
    "title": "REL 347 Suffering and Meaning",
    "desc": "An exploration of religious approaches to suffering, death and the making of meaning in life. Students will survey the complex history of western responses to the &quot;problem of evil&quot; in the Bible, literature, theology, and philosophy of religion by reading texts from Augustine to Derrida. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL350": {
    "course_id": "REL350",
    "title": "REL 350 Islam",
    "desc": "Origin, expansion, and continuity of Islam, including pre-Islamic influences, Muhammad, Qur&apos;an and Tradition (hadith), sects, ritual and law, community and worldview, prayer and mysticism. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL355": {
    "course_id": "REL355",
    "title": "REL 355 Buddhism",
    "desc": "Recommended Prerequisite: <span data-link='REL210'>REL 210</span>. A broad survey of the diverse patterns and expressions of Buddhist life throughout history. Studies will examine the beliefs, practices, and values that have existed among adherents of Theravada, Mahayana, and Vajrayana Buddhism. Course materials will be drawn from Asian and Western cultures. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL357": {
    "course_id": "REL357",
    "title": "REL 357 Religions of China and Japan",
    "desc": "Recommended Prerequisite: <span data-link='REL210'>REL 210</span>. An historical survey of the major religions from East Asia, with particular emphasis given to their doctrines, practices, and institutions. The course will focus on Confucianism, Daoism, Buddhism, and Shinto. Some consideration will also be given to Korean religious traditions, religion in contemporary East Asia, and popular religious traditions. Important themes include cultural adaptation and religious competition in East Asian religious history. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL360": {
    "course_id": "REL360",
    "title": "REL 360 Hinduism",
    "desc": "Recommended Prerequisite: <span data-link='REL210'>REL 210</span>. An historical and thematic survey of the religions of India from the Vedic period to the present day. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL362": {
    "course_id": "REL362",
    "title": "REL 362 Jesus and the Parable Tradition",
    "desc": "A survey of extant parables in Greek, Jewish, Gnostic, Synoptic and Patristic traditions, and an examination of the history of methods in the interpretation of the Parables of Jesus. In the light of this study the student will read and interpret selected parables of Jesus. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL365": {
    "course_id": "REL365",
    "title": "REL 365 The Life and Thought of Martin Luther King, Jr.",
    "desc": "Recommended Prerequisite: <span data-link='REL131'>REL 131</span>. Studies the cultural roots, intellectual odyssey, social thought and action of Martin Luther King, Jr. Investigates his role in the Civil Rights Movement and compares him with other prominent leaders of this century. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Spring": true
    }
  },
  "REL370": {
    "course_id": "REL370",
    "title": "REL 370 Women and Religion",
    "desc": "Exploration of women&apos;s roles in Christianity and other religions. Alienation from places of power has had profound implications for the personal, social, political, economic, and religious aspects of women&apos;s existence. Course will examine patterns of religious domination of women and explore possibilities for transformation. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL385": {
    "course_id": "REL385",
    "title": "REL 385 Religious Studies Service Learning",
    "req": "<em>Prerequisite: 30 hours, concurrent registration in a Religious Studies course designated as a service learning offering.</em>",
    "desc": "Designed to provide a learning environment for research and reflection on the meaning of public and community service, this course is intended to strengthen human communities by modeling an ethos of service and integrating service into the Religious Studies curriculum. May be repeated. ",
    "hours": {
      "credit": 1,
      "lab": 2
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL390": {
    "course_id": "REL390",
    "title": "REL 390 Religion in Society",
    "desc": "Examines the relationship between religion and its social context. Students will explore the social nature of individual religious institutions. The relationship between religion and modernity will be studied. The course will pay special attention to the role of religion in American society, as well as the religious dimensions of class, gender, region, and race/ethnicity. Identical with <span data-link='SOC390'>SOC 390</span>. Cannot receive credit for both <span data-link='REL390'>REL 390</span> and <span data-link='SOC390'>SOC 390</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL397": {
    "course_id": "REL397",
    "title": "REL 397 Religious Studies Topics",
    "desc": "Recommended Prerequisite: 3 hours in Religious Studies. Selected topics of general interest in Religious Studies. Examples: Introduction to Archaeology and the Bible, Women in the Bible, Dead Sea Scrolls, the Holocaust, C. S. Lewis, Food and American Religion. May be repeated, as topics change, to a maximum of 9 hours. Variable content course. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL399": {
    "course_id": "REL399",
    "title": "REL 399 Independent Study",
    "req": "<em>Prerequisite: 9 hours in Religious Studies and permission of instructor.</em>",
    "desc": "Independent study of a Religious Studies topic related to student&apos;s major or special interest. Before registering for the course, student and instructor must sign an agreement that details the course requirements. May be repeated to a total of 6 hours. Variable content course. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL499": {
    "course_id": "REL499",
    "title": "REL 499 Internship in Religious Studies",
    "req": "<em>Prerequisite: Religious Studies major or minor and permission of instructor.</em>",
    "desc": "Supervised work experience in order to pursue a special interest in a professional setting where the student utilizes knowledge and skills acquire in the Religious Studies major or minor. May be repeated for a total of 6 hours, but no more than 3 hours may be counted toward the Religious Studies major or minor. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL510": {
    "course_id": "REL510",
    "title": "REL 510 Topics in Biblical Studies",
    "req": "<em>Prerequisite: 50 hours.</em>",
    "desc": "Recommended Prerequisite: <span data-link='REL101'>REL 101</span> or <span data-link='REL102'>REL 102</span>. Advanced study of canonical and non-canonical texts and related subjects. Examples: Genesis, The Social World of Ancient Israel, Dead Sea Scrolls, Historical Jesus, Acts as History and Literature, Revelation and Apocalyptic Literature. Variable content course. May be repeated, as topics change, to a maximum of 9 hours. May be taught concurrently with <span data-link='REL615'>REL 615</span>. Cannot receive credit for both <span data-link='REL615'>REL 615</span> and <span data-link='REL510'>REL 510</span> for the same topic. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL530": {
    "course_id": "REL530",
    "title": "REL 530 Topics in Religion and Culture",
    "req": "<em>Prerequisite: 50 hours.</em>",
    "desc": "Recommended Prerequisite: <span data-link='REL100'>REL 100</span> or <span data-link='REL131'>REL 131</span>. Explores advanced issues in the study of religion as a component of cultural life including issues of gender, race, and ethnicity. Examples of topics: Religion and Politics; Religion, Media, and Popular Culture; Religion and Visual Culture; American Religious Communities; Lived Religion; Bible Belt Religion; Food and Religion; Women and Religion. Variable content course. May be repeated, as topics change, to a maximum of 9 hours. May be taught concurrently with <span data-link='REL635'>REL 635</span>. Cannot receive credit for both <span data-link='REL635'>REL 635</span> and <span data-link='REL530'>REL 530</span> for the same topic. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL531": {
    "course_id": "REL531",
    "title": "REL 531 Ozarks Religion",
    "req": "<em>Prerequisite: 50 hours.</em>",
    "desc": "Recommended Prerequisite: <span data-link='REL131'>REL 131</span> or <span data-link='REL390'>REL 390</span> or <span data-link='SOC390'>SOC 390</span> or <span data-link='HST375'>HST 375</span> or <span data-link='ENG385'>ENG 385</span>. Explores the rich and varied terrain of Ozarks religious life, focusing on the impact of social change. This theme is explored through readings on rural and urban communities, Protestant revivalism, folklore and traditional practices, Ozarks Jewish life, Bible Belt Catholicism, Branson tourism, and the new immigrants. Students will use the methods of oral history interviewing and field observation to make sense of Ozarks religion. May be taught concurrently with <span data-link='REL636'>REL 636</span>. Cannot receive credit for both <span data-link='REL531'>REL 531</span> and <span data-link='REL636'>REL 636</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL540": {
    "course_id": "REL540",
    "title": "REL 540 Topics in the History of Religions",
    "req": "<em>Prerequisite: 50 hours.</em>",
    "desc": "Recommended Prerequisite: <span data-link='REL210'>REL 210</span>. Studies of advanced topics in comparative religions or in the history of a particular region or religious tradition. Topics may include material ranging from ancient history to the present day. Examples; Mysticism, Colonialism, Religion and Culture, Yoga, Fundamentalism. Variable content course. May be repeated, as topics change, to a maximum of 9 hours. May be taught concurrently with <span data-link='REL645'>REL 645</span>. Cannot receive credit for both <span data-link='REL645'>REL 645</span> and <span data-link='REL540'>REL 540</span> for the same topic. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL550": {
    "course_id": "REL550",
    "title": "REL 550 Topics in the History of Judaism and Christianity",
    "req": "<em>Prerequisite: 50 hours.</em>",
    "desc": "Recommended Prerequisite: RE: 330 or <span data-link='REL340'>REL 340</span>. Selected topics of advanced content in Christianity and Judaism. Examples: Death and Dying in the Christian Tradition; Spirituality in Christianity; Women in the History of Christianity; Reformation of the Sixteenth Century; Thought of Martin Luther; Eastern Christianity; Ritual in Orthodoxy, Catholicism and Protestantism. Variable content course. May be repeated up to 9 hours as topics change. May be taught concurrently with <span data-link='REL655'>REL 655</span>. Cannot receive credit for both <span data-link='REL655'>REL 655</span> and <span data-link='REL550'>REL 550</span> for the same topic. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL570": {
    "course_id": "REL570",
    "title": "REL 570 Archaeology and the Old Testament/Hebrew Bible",
    "req": "<em>Prerequisite: 50 hours.</em>",
    "desc": "Recommended prerequisite: <span data-link='REL101'>REL 101</span>. Archaeological discoveries in their relation to the literary, cultural, and religious background of the Old Testament/Hebrew Bible. Methods and objectives of archaeological research, including a brief history of Near Eastern archaeology. May be taught concurrently with <span data-link='REL675'>REL 675</span>. Cannot receive credit for both <span data-link='REL675'>REL 675</span> and <span data-link='REL570'>REL 570</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL571": {
    "course_id": "REL571",
    "title": "REL 571 Archaeology and the New Testament",
    "req": "<em>Prerequisite: 50 hours.</em>",
    "desc": "Recommended Prerequisite: <span data-link='REL102'>REL 102</span>. Archaeological discoveries in their relation to the literary, cultural, and religious background of the New Testament. Includes methods and objectives of archaeological research. May be taught concurrently with <span data-link='REL676'>REL 676</span>. Cannot receive credit for both <span data-link='REL676'>REL 676</span> and <span data-link='REL571'>REL 571</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL580": {
    "course_id": "REL580",
    "title": "REL 580 Theories of Religion",
    "req": "<em>Prerequisite: 60 hours and permission.</em>",
    "desc": "This required course for majors surveys influential theories of religion from the Enlightenment to the present and includes their relationship to public affairs. Students will write a major research paper involving theoretical perspectives learned in the course. May be taught concurrently with <span data-link='REL685'>REL 685</span>. Cannot receive credit for both <span data-link='REL685'>REL 685</span> and <span data-link='REL580'>REL 580</span>. Public Affairs Capstone Experience course. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "REL615": {
    "course_id": "REL615",
    "title": "REL 615 Topics in Biblical Studies",
    "desc": "Recommended Prerequisite: <span data-link='REL101'>REL 101</span> or <span data-link='REL102'>REL 102</span>. Advanced study of canonical and non-canonical texts and related subjects. Examples: Genesis, The Social World of Ancient Israel, Dead Sea Scrolls, Historical Jesus, Acts as History and Literature, Revelation and Apocalyptic Literature. Variable content course. May be repeated, as topics change, to a maximum of 9 hours. May be taught concurrently with <span data-link='REL510'>REL 510</span>. Cannot receive credit for both <span data-link='REL615'>REL 615</span> and <span data-link='REL510'>REL 510</span> for the same topic. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL635": {
    "course_id": "REL635",
    "title": "REL 635 Topics in Religion and Culture",
    "desc": "Recommended Prerequisite: <span data-link='REL100'>REL 100</span> or <span data-link='REL131'>REL 131</span>. Explores advanced issues in the study of religion as a component of cultural life including issues of gender, race, and ethnicity. Examples of topics: Religion and Politics; Religion, Media, and Popular Culture; Religion and Visual Culture; American Religious Communities; Lived Religion; Bible Belt Religion; Food and Religion; Women and Religion. Variable content course. May be repeated, as topics change, to a maximum of 9 hours. May be taught concurrently with <span data-link='REL530'>REL 530</span>. Cannot receive credit for both <span data-link='REL530'>REL 530</span> and <span data-link='REL635'>REL 635</span> for the same topic. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL636": {
    "course_id": "REL636",
    "title": "REL 636 Ozarks Religion",
    "desc": "Recommended Prerequisite: <span data-link='REL131'>REL 131</span> or <span data-link='REL390'>REL 390</span> or <span data-link='SOC390'>SOC 390</span> or <span data-link='HST375'>HST 375</span> or <span data-link='ENG385'>ENG 385</span>. Explores the rich and varied terrain of Ozarks religious life, focusing on the impact of social change. This theme is explored through readings on rural and urban communities, Protestant revivalism, folklore and traditional practices, Ozarks Jewish life, Bible Belt Catholicism, Branson tourism, and the new immigrants. Students will use the methods of oral history interviewing and field observation to make sense of Ozarks religion. May be taught concurrently with <span data-link='REL531'>REL 531</span>. Cannot receive credit for both <span data-link='REL636'>REL 636</span> and <span data-link='REL531'>REL 531</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL645": {
    "course_id": "REL645",
    "title": "REL 645 Topics in the History of Religions",
    "desc": "Recommended Prerequisite: <span data-link='REL210'>REL 210</span>. Studies of advanced topics in comparative religions or in the history of a particular region or religious tradition. Topics may include material ranging from ancient history to the present day. Examples; Mysticism, Colonialism, Religion and Culture, Yoga, Fundamentalism. Variable content course. May be repeated, as topics change, to a maximum of 9 hours. May be taught concurrently with <span data-link='REL540'>REL 540</span>. Cannot receive credit for both <span data-link='REL540'>REL 540</span> and <span data-link='REL645'>REL 645</span> for the same topic. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL655": {
    "course_id": "REL655",
    "title": "REL 655 Topics in the History of Judaism and Christianity",
    "desc": "Recommended Prerequisite: <span data-link='REL330'>REL 330</span> or <span data-link='REL340'>REL 340</span>. Selected topics of advanced content in Christianity and Judaism. Examples: Death and Dying in the Christian Tradition; Spirituality in Christianity; Women in the History of Christianity; Reformation of the Sixteenth Century; Thought of Martin Luther; Eastern Christianity; Ritual in Orthodoxy, Catholicism and Protestantism. Variable content course. May be repeated, as topics change, to a maximum of 9 hours. May be taught concurrently with <span data-link='REL550'>REL 550</span>. Cannot receive credit for both <span data-link='REL550'>REL 550</span> and <span data-link='REL655'>REL 655</span> for the same topic. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL675": {
    "course_id": "REL675",
    "title": "REL 675 Archaeology and the Old Testament/Hebrew Bible",
    "desc": "Recommended Prerequisite: <span data-link='REL101'>REL 101</span>. Archaeological discoveries in their relation to the literary, cultural, and religious background of the Old Testament/Hebrew Bible. Methods and objectives of archaeological research, including a brief history of Near Eastern archaeology. May be taught concurrently with <span data-link='REL570'>REL 570</span>. Cannot receive credit for both <span data-link='REL570'>REL 570</span> and <span data-link='REL675'>REL 675</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL676": {
    "course_id": "REL676",
    "title": "REL 676 Archaeology and the New Testament",
    "desc": "Recommended Prerequisite: <span data-link='REL102'>REL 102</span>. Archaeological discoveries in their relation to the literary, cultural, and religious background of the New Testament. Includes methods and objectives of archaeological research. May be taught concurrently with <span data-link='REL571'>REL 571</span>. Cannot receive credit for both <span data-link='REL571'>REL 571</span> and <span data-link='REL676'>REL 676</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL685": {
    "course_id": "REL685",
    "title": "REL 685 Theories of Religion",
    "req": "<em>Prerequisite: permission of department head.</em>",
    "desc": "This required course for majors surveys influential theories of religion from the Enlightenment to the present. Students will write a major research paper involving theoretical perspectives learned in the course. May be taught concurrently with <span data-link='REL580'>REL 580</span>. Cannot receive credit for both <span data-link='REL580'>REL 580</span> and <span data-link='REL685'>REL 685</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true
    }
  },
  "REL711": {
    "course_id": "REL711",
    "title": "REL 711 Seminar in South Asian Religions",
    "desc": "Recommended Prerequisite: <span data-link='REL710'>REL 710</span>. This seminar will examine a specific topic or tradition within South Asian religions. Students can expect to do focused reading, discussion, and research on a particular subject related to the Hindu, Buddhist, Jain, Sikh, and/or Muslim traditions of South Asia. Historical and contemporary material, along with critiques of scholarship in the field may be considered. May be repeated once if topic is different. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL731": {
    "course_id": "REL731",
    "title": "REL 731 Seminar in Biblical Studies",
    "desc": "Recommended Prerequisite: <span data-link='REL730'>REL 730</span>. This seminar examines a specific topic within the history and literature of the Hebrew Bible/Old Testament and/or New Testament. Students can expect to do focused reading, discussion, and research on a particular historical, literary, and/or methodological issue pertaining to the topic. Variable content course. May be repeated once if topic is different. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL751": {
    "course_id": "REL751",
    "title": "REL 751 Seminar in the History of Judaism and Christianity",
    "desc": "Recommended Prerequisite: <span data-link='REL750'>REL 750</span>. Detailed study of selected persons, authors, movements, and eras in the history of Judaism and Christianity. Variable content course. May be repeated once if topic is different. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL771": {
    "course_id": "REL771",
    "title": "REL 771 Seminar in Religion and Culture",
    "desc": "Recommended Prerequisite: <span data-link='REL770'>REL 770</span>. A seminar applying various perspectives to individual religious practice and religious institutions in selected Western and non-Western societies. May be repeated once if topic is different. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Upon demand": true
    }
  },
  "REL796": {
    "course_id": "REL796",
    "title": "REL 796 Readings in Religious Studies",
    "req": "<em>Prerequisite: recommendation of the Religious Studies general graduate advisor and permission of instructor.</em>",
    "desc": "Arranged program of readings for the individual student directed by a member of the graduate faculty. Before enrolling in the course, student and instructor must sign an agreement that details the course requirements. Variable content course. May be repeated, when topics varies, to a maximum of 9 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "REL799": {
    "course_id": "REL799",
    "title": "REL 799 Thesis",
    "req": "<em>Prerequisite: recommendation of the Religious Studies general graduate advisor and permission of student&apos;s thesis advisor.</em>",
    "desc": "The student will prepare an in-depth thesis on a clearly-defined topic within his or her area of specialization. Before enrolling in the course, student and thesis advisor must sign an agreement that details the course requirements. May be repeated to a maximum of 6 hours. ",
    "hours": {
      "credit": 1
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  }
}