{
  "MTH130": {
    "course_id": "MTH130",
    "title": "MTH 130 Contemporary Mathematics",
    "req": "<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span>, or approved score on a departmental placement test. General Education Course (Focus on Quantitative Literacy).</em>",
    "desc": "This is a problem solving and applications of mathematics course. Topics to be studied will include, but not limited to: the art of problem solving, geometry, probability, statistics, and mathematics of finance. Cannot count toward a mathematics major or minor. Cannot be taken Pass/Not Pass. <span data-link='MTH130'>MTH 130</span> does not meet the prerequisite for <span data-link='MTH135'>MTH 135</span>. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MTH135": {
    "course_id": "MTH135",
    "title": "MTH 135 College Algebra",
    "req": "<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span>, or appropriate placement score, Note: <span data-link='MTH130'>MTH 130</span> does not meet the prerequisite for <span data-link='MTH135'>MTH 135</span>. General Education Course (Focus on Quantitative Literacy).</em>",
    "desc": "Contents include the study of linear and quadratic equations; inequalities and their applications; polynomial, rational, exponential and logarithmic functions; and systems of equations. Cannot receive credit toward graduation for both <span data-link='MTH135'>MTH 135</span> and <span data-link='MTH138'>MTH 138</span>. Cannot count toward a mathematics major or minor. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH181'>MTH 181</span>, <span data-link='MTH285'>MTH 285</span>, or <span data-link='MTH287'>MTH 287</span>. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MTH138": {
    "course_id": "MTH138",
    "title": "MTH 138 Pre-Calculus Mathematics",
    "req": "<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span> (Recommended: &quot;B&quot; grade or better in <span data-link='MTH101'>MTH 101</span> or <span data-link='MTH103'>MTH 103</span>), or appropriate placement score. General Education Course (Focus on Quantitative Literacy).</em>",
    "desc": "Selected topics in algebra and trigonometry to prepare the student for calculus. Cannot receive credit toward graduation for both <span data-link='MTH138'>MTH 138</span> and <span data-link='MTH135'>MTH 135</span>. Cannot count toward a mathematics major or minor. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH261'>MTH 261</span>, 287, <span data-link='CSC125'>CSC 125</span> or 131. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 5,
      "lecture": 5
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MTH181": {
    "course_id": "MTH181",
    "title": "MTH 181 Trigonometry",
    "req": "<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH135'>MTH 135</span> or appropriate placement score. General Education Course (Focus on Quantitative Literacy).</em>",
    "desc": "Triangle trigonometry and its applications; trigonometric and inverse trigonometric functions; trigonometric identities and equations; Rational, exponential and logarithmic functions. Cannot receive credit toward graduation for both <span data-link='MTH181'>MTH 181</span> and <span data-link='MTH138'>MTH 138</span>. Cannot count toward a mathematics major or minor. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH287'>MTH 287</span>. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MTH215": {
    "course_id": "MTH215",
    "title": "MTH 215 Discrete Mathematics",
    "req": "<em>Prerequisite: <span data-link='MTH138'>MTH 138</span> or approved calculus course or appropriate placement score.</em>",
    "desc": "Topics include: logic, mathematical reasoning, basic counting, discrete probability, matrices, recursion, sets and relations, graphs and trees. ",
    "hours": {
      "credit": 3,
      "lecture": 3
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MTH261": {
    "course_id": "MTH261",
    "title": "MTH 261 Analytic Geometry and Calculus I",
    "req": "<em>Prerequisite: &quot;C&quot; grade or better in <span data-link='MTH138'>MTH 138</span> or <span data-link='MTH181'>MTH 181</span> or appropriate placement score. General Education Course (Focus on Quantitative Literacy).</em>",
    "desc": "Analytic geometry of the plane, limits, continuity, differentiation with applications, introductory integration with applications. A grade of &quot;C&quot; or better is required in this course in order to take <span data-link='MTH280'>MTH 280</span> or 288. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 5,
      "lecture": 5
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  },
  "MTH280": {
    "course_id": "MTH280",
    "title": "MTH 280 Analytic Geometry and Calculus II",
    "req": "<em>Prerequisite: &quot;C&quot; or better in <span data-link='MTH261'>MTH 261</span>.</em>",
    "desc": "Applications of integration, integration techniques, indeterminate forms, improper integrals, sequences, series, conic sections, parametrization, polar coordinates. Cannot be taken Pass/Not Pass. ",
    "hours": {
      "credit": 5,
      "lecture": 5
    },
    "offered": {
      "Fall": true,
      "Spring": true
    }
  }
}